[{"MatchedObjectId": "558553900", "MatchedObjectDescriptor": {"PositionID": "GS20H0022", "PositionTitle": "Computer Engineer, AST, Software Systems", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/558553900", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/558553900?PostingChannelID=RESTAPI"], "PositionLocationDisplay": "Greenbelt, Maryland", "PositionLocation": [{"LocationName": "Greenbelt, Maryland", "CountryCode": "United States", "CountrySubDivisionCode": "Maryland", "CityName": "Greenbelt, Maryland", "Longitude": -76.8789, "Latitude": 39.0002632}], "OrganizationName": "Goddard Space Flight Center", "DepartmentName": "National Aeronautics and Space Administration", "JobCategory": [{"Name": "Computer Engineering", "Code": "0854"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "Full-Time", "Code": "1"}], "PositionOfferingType": [{"Name": "Permanent", "Code": "15317"}], "QualificationSummary": "In addition to the Basic Education Requirement, you must have one year of specialized experience equivalent to the next lower grade (GS-13), which has equipped you with the particular competencies needed to successfully perform the duties of the position described above.To qualify for the GS-14:One year of specialized experience is defined as experience in applying advanced professional software engineering theories, principles, concepts, standards, and methodologies as well as use of programming languages, operating systems and engineering practices and principles used in software development and engineering to develop and operate aerospace, aeronautical, space science and/or earth science vehicles, spacecraft and/or instruments; Experience working with high-level programming languages and software development tools; mission ground software system domains, architectures, applications, and interfaces; Experience developing ground/mission operations software, testing/validating software; group leadership experience; Experience developing courses of action to resolve, implement and update solutions for problems/anomalies; Experience conducting management briefings and applying effective communication skills to deliver all types of messages to management and team members.", "PositionRemuneration": [{"MinimumRange": "121316.0", "MaximumRange": "157709.0", "RateIntervalCode": "Per Year"}], "PositionStartDate": "2020-02-04", "PositionEndDate": "2020-02-10", "PublicationStartDate": "2020-02-04", "ApplicationCloseDate": "2020-02-10", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "NASA Goddard Space Flight Center is seeking a Senior Software Engineer for the Ground Software Systems Branch of the Software Engineering Division in the Engineering and Technology Directorate in Greenbelt, MD. The selected candidate will serve as the Lead Software Engineer for the Goddard Mission Services Evolution Center (GMSEC). Responsibilities include providing software products for Earth/space science missions such as spacecraft commanding and telemetry monitoring and analysis.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "14", "HighGrade": "14", "PromotionPotential": "14", "HiringPath": ["public"], "TotalOpenings": "1", "AgencyMarketingStatement": "", "TravelCode": "1", "ApplyOnlineUrl": "https://applyonline.nasa.gov/apply", "DetailStatusUrl": "https://applyonline.nasa.gov/status"}, "IsRadialSearch": false}}, "RelevanceRank": 0.0}, {"MatchedObjectId": "557862600", "MatchedObjectDescriptor": {"PositionID": "20-02", "PositionTitle": "Senior Software Developer", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/557862600", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/557862600?PostingChannelID=RESTAPI"], "PositionLocationDisplay": "Washington, District of Columbia", "PositionLocation": [{"LocationName": "Washington, District of Columbia", "CountryCode": "United States", "CountrySubDivisionCode": "District of Columbia", "CityName": "Washington, District of Columbia", "Longitude": -77.032, "Latitude": 38.8904}], "OrganizationName": "U.S. Tax Court", "DepartmentName": "Judicial Branch", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "Full-Time", "Code": "1"}], "PositionOfferingType": [{"Name": "At-Will. Not to Exceed 3 years. Court may extend the appointment or convert position to permanent based on the needs of the Court at the end of the 3-year term.", "Code": "15319"}], "QualificationSummary": "You must demonstrate expert knowledge of and considerable experience in the following requirements: Expert Software Developer: Serves as an expert software developer, managing and directing multiple highly complex and innovative IT projects or initiatives. This includes translating technical specifications into programming specifications; and developing, testing, deploying, debugging, and maintaining software. Provides expert leadership and guidance in how to use user research findings to influence software product development. The strongest candidates will have significant experience with JavaScript, cloud, and leading development teams. Project Leadership: Provides expert technical advice, leadership, and direction on all software development related issues for the improvement of a project or initiative. Provides expert recommendations, analyses, and advice for consideration by senior leadership; applies innovative practices to previously unsolvable problems; and makes recommendations that significantly influence important policies or programs. Provides input on project objectives and priorities and anticipates potential threats and opportunities. Establishes a shared understanding across team members and stakeholders. Leads, coordinates, communicates, integrates and is accountable for the overall success of the program, ensuring alignment with critical organization priorities. Mentors team members and improves practices and standards. Provides Leadership to Ad Hoc Teams: Leads cross functional teams to develop innovative software and/or services. Focuses team efforts towards current goals and priorities. Plans, develops, and executes IT projects that transform the manner in which work is accomplished. Determines the size, skills, and roles necessary for an ad hoc team to deliver a product and identifies appropriate team members. Tailors agile delivery methodology to meet team needs. Introduces and implements the use of new technologies or tools within the organization Relationship Management: Serves as a liaison to high-ranking stakeholders to effectively convey information regarding agile project activities, policies and goals; to clarify procedures; and to provide advice on decisions or interpret directives as needed. Provide accurate technical advice. Utilizes interpersonal skills to develop cooperative relationships. Works closely with stakeholders to identify and mitigate risks, solve problems, and resolve conflicting priorities. Reinforces, upholds, and advocates for modern software development best practices for building IT services, including building in the open, developing software using agile and lean methodologies, and using user-centered design methods.", "PositionRemuneration": [{"MinimumRange": "142701.0", "MaximumRange": "170800.0", "RateIntervalCode": "Per Year"}], "PositionStartDate": "2020-01-27", "PositionEndDate": "2020-02-24", "PublicationStartDate": "2020-01-27", "ApplicationCloseDate": "2020-02-24", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "The U.S. Tax Court is looking for a senior software developer to help us deliver a better digital experience for the public, key stakeholders, and Court staff.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "15", "HighGrade": "15", "PromotionPotential": "None", "HiringPath": ["public"], "TotalOpenings": "1", "AgencyMarketingStatement": "THIS IS AN AT-WILL POSITION.", "TravelCode": "1"}, "IsRadialSearch": false}}, "RelevanceRank": 0.0}, {"MatchedObjectId": "558446900", "MatchedObjectDescriptor": {"PositionID": "20-21", "PositionTitle": "Software Developer/Engineer", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/558446900", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/558446900?PostingChannelID=RESTAPI"], "PositionLocationDisplay": "Washington, District of Columbia", "PositionLocation": [{"LocationName": "Washington, District of Columbia", "CountryCode": "United States", "CountrySubDivisionCode": "District of Columbia", "CityName": "Washington, District of Columbia", "Longitude": -77.032, "Latitude": 38.8904}], "OrganizationName": "Congressional Budget Office", "DepartmentName": "Legislative Branch", "JobCategory": [{"Name": "Computer Operation", "Code": "0332"}, {"Name": "Computer Science", "Code": "1550"}, {"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "AD"}], "PositionSchedule": [{"Name": "Full Time", "Code": "1"}], "PositionOfferingType": [{"Name": "Permanent", "Code": "15317"}], "QualificationSummary": "A minimum of three years of experience in programming applications, with equal emphasis on client-side and server-side browser-based technologies Experience with MSSQL and SQL Server Management Studioincluding the ability to manage logins, assign server roles, and develop maintenance plansand familiarity with other database providers, such as MySQL or PostgreSQL\tStrong experience with C# and ASP.NET Proficiency in the Visual Studio development environment Experience with software development life-cycle processes and procedures, including issue tracking, testing tools, and source control\tAbility to obtain and maintain a favorably adjudicated Public Trust (Tier 2) background investigationTECHNICAL QUALIFICATIONS:See Qualifications above", "PositionRemuneration": [{"MinimumRange": "95000.0", "MaximumRange": "125000.0", "RateIntervalCode": "Per Year"}], "PositionStartDate": "2020-01-31", "PositionEndDate": "2020-02-17", "PublicationStartDate": "2020-01-31", "ApplicationCloseDate": "2020-02-17", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "DO NOT APPLY THROUGH USAJOBS or EMAIL- APPLY ONLINE AT www.cbo.gov/careersThe Information Resources Management office (IRM), a unit of the Management, Business, and Information Services Division (MBISD), seeks a software developer/engineer who has expertise in all phases of the software development life cycle as well as broader experience in information technology (IT) operations and management.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "12", "HighGrade": "13", "PromotionPotential": "0", "HiringPath": ["public"], "TotalOpenings": "1", "AgencyMarketingStatement": "", "TravelCode": "0", "ApplyOnlineUrl": "https://www.avuecentral.com/casting/aiportal/control/toVacancy", "DetailStatusUrl": "https://www.avuecentral.com/casting/aiportal/control/toVacancy"}, "IsRadialSearch": false}}, "RelevanceRank": 0.0}, {"MatchedObjectId": "558051700", "MatchedObjectDescriptor": {"PositionID": "ST-10710737-20-KMF", "PositionTitle": "IT SPECIALIST (APPLICATION SOFTWARE)", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/558051700", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/558051700?PostingChannelID=RESTAPI"], "PositionLocationDisplay": "Naval Support Activity, Mechanicsburg, Pennsylvania", "PositionLocation": [{"LocationName": "Naval Support Activity, Mechanicsburg, Pennsylvania", "CountryCode": "United States", "CountrySubDivisionCode": "Pennsylvania", "CityName": "Naval Support Activity, Mechanicsburg, Pennsylvania", "Longitude": -76.98447, "Latitude": 40.229454}], "OrganizationName": "Naval Supply Systems Command", "DepartmentName": "Department of the Navy", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "Full-Time", "Code": "1"}], "PositionOfferingType": [{"Name": "Permanent", "Code": "15317"}], "QualificationSummary": "Your resume must demonstrate at least one year of specialized experience performing work that involves the design, documentation, development, modification, testing, installation, implementation, and support of new or existing applications software at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Examples of qualifying experiece include performing such as: 1) Utilizing Information Technology (IT) regulations, standards and policies governing a variety of topics such as policy, system performance, processing conditions to ensure compliance; 2) Utilizing COBOL, JCL and database tools to program/develop new system capabilities and modify existing system capabilities to meet customer expectation; 3) Planning and coordinating feasibility studies to determine practicality of requirements from an Information Technology standpoint and 4) Identifying potential IT problem areas and recommending alternative approaching methods\n. Your experience must reflect skill in the following areas: attention to detail, customer service, oral communication, and problem solving. Additional qualification information can be found from the following Office of Personnel Management website: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/ Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.", "PositionRemuneration": [{"MinimumRange": "77548.0", "MaximumRange": "100817.0", "RateIntervalCode": "Per Year"}], "PositionStartDate": "2020-01-29", "PositionEndDate": "2020-02-07", "PublicationStartDate": "2020-01-29", "ApplicationCloseDate": "2020-02-07", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "You will serve as a IT SPECIALIST (APPLICATION SOFTWARE) with the NAVSUP BUSINESS SYSTEMS CENTER.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "12", "HighGrade": "12", "PromotionPotential": "None", "HiringPath": ["special-authorities"], "TotalOpenings": "2", "AgencyMarketingStatement": "The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!", "TravelCode": "2", "ApplyOnlineUrl": "https://apply.usastaffing.gov/Application/Apply", "DetailStatusUrl": "https://apply.usastaffing.gov/Application/ApplicationStatus"}, "IsRadialSearch": false}}, "RelevanceRank": 0.0}, {"MatchedObjectId": "558194200", "MatchedObjectDescriptor": {"PositionID": "NCBG202649591901HC", "PositionTitle": "Information Technology Specialist (Applications Software)", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/558194200", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/558194200?PostingChannelID=RESTAPI"], "PositionLocationDisplay": "Rock Island, Illinois", "PositionLocation": [{"LocationName": "Rock Island, Illinois", "CountryCode": "United States", "CountrySubDivisionCode": "Illinois", "CityName": "Rock Island, Illinois", "Longitude": -90.57604, "Latitude": 41.5115738}], "OrganizationName": "US Army Civilian Human Resources Agency", "DepartmentName": "Department of the Army", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "Full-Time", "Code": "1"}], "PositionOfferingType": [{"Name": "Permanent", "Code": "15317"}], "QualificationSummary": "Who May Apply: US Citizens In order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Basic Requirement for Information Technology Specialist (Applications Software): Specialized and Other Experience: To qualify based on your experience, your resume must describe at least one year of experience which prepared you to do the work in this job. Specialized experience is defined as experience that is typically in or related to the work of the position to be filled such as: utilizing cloud solutions (i.e., Azure, etc.) and service platforms (i.e., ServiceNow, etc.) to automate processes to meet customer needs; implementing new information systems and developing major enhancements to existing information systems in increase efficiency; developing programs utilizing cloud solutions and service platforms to support functional areas; providing cloud solution and service platform technical advisory services to the functional user community.\nThis definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-12).", "PositionRemuneration": [{"MinimumRange": "92088.0", "MaximumRange": "119718.0", "RateIntervalCode": "Per Year"}], "PositionStartDate": "2020-01-31", "PositionEndDate": "2020-02-10", "PublicationStartDate": "2020-01-31", "ApplicationCloseDate": "2020-02-10", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "About the Position: This position is located within the CHRA North Central Region-Automation Innovation Center. This position will be filled on a permanent basis. THIS IS A DIRECT HIRE SOLICITATION - This position is being advertised through the Direct Hire Authority (DHA) for Cyber Workforce Positions. Under this authority, competitive rating/ranking and veteran's preference procedures do not apply.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "13", "HighGrade": "13", "PromotionPotential": "None", "HiringPath": ["public"], "AgencyMarketingStatement": "Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. The Civilian Human Resources Agency (CHRA) exercises world-wide command and control over the Army's entire civilian personnel operational structure consisting of all CONUS and OCONUS HR Regional Processing Centers, Civilian Personnel Advisory Centers (CPACs), and Non Appropriated Fund Human Resources Offices (NAF HROs). CHRA is responsible for operational HR effectiveness worldwide to include establishing and maintaining standards and measurements, total quality management, recruitment and placement, employee development and training, classification and position management, labor/management and employee relations, NAF HR, organizational development and workforce utilization for the Army's delivery of civilian personnel administrative services.", "TravelCode": "2", "ApplyOnlineUrl": "https://apply.usastaffing.gov/Application/Apply", "DetailStatusUrl": "https://apply.usastaffing.gov/Application/ApplicationStatus"}, "IsRadialSearch": false}}, "RelevanceRank": 0.0}, {"MatchedObjectId": "558484100", "MatchedObjectDescriptor": {"PositionID": "NCBG202629034128", "PositionTitle": "Information Technology Specialist (Application Software)", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/558484100", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/558484100?PostingChannelID=RESTAPI"], "PositionLocationDisplay": "Rock Island, Illinois", "PositionLocation": [{"LocationName": "Rock Island, Illinois", "CountryCode": "United States", "CountrySubDivisionCode": "Illinois", "CityName": "Rock Island, Illinois", "Longitude": -90.57604, "Latitude": 41.5115738}], "OrganizationName": "U.S. Army Joint Munitions Command", "DepartmentName": "Department of the Army", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "Full-Time", "Code": "1"}], "PositionOfferingType": [{"Name": "Permanent", "Code": "15317"}], "QualificationSummary": "Applicants may be selected at either the GS-12 or GS-13 grade level. The target grade of the position is GS-13. If selected at the GS-12 level non-competitive promotion to the GS-13 is authorized. Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities. Current Department of Army Civilian EmployeesDomestic Defense Industrial Base/Major Range and Test Facilities Base Civilian Personnel WorkforceInteragency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouses, under Executive Order (E.O.) 13473Non-Appropriated Fund Instrumentality (NAFI)People with Disabilities, Schedule APriority Placement Program, DoD Military Spouse Preference (MSP) EligibleVeterans Employment Opportunity Act (VEOA) of 1998 In order to qualify, you must meet the basic requirements and specialized experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. You will be evaluated on the basis of your level of competency in the following areas:\nInformation Technology Customer SupportInformation Technology Test and EvaluationOral CommunicationProblem SolvingTechnology Application Basic Requirement for Information Technology Specialist (Application Software) at the GS-12 and GS-13 level: The specialized experience must include, or be supplemented by, information technology related experience (paid or unpaid experience and/or completion of specific, intensive training, as appropriate) which demonstrates each of the four competencies, as defined: (1) Attention to Detail - Is thorough when performing work and conscientious about attending to detail. Examples of IT-related experience demonstrating this competency include: completing thorough and accurate work independently, even in the most difficult or stressful situations; occasionally reviewing work completed by others. (2) Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. Examples of IT-related experience demonstrating this competency include: resolving routine and non-routine problems, questions, or complaints; developing and maintaining strong, mutually supportive working relationships with customers; conducting evaluation of support to determine quality of services and customer satisfaction, and recommending procedural changes based on customer need or changes in policy and/or regulation. (3) Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. Examples of IT-related experience demonstrating this competency include: convincingly conveying complex information to customers; presenting thoughts that are well-organized and demonstrating confidence in the facts and ideas; adjusting style when working with individuals with different levels of understanding; using various methods to explain and convey information. (4) Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. Examples of IT-related experience demonstrating this competency include: solving complex or sensitive problems by developing and proposing strategic alternatives; identifying possible conflicts and shared benefits; helping team anticipate problems and identifying and evaluating potential sources of information; providing feedback and coaching to others to help solve problems; engaging appropriate stakeholders when developing solutions in order to understand and incorporate multiple perspectives and needs; evaluating the effectiveness of decisions and adjusting future decisions as appropriate. AND GS-12 Specialized Experience: One year of specialized experience which includes participating in design and development of automation software projects using software such as a C#, ASP.NET, .NET Framework base library and Object Oriented Program (OOP); providing input regarding customer automation needs/requirements in order to improve logistics readiness; consult with customers and other users to determine necessary requirements; assists in IT program implementation by helping develop and implement training and seminars related to the information management technology and utilization. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-11). OR GS-13 Specialized Experience: One year of specialized experience which includes performing independent analysis and implementation of new and/or emerging technologies and improved information systems (IT) related to logistics systems/programs; evaluating the nature and scope of automation initiatives and making recommendations for system development, modification, and/or redesign to meet customer needs; making independent decisions or recommendations that significantly influence agency IT policies and programs; applying applications software design methods to evaluate and select appropriate tools and methods for improving productivity and software quality throughout the life cycle; presenting briefings to senior leaders to justify and defend recommendations for new or upgraded information systems. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-12). Time in Grade Requirement for GS-12: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-11). Time in Grade Requirement for GS-13: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-12). If you are a current, Federal employee, you must include your pay plan, series and grade in your work experience(s) on your resume submission and/or upload supporting documentation (within-grade increase SF50) to show that you meet the time-in-grade requirement. In addition, if your step reflects '00', you must include your current salary for each position.", "PositionRemuneration": [{"MinimumRange": "77442.0", "MaximumRange": "119718.0", "RateIntervalCode": "Per Year"}], "PositionStartDate": "2020-02-01", "PositionEndDate": "2020-02-10", "PublicationStartDate": "2020-02-01", "ApplicationCloseDate": "2020-02-10", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "About the Position: This position provides the employee with full benefits, vacation and sick leave. Army employees located at the Rock Island Arsenal enjoy other privileges such as use of the fitness center, driving range, outdoor recreation rentals, storage units, child and youth care center, Arsenal food court, Arsenal Club/catering, employee assistance program, recycle program, RIA Museum, thrift shop, discounted tickets for some community events, and park/pavilion rentals.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "12", "HighGrade": "13", "PromotionPotential": "13", "HiringPath": ["fed-transition", "disability", "fed-internal-search", "land", "mspouse", "vet"], "TotalOpenings": "1", "AgencyMarketingStatement": "Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army.", "TravelCode": "1", "ApplyOnlineUrl": "https://apply.usastaffing.gov/Application/Apply", "DetailStatusUrl": "https://apply.usastaffing.gov/Application/ApplicationStatus"}, "IsRadialSearch": false}}, "RelevanceRank": 0.0}, {"MatchedObjectId": "558503700", "MatchedObjectDescriptor": {"PositionID": "ST-10711367-20-CMC", "PositionTitle": "INFORMATION TECHNOLOGY SPECIALIST (APPLICATION SOFTWARE)", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/558503700", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/558503700?PostingChannelID=RESTAPI"], "PositionLocationDisplay": "Bremerton, Washington", "PositionLocation": [{"LocationName": "Bremerton, Washington", "CountryCode": "United States", "CountrySubDivisionCode": "Washington", "CityName": "Bremerton, Washington", "Longitude": -122.6257, "Latitude": 47.5650024}], "OrganizationName": "U.S. Pacific Fleet, Commander in Chief", "DepartmentName": "Department of the Navy", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "Full-Time", "Code": "1"}], "PositionOfferingType": [{"Name": "Permanent", "Code": "15317"}], "QualificationSummary": "Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: developing software applications using programming languages or tools such as Microsoft Visual Studio, .NET, MVC, Entity Framework, SQL, ORACLE SQL, C#, or Java Scripting, and Team Foundation Server.. Your experience must reflect skill in the following areas: attention to detail, customer service, oral communication, and problem solving. Additional qualification information can be found from the following Office of Personnel Management website: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/2200/information-technology-it-management-series-2210-alternative-a/ Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.", "PositionRemuneration": [{"MinimumRange": "84045.0", "MaximumRange": "109264.0", "RateIntervalCode": "Per Year"}], "PositionStartDate": "2020-02-03", "PositionEndDate": "2020-02-10", "PublicationStartDate": "2020-02-03", "ApplicationCloseDate": "2020-02-10", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "You will serve as an INFORMATION TECHNOLOGY SPECIALIST (APPLICATION SOFTWARE) in the Information Technology and Cyber Security Department, Code 109, of PSNS and IMF.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "12", "HighGrade": "12", "PromotionPotential": "None", "HiringPath": ["fed-transition", "fed-competitive", "land", "mspouse", "special-authorities", "vet"], "AgencyMarketingStatement": "The Navy and Marine Corps team offers innovative, exciting and meaningful work linking military and civilian talents to achieve our mission and safeguard our freedoms. Department of the Navy provides competitive salaries, comprehensive benefits, and extensive professional development and training. From pipefitters to accountants, scientists to engineers, doctors to nurses-the careers and opportunities to make a difference are endless. Civilian careers-where purpose and patriotism unite!", "TravelCode": "1", "ApplyOnlineUrl": "https://apply.usastaffing.gov/Application/Apply", "DetailStatusUrl": "https://apply.usastaffing.gov/Application/ApplicationStatus"}, "IsRadialSearch": false}}, "RelevanceRank": 0.0}, {"MatchedObjectId": "558789500", "MatchedObjectDescriptor": {"PositionID": "NCNT202721886953HC", "PositionTitle": "Information Technology Specialist (Applications Software)", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/558789500", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/558789500?PostingChannelID=RESTAPI"], "PositionLocationDisplay": "Adams County, Pennsylvania", "PositionLocation": [{"LocationName": "Adams County, Pennsylvania", "CountryCode": "United States", "CountrySubDivisionCode": "Pennsylvania", "CityName": "Adams County, Pennsylvania", "Longitude": -77.21792, "Latitude": 39.87151}], "OrganizationName": "U.S. Army Cyber Command", "DepartmentName": "Department of the Army", "SubAgency": "U.S. Army Network Enterprise Technology Command (NETCOM)", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "Full-Time", "Code": "1"}], "PositionOfferingType": [{"Name": "Permanent", "Code": "15317"}], "QualificationSummary": "Who May Apply: US Citizens In order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Basic Requirement for Information Technology Specialist (Applications Software): Specialized and Other Experience: One year of specialized experience which includes providing software engineering support for information technology (IT) applications; making recommendations for Web-Based application development; maintaining server operating systems that make applications run; and providing recommendations and providing training to customers. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service GS-11. The specialized experience must include, or be supplemented by, information technology related experience (paid or unpaid experience and/or completion of specific, intensive training, as appropriate) which demonstrates each of the four competencies, as defined: (1) Attention to Detail - Is thorough when performing work and conscientious about attending to detail. Examples of IT-related experience demonstrating this competency include: completing thorough and accurate work independently, even in the most difficult or stressful situations; occasionally reviewing work completed by others. (2) Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. Examples of IT-related experience demonstrating this competency include: resolving routine and non-routine problems, questions, or complaints; developing and maintaining strong, mutually supportive working relationships with customers; conducting evaluation of support to determine quality of services and customer satisfaction, and recommending procedural changes based on customer need or changes in policy and/or regulation. (3) Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. Examples of IT-related experience demonstrating this competency include: convincingly conveying complex information to customers; presenting thoughts that are well-organized and demonstrating confidence in the facts and ideas; adjusting style when working with individuals with different levels of understanding; using various methods to explain and convey information. (4) Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. Examples of IT-related experience demonstrating this competency include: solving complex or sensitive problems by developing and proposing strategic alternatives; identifying possible conflicts and shared benefits; helping team anticipate problems and identifying and evaluating potential sources of information; providing feedback and coaching to others to help solve problems; engaging appropriate stakeholders when developing solutions in order to understand and incorporate multiple perspectives and needs; evaluating the effectiveness of decisions and adjusting future decisions as appropriate. Some federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone--no substitution of education for experience is permitted.", "PositionRemuneration": [{"MinimumRange": "86335.0", "MaximumRange": "112240.0", "RateIntervalCode": "Per Year"}], "PositionStartDate": "2020-02-05", "PositionEndDate": "2020-02-05", "PublicationStartDate": "2020-02-05", "ApplicationCloseDate": "2020-02-05", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "About the Position: This is a Direct Hire Solicitation for Cyber Workforce Positions.Your resume will not be reviewed for qualifications until a selection is made.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "12", "HighGrade": "12", "PromotionPotential": "None", "HiringPath": ["public"], "TotalOpenings": "1", "AgencyMarketingStatement": "Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. Are you interested in helping to defend our Nation? Exciting career opportunities are available with the U.S. Army Network Enterprise Technology Command (NETCOM)!", "TravelCode": "1", "ApplyOnlineUrl": "https://apply.usastaffing.gov/Application/Apply", "DetailStatusUrl": "https://apply.usastaffing.gov/Application/ApplicationStatus"}, "IsRadialSearch": false}}, "RelevanceRank": 0.0}, {"MatchedObjectId": "557788000", "MatchedObjectDescriptor": {"PositionID": "EUJN202484028291", "PositionTitle": "Supervisory IT Specialist (Policy Planning/Application Software)", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/557788000", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/557788000?PostingChannelID=RESTAPI"], "PositionLocationDisplay": "Vicenza, Italy", "PositionLocation": [{"LocationName": "Vicenza, Italy", "CountryCode": "Italy", "CityName": "Vicenza, Italy", "Longitude": 11.5494347, "Latitude": 45.5479851}], "OrganizationName": "U.S. Army Africa/Southern European Task Force (USARAF/SETAF)", "DepartmentName": "Department of the Army", "SubAgency": "Knowledge Management Office", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "Full-Time", "Code": "1"}], "PositionOfferingType": [{"Name": "Permanent", "Code": "15317"}], "QualificationSummary": "Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities. 30 Percent or More Disabled VeteransCurrent Department of Army Civilian Employees Applying to OCONUS PositionsCurrent Permanent Department of Defense (DOD) Civilian Employee (non-Army)Domestic Defense Industrial Base/Major Range and Test Facilities Base Civilian Personnel WorkforceFamily Member Preference (FMP) for Overseas EmploymentInteragency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouse Preference (MSP) for Overseas EmploymentNon-Department of Defense (DoD) TransferPeople with Disabilities, Schedule AReinstatementVeterans Employment Opportunity Act (VEOA) of 1998\nIn order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Experienced Required: To qualify based on your work experience, your resume must describe at least one year of specialized experience which prepared you to do the work in this job. Specialized experience is defined as: serving as the Knowledge Management Director of a Command engaged in planning, developing, and implementing Knowledge Management policies and procedures the command, its subordinate units, and supporting organizations; applying expert level knowledge, skills, and abilities in strategic leadership, communication, relationship management, Share Point technology, Software Development Lifecycle (SDLC), and IT project management to include client-side programming and Web technology including JavaScript, Bootstrap, Angular JS, and HTMLS; AND\nFor all positions individuals must have IT-related experience demonstrating each of the four competencies listed below:\n1.Attention to detail - Ensuring statement of work for procurement of products and service, technical documents, or troubleshooting of Information Technology problems are complete, free of error, and uses sound technical judgment.\n2.Customer Service - Analyzing, defining, and delivering Information Technology support to organizations, and identifying problems with customer requests in order to achieve the desired product or service.\n3.Oral communication - Presenting technical information to non-technicians in order to achieve understanding of desired specification or solutions to problems.\n4.Problem Solving - Diagnosis of issues for organizational or installation wide integrated Information Technology systems for compatibility of new technology, capacity issues, or ensure IT systems continue to meet changing mission requirements. You will be evaluated on the basis of your level of competency in the following areas:\nBusiness Process ReengineeringProject ManagementSoftware DevelopmentTechnology Awareness\nTime in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-13).", "PositionRemuneration": [{"MinimumRange": "92977.0", "MaximumRange": "120868.0", "RateIntervalCode": "Per Year"}], "PositionStartDate": "2020-01-29", "PositionEndDate": "2020-02-11", "PublicationStartDate": "2020-01-29", "ApplicationCloseDate": "2020-02-11", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "About the Position: VICENZA, ITALY\nThis position is located in Vicenza, Italy. Vicenza is situated midway between Venice and Verona, 45 minutes driving in either direction. It is less than 3 hours drive from Florence, Milan, and to the borders of Austria and Germany. The climate is temperate with availability of a wide variety of outdoor activities in the nearby mountains (Dolomites) and beaches (Adriatic Sea). For additional information please visit http://www.usaraf.army.mil/.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "14", "HighGrade": "14", "PromotionPotential": "None", "HiringPath": ["fed-transition", "overseas", "fed-competitive", "land", "mspouse", "vet"], "AgencyMarketingStatement": "Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army.", "TravelCode": "5", "ApplyOnlineUrl": "https://apply.usastaffing.gov/Application/Apply", "DetailStatusUrl": "https://apply.usastaffing.gov/Application/ApplicationStatus"}, "IsRadialSearch": false}}, "RelevanceRank": 0.0}, {"MatchedObjectId": "558416300", "MatchedObjectDescriptor": {"PositionID": "CARX-20-10710886-TMo-DH", "PositionTitle": "Lead Information Technology Specialist (Applications Software)", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/558416300", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/558416300?PostingChannelID=RESTAPI"], "PositionLocationDisplay": "Philadelphia, Pennsylvania", "PositionLocation": [{"LocationName": "Philadelphia, Pennsylvania", "CountryCode": "United States", "CountrySubDivisionCode": "Pennsylvania", "CityName": "Philadelphia, Pennsylvania", "Longitude": -75.16237, "Latitude": 39.95227}], "OrganizationName": "Deputy Assistant Secretary for Information and Technology", "DepartmentName": "Department of Veterans Affairs", "SubAgency": "OIT/IT DevOps/Enterprise Program Management Office (EPMO)/Insurance Products Division", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "Full-Time", "Code": "1"}], "PositionOfferingType": [{"Name": "Permanent", "Code": "15317"}], "QualificationSummary": "To qualify for this position, applicants must meet all requirements by the closing date of this announcement. Selective Placement Factor: This position includes a skill, knowledge, ability or other worker characteristic basic to -and essential for satisfactory performance of the job. Selective Placement Factors are a prerequisite to appointment and represent minimum requirements for a position. Applicants who do not meet it are ineligible for further consideration. Evidence of the Selective Placement Factor must be reflected in your resume. The Selective Placement Factor for this position is: Demonstrated expertise and experience in life insurance software development, developing and maintaining software and related project management for applications supporting life insurance systems, and planning, designing and/or implementing software development IT projects for life insurance. AND You may qualify based on your experience, as described below: Experience - Experience must be IT related; the experience may be demonstrated by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification), as appropriate. For all positions individuals must have IT-related experience demonstrating each of the four competencies listed below. The employing agency is responsible for identifying the specific level of proficiency required for each competency at each grade level based on the requirements of the position being filled. Attention to Detail - Is thorough when performing work and conscientious about attending to detail. Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. AND Specialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade in the normal line of progression for the occupation in the organization; experience that equipped the applicant with the particular knowledge, skills and abilities (KSA's) and other characteristics to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled, in the normal line of progression for the occupation in the organization. GS-13 Specialized Experience: One year of specialized experience (equivalent to the GS-12 grade level in the federal service). Specialized experience includes mastery level expertise and experience in software development functions including software engineering, design, debugging and quality assurance; implementing computer programming and secure coding techniques; utilizing database management systems, computer-aided software engineering tools, imaging, client/server or other new technology in the design and management of large IT initiatives; and employing team building, motivation, coaching and group facilitation methods in order to lead a team. Such experience is typically gained in the IT field or through the performance of work where the primary concern is IT. There is no educational substitution for the GS-13 level. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. Note: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment. For more information on these qualification standards, please visit OPM's web site at http://www.opm.gov/qualifications/standards/indexes/alph-ndx.asp.", "PositionRemuneration": [{"MinimumRange": "99170.0", "MaximumRange": "128924.0", "RateIntervalCode": "Per Year"}], "PositionStartDate": "2020-02-03", "PositionEndDate": "2020-02-07", "PublicationStartDate": "2020-02-03", "ApplicationCloseDate": "2020-02-07", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "This position is located in the Department of Veterans Affairs (VA), Office of Information & Technology (OIT), IT DevOps, Enterprise Program Management Office (EPMO), Transition, Release and Support, Corporate Project Support, Insurance Team. The incumbent will lead a team that includes all IT specialists in a section, allowing the Development Manager to spend more time on management and administrative issues, while the incumbent concentrates on work product integration and technical matters.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "13", "HighGrade": "13", "PromotionPotential": "13", "HiringPath": ["public"], "TotalOpenings": "2", "AgencyMarketingStatement": "OUR MISSION: To fulfill President Lincoln's promise - \"To care for him who shall have borne the battle, and for his widow, and his orphan\" - by serving and honoring the men and women who are America's Veterans. How would you like to become a part of a team providing compassionate care to Veterans? The VA has adopted Core Values and Characteristics that apply universally across the Department. The five Core Values define \"who we are,\" our culture, and how we care for Veterans, their families and other beneficiaries.\nThe Values are Integrity, Commitment, Advocacy, Respect and Excellence (\"I CARE\").\nAs a VA professional, your opportunities are endless. With many openings in the multiple functions of VA, you will have a wide range of opportunities and leadership positions at your fingertips. DIRECT HIRE AUTHORITY: This position is being filled using Direct-Hire Authority (5 CFR 337.205) for this occupation.", "TravelCode": "1", "ApplyOnlineUrl": "https://apply.usastaffing.gov/Application/Apply", "DetailStatusUrl": "https://apply.usastaffing.gov/Application/ApplicationStatus"}, "IsRadialSearch": false}}, "RelevanceRank": 0.0}]