[
  {
    "id": "c2f24601-cc07-47e7-8a5b-a0e69e78b8df",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c2f24601-cc07-47e7-8a5b-a0e69e78b8df",
    "created_at": "Mon Mar 02 18:13:05 UTC 2020",
    "company": "Founders Table (Chopt & Dos Toros)",
    "company_url": "http://choptsalad.com",
    "location": "New York City (or Remote)",
    "title": "Senior React Engineer",
    "description": "<p><strong>Overview</strong></p>\n<p>Founders Table Restaurant Group launched in January 2020 to create, acquire, and cultivate innovative and profitable founder-led restaurant companies.  Founders Table, which currently includes Chopt Creative Salad Co. and Dos Toros Taqueria, leans on digital and operational innovation to drive the growth of industry-leading culinary concepts.</p>\n<p>The Senior Front-end React Developer will be part of a small team at Founders Table focused on building and maintaining custom systems that help us improve our customers’ digital ordering experiences. This engineer will play a critical role in the development of new systems, as an active contributor during the conceptualization phase and as the lead engineer during development and beyond.</p>\n<p>This role requires a willingness to think outside of the box and a passion for creating seamless user experiences.  The ideal candidate should possess strong work ethic and exhibit excellent communication and organization skills.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Build and maintain new custom applications that enable our customers to have great digital ordering experiences</li>\n<li>Maintain, enhance, and implement new features and functionality to existing customer facing ordering applications</li>\n<li>Work collaboratively to improve and standardize development processes across a small but growing dev team</li>\n</ul>\n<p><strong>Required Qualifications</strong></p>\n<ul>\n<li>B.S. degree in Computer Science, Software Engineering or a related field, or equivalent experience</li>\n<li>8+ years of experience in front-end development</li>\n<li>4+ years of experience working with React and Redux (incl. redux-saga)</li>\n<li>Experience working with AWS for large-scale production applications</li>\n<li>Understanding of layout aesthetics and strong CSS skills</li>\n<li>Experience working with APIs and authentication protocols</li>\n<li>Exemplary communication skills; ability to explain possible solutions to non-technical team members</li>\n<li>Ability to work well independently as well as part of a team</li>\n<li>Self-motivation with a strong drive for achievement</li>\n<li>Passion for learning new technologies fast</li>\n<li>Love for salads and burritos preferred, but not mandatory</li>\n</ul>\n<p><strong>Nice-to-have Qualifications</strong></p>\n<ul>\n<li>Experience with analytics tools like Google Analytics or Mixpanel</li>\n<li>Solid understanding of SEO principles</li>\n<li>Experience with Javascript Unit Testing</li>\n<li>Experience with backend development and server-side languages such as Node or PHP</li>\n<li>Experience with various database systems, both in production and warehousing capacities, such as MySQL, PostgreSQL, and MongoDB</li>\n</ul>\n",
    "how_to_apply": "<p>Apply via LinkedIn (<a href=\"https://www.linkedin.com/jobs/cap/view/1753984682/\">https://www.linkedin.com/jobs/cap/view/1753984682/</a>) or email resume/portfolio to <a href=\"mailto:techjobs@founders-table.com\">techjobs@founders-table.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlYvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ac07ba29b1b6d6b91b8e7d05fc0e737e10a35486/chopt_logolockup_green_jpg.jpg"
  },
  {
    "id": "0678ad80-e64c-4d32-84e9-af8e1b448831",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0678ad80-e64c-4d32-84e9-af8e1b448831",
    "created_at": "Wed Feb 26 19:48:47 UTC 2020",
    "company": "INFICON",
    "company_url": "http://www.inficon.com/",
    "location": "Austin, Texas, United States, 78744",
    "title": "Software Developer",
    "description": "<p>COMPANY OVERVIEW:\nINFICON is a growing, global, leading provider of innovative technologies that enhances productivity and quality in sophisticated industrial processes. The products provided by INFICON are world-class instruments for gas analysis, measurement, and control and are vital to manufacturers and end-users in the complex fabrication of semiconductors and thin film coatings for optics, flat panel displays, solar cells, and industrial vacuum coating applications. INFICON is headquartered in Switzerland and has world-class manufacturing facilities in Europe, the United States and China with subsidiaries located throughout the world. This position will be located in Austin, TX. For more detailed information about INFICON, please visit our website at <a href=\"http://www.inficon.com\">www.inficon.com</a>.\nIntelligent Manufacturing Systems (IMS) is a division of INFICON that makes industry-leading scheduling and visualization software to optimize semiconductor manufacturing.\nINFICON is not offering any sponsorship\nAs a Software Developer, you are responsible for developing high quality software. You are responsible for ensuring timely execution of new development, ensuring applications meet Client Requirements, and ease of deployment for Clients and Project Management Team. You are expected to work on one or more applications, and you may need to support other applications in need. This exciting opportunity reports to the Director of Product Development.\nRole:</p>\n<ul>\n<li>Member of Development team responsible for INFICON/IMS product suite.</li>\n<li>Design, develop, implement, and maintain world-class database-driven web applications.</li>\n<li>Work closely with other members of the consulting and programming teams.</li>\n<li>Determine appropriate technical solutions and make relevant recommendations to team and clients.</li>\n<li>Engage in outside-the-box thinking to provide high value to clients.</li>\n<li>Be actively involved in projects and motivated with innovative ideas.\nRequired Skills and Education:</li>\n<li>5+ years work experience with HTML, CSS, JavaScript, and Angular</li>\n<li>Comfortable with web authoring tools such as Visual Studio</li>\n<li>Strong web development and UI design skills</li>\n<li>Good working knowledge of database design and SQL</li>\n<li>Oracle database knowledge and experience is a plus</li>\n<li>Effective communication, comfortable discussing solutions with team and customers</li>\n<li>Interest in manufacturing industry</li>\n<li>Ability to juggle multiple priorities and projects at the same time</li>\n<li>Must write neat and organized code and maintain documentation</li>\n<li>BS in computer science or similar\nCompensation will be commensurate with experience including a competitive salary, discretionary bonus opportunity, competitive benefits package, and relocation assistance.\nINFICON, is committed to ensuring that our online application process provides an equal opportunity to all job seekers that apply without regard to race, religion, ethnicity, national origin, citizenship, gender, age, protected veteran status, disability status, genetic information, sexual orientation, or any other protected characteristic. A notice describing Federal equal employment opportunity laws is available here(<a href=\"http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\">http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf</a>) and here(<a href=\"http://www.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\">http://www.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf</a>) to reaffirm this commitment.\nINFICON is also committed to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for an employment opportunity at INFICON and require special assistance or an accommodation during the application process, please contact Human Resources at 315-434-1100. Determination on requests for reasonable accommodations are made on a case-by-case basis.\nPAY TRANSPARENCY NONDISCRIMINATION PROVISION(<a href=\"https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf\">https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf</a>)\nEmployee Polygraph Protection Act Poster(<a href=\"https://www.dol.gov/whd/regs/compliance/posters/eppac.pdf\">https://www.dol.gov/whd/regs/compliance/posters/eppac.pdf</a>)</li>\n</ul>\n<p>Apply Here: <a href=\"http://www.Click2Apply.net/tbq7rwrvwc3p5r8b\">http://www.Click2Apply.net/tbq7rwrvwc3p5r8b</a></p>\n<p>PI118421940</p>\n",
    "how_to_apply": "<p>Apply Here:<a href=\"http://www.Click2Apply.net/tbq7rwrvwc3p5r8b\">http://www.Click2Apply.net/tbq7rwrvwc3p5r8b</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDUvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--efc5e2b6b9fcffec320ad143a1b69a6abdd2b1d0/Inficon_logo.png"
  },
  {
    "id": "eb35eadb-88c2-4379-bdab-83dd1bd6e46a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/eb35eadb-88c2-4379-bdab-83dd1bd6e46a",
    "created_at": "Thu Feb 27 13:15:25 UTC 2020",
    "company": "encoway GmbH",
    "company_url": "http:",
    "location": "Bremen",
    "title": "TypeScript/JavaScript Software Developer (w/m/d)",
    "description": "<p><strong>TypeScript/JavaScript Software Developer (w/m/d)</strong></p>\n<p><strong>Dein Beitrag</strong></p>\n<ul>\n<li>Du konzipierst und entwickelst Desktop-Anwendungen auf Basis des Electron Frameworks mit TypeScript/JavaScript, Node.js und anderen modernen Web-Technologien.</li>\n<li>Du lebst Clean Code und arbeitest in einem professionellen, modernen Entwicklungsumfeld mit agilen Prozessen, Code Reviews, Pair-Programming, Test Driven Development, Continuous Integration &amp; Delivery, Testautomatisierung u.v.m.</li>\n<li>Bei uns ist jeder für die Qualität mitverantwortlich: In Zusammenarbeit mit den Testmanagern hilfst du auch bei der Qualitätssicherung der Software, die du schreibst.</li>\n<li>Du machst dir unsere agilen Prozesse (Scrum, Kanban) zu eigen und spielst gerne eine aktive Rolle bei deren Durchführung und Verbesserung.</li>\n</ul>\n<p><strong>Dein Profil</strong></p>\n<ul>\n<li>Du kennst dich mit TypeScript oder einer andere Sprache wie JavaScript oder C++ aus und bist offen für neue Technologien, Frameworks und Sprachen.</li>\n<li>Mit dem Node.js-Ökosystem und modernen Build-Prozessen bist du bestens vertraut.</li>\n<li>Du kennst dich mit modernen Software-Architekturen und Web-Technologien bestens aus.</li>\n<li>Du hast Freude an der Kommunikation im Team und daran dich mit Zielen und Anforderungen aktiv auseinanderzusetzen.</li>\n<li>Im Alltag sprechen wir Deutsch. Idealerweise scheust du dich aber nicht davor, auch Englisch zu sprechen und zu schreiben.</li>\n</ul>\n<p><strong>Mit encoway volle Kraft voraus!</strong>\nDie Digitalisierung ist nach wie vor ein Megatrend. Mit unseren Softwarelösungen unterstützen wir Industrie-Unternehmen bei der digitalen Transformation. Neben unseren Kernkompetenzen Produktkonfiguration und Variantenmanagement, befinden sich dafür weitere Geschäftsfelder im Aufbau.</p>\n<p>Im Jahr 2000 aus einer 5-köpfigen Bremer Forschungsgruppe heraus gegründet, besteht unsere Mannschaft mittlerweile aus über 200 Mitarbeitern und wir sind weiter auf Wachstumskurs.</p>\n<p>Komm auch du jetzt zu uns an Bord - und lass dich nicht davon abhalten, wenn du meinst, dein Profil passt nicht ganz!</p>\n<p><strong>Bordcheck</strong>\nZu unserer Kultur und unseren Benefits haben wir dir nachfolgend ein paar Eigenschaften aufgelistet, mit denen du einen ersten Check machen kannst, ob wir zusammenpassen:</p>\n<ul>\n<li>Startklar: Du wirst bei uns nicht ins kalte Wasser geworfen.</li>\n<li>Aufgeschlossen: Wir bieten dir die Möglichkeit mitzugestalten.</li>\n<li>Flexibel: Bei uns findest du flexible Arbeitszeiten.</li>\n<li>State-of-the-art: Ein professionelles und modernes Arbeitsumfeld erwartet dich.</li>\n<li>Agil: Wir arbeiten in flexiblen Strukturen und Prozessen.</li>\n<li>Wertschätzend: Regelmäßig finden gemeinsame Retrospektiven und Feedbackgespräche statt.</li>\n<li>Fördernd: Weiterentwicklung deiner Fach- und Führungskarriere.</li>\n<li>Familienfreundlich: Wir unterstützen dich und deine Familie (z. B. Zuschuss zu den Kita-Gebühren).</li>\n<li>Gemeinschaftlich: Bei uns finden regelmäßig Mitarbeiter-Events statt.</li>\n<li>Sportlich: Unsere Mitarbeiter treffen sich regelmäßig in Sport-/und Freizeitgruppen zusammen.</li>\n<li>Gesund: Wir bieten verschiedene Präventionsangebote.</li>\n<li>Und sonst noch so...: Obst, Kaffee - die üblichen „Goodies“ gibt´s auch.</li>\n</ul>\n<p><strong>Bei Fragen zu dieser Stelle wende dich gerne an:</strong></p>\n<p>Laura Middendorf\nTalentmanagement\nencoway GmbH\nBuschhöhe 2\n28357 Bremen\nTelefon +49 (0) 421 33003-678</p>\n<p><strong>Interessiert?</strong>\nWir freuen uns auf deine Bewerbung. Bitte benutze dafür unser <strong><a href=\"https://ltpx.nl/DKR0KII\">Online Bewerbungstool</a></strong> und schick uns deineBewerbungsunterlagen.\n<img src=\"https://camo.githubusercontent.com/aa413da8bc8e09331bddd99b3fb8c5282dc2d3df/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313535303731\"></p>\n",
    "how_to_apply": "<p>Wir freuen uns auf deine Bewerbung. Bitte benutze dafür unser <strong><a href=\"https://ltpx.nl/DKR0KII\">Online Bewerbungstool</a></strong> und schick uns deineBewerbungsunterlagen.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmQvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--813746e140eddf7cd0333c9aca513989d65f310a/encoway.jpeg"
  },
  {
    "id": "441186c1-229b-4ef1-aaf5-d8df1b251511",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/441186c1-229b-4ef1-aaf5-d8df1b251511",
    "created_at": "Thu Feb 27 11:00:32 UTC 2020",
    "company": "Matrix42",
    "company_url": "https://www.matrix42.com/de/",
    "location": "Minsk",
    "title": ".NET Developer",
    "description": "<p><strong>The \"EgoSecure\" company is looking for middle/senior C# Developers (.NET + JS) to work in an international team.</strong></p>\n<h2>Requirements:</h2>\n<ul>\n<li>3+ years of experience as a developer</li>\n<li>Deep knowledge of .NET, C#, JavaScript</li>\n<li>Analytical and problem-solving skills</li>\n<li>The candidate needs to be a team player with a positive attitude</li>\n<li>Level of English Intermediate+</li>\n</ul>\n<h2>Will be a plus</h2>\n<ul>\n<li>ASP.NET</li>\n<li>Web API</li>\n<li>AngularJS</li>\n<li>HTML5, CSS3</li>\n<li>SQL</li>\n<li>WPF/WCF/WWF</li>\n<li>Experience in building responsive applications</li>\n<li>Higher technical education</li>\n<li>Experience with Agile frameworks</li>\n</ul>\n<h2>Conditions:</h2>\n<ul>\n<li>Participate in the development of an enterprise software product, Matrix42 Workspace Management, utilizing cutting-edge technologies and methodology, like SPA, AngularJS</li>\n<li>Possibility to influence technical decisions, requirements, development process.</li>\n<li>Highly Competitive compensation (depends on the candidate level)</li>\n<li>Work in a strong team to deliver business-oriented solutions that meet requirements and expectations.</li>\n<li>Attractive benefits package\n<ul>\n<li>paid sick leave</li>\n<li>vacations (25 calendar days)</li>\n<li>Free English courses</li>\n<li>Medical Insurance</li>\n</ul>\n</li>\n<li>Office in the center of Minsk.</li>\n<li>Professional training which meets company needs</li>\n<li>Free coffee, tea, snacks</li>\n<li>Regular company events locally and abroad</li>\n<li>Casual, positive and open work environment</li>\n</ul>\n<h2>About project</h2>\n<p> </p>\n<h2>Management</h2>\n<p>Matrix42 Workspace Management is a Business Process Platform that helps IT Department of any company to become a full blown Service Provider.\nThe latest and greatest IT and Non-IT Business Processes are supported and certified, like Incident-, Problem-, Change-, Configuration-, Service Level Management, SAM or any other Service Management Process you wish for.\nWe provide the means for our customers to shape the Solution according to their business needs without worrying about update issues and with any need of development skills — it just works!\nWith drag&amp;drop Workflows, an intuitive Layout Designer and a tool to ensure that the data is flowing seamlessly from any data source. No matter if your data is on-premise, in the cloud, a Microsoft SQL Server Database or a fancy REST API, you can connect and interact with it with a technology called SolutionBuilder.</p>\n<h2>PLATFORM — The Solution Builder</h2>\n<p>Matrix42 SolutionBuilder is the core of all our business processes. It’s a modern drag&amp;drop application builder based on Microsoft ASP.NET WebAPI with a Microsoft SQL Server on the backend and AngularJS with Angular Material on the frontend. Our invention let you create any UX you seek for as well as any datapersistance you want, just by configuration through with a nice UserExperience. We develop SolutionBuilder so our customers don’t have to acquire any development skills, but let their creativity flow and create awesome apps to ensure that their business is reacting as fast to business changes, as we react on technilogy changes — always be on the latest and greatest.\nThe Matrix42 Workflow Studio, based on Microsoft’s latest Workflow Foundation with a Visual Studio rehosted designer, enables our customers to model their Business Logic with straight forward Workflows and our many Workflow Activities.</p>\n<h2>PROCESS — Lean &amp; Agile</h2>\n<p>We living and breathing SCRUM, Lean and Agile. Self motivation and autonomous working in our one week sprints is key to success for us.\n“Innovate like a startup, deliver like an enterprise” is our CTO’s key quote.\nOur modern office provides you startup flavor with the security of a strong software vendor that has a strong manifest for over 20 years in the industry.\nWork hard — Play hard!\nWe’re working on Visual Studio Team Services on git repositories. Our weekly iterations and our continuous integration approach ensures cloud-like deployment to our customers, even though it is an enterprise solution that is by 90% installed on-premise.</p>\n<p>Apply now for Matrix42 via the application form and help us to create the game changing enterprise software solutions that will roll up the market!</p>\n<p><a href=\"https://matrix42minsk.redirect.your-jobresponse.com/net_developer_minsk/264569/V819/apply\">Click here for the application form!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://matrix42minsk.redirect.your-jobresponse.com/net_developer_minsk/264569/V819/apply\">Click here for the application form!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBclYvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--06f8ac5b5729e0c1c82e509113680adf3eb5c728/matrix%2042%C2%A0ag.jpg"
  },
  {
    "id": "cc1d63be-a892-4066-852a-03aa7629c566",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/cc1d63be-a892-4066-852a-03aa7629c566",
    "created_at": "Wed Feb 26 11:20:11 UTC 2020",
    "company": "Finalist",
    "company_url": "http://www.finalist.com",
    "location": "Rotterdam",
    "title": "Integratie Specialist (Red Hat)",
    "description": "<p><strong>Ben jij een ervaren integratie specialist die voor onze opdrachtgevers in zorg, onderwijs en zekerheid die dagelijks het verschil weet te maken dan is dit de perfecte baan voor jou. Realiseer jij applicatie integraties op basis van Enterprise Integration Patterns middels (bij voorkeur) de Red Hat stack? Krijg jij ook voldoening uit het bijdragen aan maatschappelijke relevante projecten? Ben je op zoek naar interessante projecten en leren van collega's bij een organisatie die niet té groot en niet té klein is?</strong></p>\n<p>Finalist heeft voor haar locatie in Rotterdam een vacature voor een</p>\n<p><strong>Integratie Specialist (Red Hat)</strong></p>\n<p><strong>Wat ga je doen als Integratie Specialist?</strong>\nOns klantenbestand zit voornamelijk in de Zorg, Welzijn, Onderwijs en Finance. Ons werkveld gaat van diepe database ontsluiting tot het ontwerp en implementatie van de UX en alles wat daartussen zit. Java development is hierbij de rode lijn. Bij Finalist ben je het aanspreekpunt als technisch ontwikkelaar voor de implementatie van nieuwe projecten en/of onderhoud van systemen bij bestaande klanten. Wij verwachten initiatief, een hoge servicegerichtheid en kwaliteitscode!</p>\n<p>Onze development teams zijn vaak samengesteld uit een team van Finalist en Architecten / Ontwikkelaars / Product Owners van de klant die samen tot resultaat weten te komen. Je Finalist collega's zijn experts in maatwerk software ontwikkeling en -integratie van IT systemen. Ze houden van espresso, tafelvoetbal  (op kantoor tussen de bedrijven door) een biertje op de vrijmibo en allerlei soorten muziek op hun draadloze koptelefoon tijdens werkuren.</p>\n<p><strong>Onze ideale collega</strong></p>\n<ul>\n<li>Is een probleemoplosser - analytisch sterk, maar vindt ook de creatieve oplossing;</li>\n<li>Heeft een passie voor software ontwikkelen, en wil die passie ook delen met anderen;</li>\n<li>Zoekt groei in het beheersen van alle facetten van het software-ontwikkelproces;</li>\n<li>Is pragmatisch ingesteld; software ontwikkelen is denkwerk, maar er moet ook werkende software opgeleverd worden;</li>\n<li>Wil het liefst snel en met regelmaat resultaat leveren, maar alleen als ook de kwaliteit echt goed is;</li>\n<li>Beseft dat software ontwikkelen teamwerk is, en kan effectief communiceren;</li>\n<li>Wacht niet op instructies, maar is proactief op zoek naar nieuwe uitdagingen;</li>\n<li>Laat diens werk leiden door waarden en principes, maar is hierin niet dogmatisch, staat dus open voor andere opinies.</li>\n</ul>\n<p><strong>Waar kom je te werken?</strong>\nFinalist werkt vanuit Rotterdam en Maarssen (Utrecht). De kantoren zijn makkelijk bereikbaar en staan vlakbij NS-stations. Bereidheid om naar beide kantoren en naar klanten te reizen is essentieel. Je komt te werken in ons Java-team, in een open cultuur met veel vrijheid en verantwoordelijkheid.</p>\n<p><strong>Welke technologieën we gebruiken?</strong></p>\n<ul>\n<li>Ervaring met de Red Hat stack is een pré, we gebruiken: Red Hat API Management, Red Hat Fuse, Red Hat AMQ, Red Hat Single Sign On en Red Hat Openshift.</li>\n<li>We bouwen applicaties met React in de frontend;</li>\n<li>En Java en Spring Framework,  in de backend;</li>\n<li>Waarbij ook git, Maven, Cucumber, Jenkins en SonarQube gewoon niet meer zijn weg te denken;</li>\n<li>We runnen de apps met Spring Boot;</li>\n<li>En koppelen ze via Hibernate aan PostgreSQL, onze favoriete relationele database;</li>\n<li>Maar soms ook direct aan NoSQL, zoals Datomic en Couchbase;</li>\n<li>Keycloak is onze voorkeursoplossing voor Identity &amp; Access Management;</li>\n<li>En ook Apache Camel, om onze app met andere apps te verbinden;</li>\n<li>We verpakken het een en ander in Docker containers;</li>\n<li>En rollen het geheel uit in een OpenShift / Kubernetes cluster.</li>\n<li>Tot slot nog andere technologiën waar je mee praat: REST, SOAP, JDBC, JMS, XML, JSON, XPATH, XSLT, Jsonpath</li>\n</ul>\n<p><strong>Wat biedt Finalist</strong></p>\n<ul>\n<li>Serieus uitdagend werk;</li>\n<li>Een vaste stack met af en toe avontuurljike elementen;</li>\n<li>Fijne collega's met een diversiteit aan achtergronden;</li>\n<li>Leuke projecten gericht op betekenisvol, maatschappelijk relevant resultaat;</li>\n<li>Een prettige werkomgeving;</li>\n<li>De gelegenheid om vakgerichte conferenties bij te wonen;</li>\n<li>Een omgeving die creativiteit en groei bevordert;</li>\n<li>Baanbrekende technologie en de juiste technologische hulpmiddelen voor iedere klus;</li>\n<li>Wij investeren in de groei (leren) van medewerkers met minimaal 5 onderwijsdagen per jaar;</li>\n<li>Transparante financiën en strategie;</li>\n<li>Een marktconform basissalaris met winstdeling;</li>\n<li>Keuze in uw hoeveelheid vakantiedagen. (30, 25 of 20);</li>\n<li>Volledige pensioenplan 100% betaald door Finalist als werkgever;</li>\n<li>Laptop (Windows of Macbook) en mobiele telefoon;</li>\n<li>Plezierige en makkelijk bereikbare kantoren naast NS-stations in Rotterdam en Maarssen;</li>\n</ul>\n<p><strong>Wie wij zijn?</strong>\nFinalisters gebruiken hun software skills om applicaties, integraties en portalen te creëren voor met name zorg en onderwijs. Toepassingen die relevant zijn voor onze maatschappij en een belangrijke bijdrage leveren op belangrijke levensmomenten van mensen. Wij maken het verschil waarvoor we eerlijke waardering ontvangen van klanten, collega’s en eindgebruikers omdat we dat verdienen.</p>\n<p>Finalist is met 80 collega’s niet te groot en niet te klein. Overzichtelijk genoeg om een leuke band met collega's op te bouwen en groot genoeg voor een interessante carrière. Bij ons ben je geen nummer en hebben begeleiding en coaching prioriteit. Een veilige professionele leeromgeving met eerlijke beloning vinden we belangrijk. We zijn onafhankelijk in technologiekeuzes en hebben een moderne, exotische en productieve stack. Het gaat goed met Finalist en willen nog meer mooie software bouwen. Gezonde groei zoekt natuurlijk nieuwe collega’s!</p>\n",
    "how_to_apply": "<p>Heb je interesse in deze functie? Dan nodigen wij jou van harte uit om te reageren. Laat je CV en motivatie achter via onze <a href=\"https://www.werkenbijfinalist.nl/nl/sollicitatieformulier?vacature=Vacature%20Integratie%20Specialist%20%28Red%20Hat%29?utm_channel_source=github&amp;utm_channel_medium=referral&amp;utm_channel_id=2021&amp;utm_campaign=integratie-specialist&amp;utm_campaign_id=154642\">sollicitatiepagina</a>.</p>\n<p>Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.</p>\n<p><em>Trefwoorden: Integratie Specialist, Development Engineer, Ontwikkelaar, Developer / Integratie Specialist, Javascript Integratie Specialist, IT Integratie Specialist, Integration Developer, Java Software Ontwikkelaar</em></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGwvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--55a5d782e3ead3e38ca71ab456f234211104d4f3/Logo%202020.jpg"
  },
  {
    "id": "72e4d579-9697-4b4b-89ac-af85d6efcad5",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/72e4d579-9697-4b4b-89ac-af85d6efcad5",
    "created_at": "Tue Feb 25 21:13:50 UTC 2020",
    "company": "Lawrence Berkeley National Laboratory (LBNL)",
    "company_url": null,
    "location": "Berkeley",
    "title": "Front End Developer (Angular 5+) ",
    "description": "<p>Front End Developer (Angular 5+) - 89755\nOrganization:  EA-Energy Analysis Env Impacts</p>\n<p>Berkeley Lab’s Energy Analysis and Environmental Impacts Division (EAEI) is looking for a Front End Developer (Angular 5+) to help design and deploy the next generation of eProject Builder.  Winner of a 2018 R&amp;D 100 Award, eProject Builder is a nationwide energy project data management system that enables organizations around the world to standardize, track, analyze, report, and benchmark data for clean energy and water projects.</p>\n<p>In this role, you will work in a small team designing, building, and testing new Angular 7 front-end components, designing the data models used by those components, and effectively communicating the data requirements to the back-end developers. You will have the opportunity to enhance existing tools and develop new ones, work on other areas of the application stack, too, including Node.js/Express/TypeScript back-end serve, PostgreSQL database design, and devops CI/CD with GitLab and Docker.  Additionally, you will provide design guidance and support for prototype development of a series of other tools related to clean energy technology adoption.</p>\n<p>Join Berkeley Lab in bringing science solutions to the world. We’re enthusiastic and proud of our work developing clean energy technology solutions. Work in a results-driven research environment as we develop new Web-based technologies supporting energy security and climate change mitigation.</p>\n<p>What You Will Do:</p>\n<ul>\n<li>Contribute to creating user interface requirements and project functional and technical specifications.</li>\n<li>Implement solutions to meet specifications and project milestones on time.</li>\n<li>Using state of the art development practices and testing frameworks, write and test efficient code., integrate the correct code testing protocols, use state of the art software development best practices and testing frameworks.</li>\n<li>Communicate regularly and effectively with project management and team members to ensure that the team is well-informed and supportive in providing solutions that meet project needs.</li>\n</ul>\n<p>What is Required:</p>\n<ul>\n<li>Bachelor’s Degree in Computer Science, Engineering, or a related field and a minimum of 5 years of experience developing web applications using current front-end web technologies, in particular Angular v5+ frameworks, HTML5 / CSS3 and JavaScript ES5/ES6 or an equivalent combination of education and experience.</li>\n<li>Ability to write code and documentation following best practices.</li>\n<li>Solid understanding of object-oriented concepts and Observables/RxJS.</li>\n<li>Knowledge of various web api concepts (REST, authentication, ...).</li>\n<li>Strong understanding and experience using Git in a team environment.</li>\n<li>Excellent oral and written communication skills.</li>\n<li>Ability to work independently and take initiative on own tasks while also taking direction and working well within a team environment.</li>\n</ul>\n<p>The posting shall remain open until the position is filled, however for full consideration, please apply by close of business on March 15, 2020.</p>\n<p>Notes:</p>\n<ul>\n<li>This is a full time, M-F, exempt from overtime pay (monthly paid), 1 year, Term appointment with the possibility of extension for up to 5 years or conversion to Career appointment based upon satisfactory job performance, continuing availability of funds and ongoing operational needs.</li>\n<li>Salary is commensurate with experience.</li>\n<li>This position may be subject to a background check. Any convictions will be evaluated to determine if they directly relate to the responsibilities and requirements of the position. Having a conviction history will not automatically disqualify an applicant from being considered for employment.</li>\n<li>Typically work will be performed at Lawrence Berkeley National Lab, 1 Cyclotron Road, Berkeley, CA.  This position has the option of working remotely, but limited to individuals residing in the United States.</li>\n</ul>\n<p>How To Apply\nApply directly online at <a href=\"http://50.73.55.13/counter.php?id=179158\">http://50.73.55.13/counter.php?id=179158</a> and follow the on-line instructions to complete the application process.</p>\n<p>Berkeley Lab (LBNL, <a href=\"http://www.lbl.gov/\">http://www.lbl.gov/</a>) addresses the world’s most urgent scientific challenges by advancing sustainable energy, protecting human health, creating new materials, and revealing the origin and fate of the universe. Founded in 1931, Berkeley Lab’s scientific expertise has been recognized with 13 Nobel prizes. The University of California manages Berkeley Lab for the U.S. Department of Energy’s Office of Science.</p>\n<p>Working at Berkeley Lab has many rewards including a competitive compensation program, excellent health and welfare programs, a retirement program that is second to none, and outstanding development opportunities.  To view information about the many rewards that are offered at Berkeley Lab - Click Here (<a href=\"https://hr.lbl.gov/\">https://hr.lbl.gov/</a>).</p>\n<p>Equal Employment Opportunity: Berkeley Lab is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or protected veteran status. Berkeley Lab is in compliance with the Pay Transparency Nondiscrimination Provision (<a href=\"https://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html\">https://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html</a>) under 41 CFR 60-1.4.  Click here (<a href=\"https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\">https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm</a>) to view the poster and supplement: \"Equal Employment Opportunity is the Law.\"</p>\n<p>Lawrence Berkeley National Laboratory encourages applications from women, minorities, veterans, and other underrepresented groups presently considering scientific research careers.</p>\n",
    "how_to_apply": "<p><a href=\"http://50.73.55.13/counter.php?id=179158\">http://50.73.55.13/counter.php?id=179158</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGQvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7fe07a645c5cc767ca56d5e36c9bc8c8529dee43/Lawrence%20Berkeley%20Lab%20blue%20background.png"
  },
  {
    "id": "e45ef1f5-e66c-4778-aaee-dca862c572f6",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e45ef1f5-e66c-4778-aaee-dca862c572f6",
    "created_at": "Mon Feb 24 01:12:32 UTC 2020",
    "company": "Prota Ventures",
    "company_url": null,
    "location": "Remote",
    "title": "Senior Software Engineer",
    "description": "<p>About Prota:</p>\n<p>Prota Ventures brings experience, capital, community and direction to bold ideas. We power new projects, invest in early-stage startups and seek out the true invention. Our teams utilize time-tested approaches, strategic thinking, story-driven design, and rock-solid engineering to bring products to market in the digital &amp; physical spaces, IoT, emerging technologies, and more. We are a fully remote organization that works across time zones and borders. We are located in Chicago, New York, Seattle and Belgrade. We are growing rapidly. We work with both Fortune 500s and new founder teams. Every member of Prota is expected to bring a genuine entrepreneurial spirit to the table; many of our product ideas are generated internally and brought to market in collaboration with our incubation partners. This is a remote contract role that can be, freelance, part-time or full-time.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Developing front-end web (React/Redux) and mobile (React Native) architecture.</li>\n<li>Developing server-side web application architecture and logic (Ruby on Rails API).</li>\n<li>Architecting Databases (PostgreSQL) and data IO from 3rd-party APIs.</li>\n<li>Optimizing User Experience across web and mobile platforms</li>\n<li>Ensuring responsiveness, performance, and scalability of applications</li>\n<li>Designing and developing APIs</li>\n<li>Participating in the overall application lifecycle while focusing on coding and debugging</li>\n<li>Collaborating with Technical product leads and front-end developers</li>\n<li>Defining and communicating technical and design requirements</li>\n<li>Training, helping and supporting other team members</li>\n<li>Building high-quality reusable code</li>\n<li>Developing functional and sustainable web applications with clean, readable code</li>\n<li>Troubleshooting and debugging applications</li>\n<li>Learning about and integrating new technologies</li>\n<li>Staying up to date with current best practices</li>\n<li>Conducting UI tests and optimizing performance</li>\n<li>Collaborating with a multidisciplinary team of designers, developers, and entrepreneurs</li>\n<li>Participating in conferences and educational programs</li>\n</ul>\n<p>Requirements and Qualifications</p>\n<ul>\n<li>Entrepreneurial drive: we regularly create, develop, and work with startups and Fortune 500 companies</li>\n<li>5+ years of experience as a back-end developer</li>\n<li>In-depth understanding of web development</li>\n<li>5+ years of experience with one or more programming languages such as Java, Ruby, PHP, Python, etc.</li>\n<li>5+ years of experience with a CMS framework</li>\n<li>5+ years of experience with HTML, JavaScript, CSS</li>\n<li>2+ years of experience with React (ideally with Redux)</li>\n<li>Critical thinker and problem-solving skills</li>\n<li>Team player with an attitude of “leaving the campsite better than we found it” and “we’ve got each other’s back” state of mind</li>\n<li>Good organizational and time-management skills</li>\n<li>Participation in regular project stand-ups even with potential time zone challenges</li>\n<li>Meet project deadlines</li>\n<li>The ability to effectively communicate with peers, superiors, and stakeholders.</li>\n<li>The ability to make rational, logical decisions and the ability to defend them to your peers, superiors, and stakeholders.The humility to understand that they are not the smartest person in the room, and that a person can learn from anyone</li>\n<li>The ability to take responsibility for their work and their mistakes.</li>\n</ul>\n<p>Nice to Have But Not Necessary</p>\n<ul>\n<li>Passion for environmentalism and social equality</li>\n<li>Experience collaborating with designers and developers</li>\n<li>Experience working on multiple projects at the same</li>\n</ul>\n<p>Perks:</p>\n<ul>\n<li>Continuous education and skill development.</li>\n<li>Competitive wages</li>\n<li>Huge growth opportunities. Being a part of a quickly growing company in a growing industry, you have an opportunity to learn a lot and grow fast professionally.</li>\n<li>Working with leading market technologies.</li>\n<li>The professional, forward-thinking and friendly international work atmosphere</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jsco.re/46j3t\">https://jsco.re/46j3t</a></p>\n",
    "company_logo": null
  },
  {
    "id": "51f91d62-4f47-4117-b736-9b5505fbdc8d",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/51f91d62-4f47-4117-b736-9b5505fbdc8d",
    "created_at": "Fri Feb 21 22:46:12 UTC 2020",
    "company": "Face Hired Inc",
    "company_url": null,
    "location": "San Mateo",
    "title": "Senior Frontend Engineer",
    "description": "<p>Quick Intro of Wavely:</p>\n<p>Wavely is a US Based Job Board which uses scientific and AI- Based algorithms to screen the talent pool and find the right fit match.</p>\n<p>We intend to change the recruitment process with instant chat communication and advanced algorithm matching between candidates and job openings. We’re dedicated to supporting recruiters and professionals find the perfect match quickly and on the go.</p>\n<p>Established in 2016, we operate from our offices in Los Angeles and San Mateo, California. In 2018, we launched our desktop and mobile job search app for iOS and Android. Now, connecting with your new hire or job is as easy as waving hello.</p>\n<p>We are searching for communicative candidates who are proactive and passionate about company products and the clients they serve. Account Managers will act as a point of contact for their clients. They will build long-lasting, mutually beneficial relationships with their contacts, always striving to find the products which best fit the individual needs of the client. They also aid internal departments by collecting information, such as sales leads or testimonials, assisting in the processing and analysis of client data and complaints, and identifying industry trends.</p>\n<p>Job summary:</p>\n<p>Senior Front-end Developer thrives in an environment of daily critical thinking and has the ability to source relevant information to complete projects. They are highly organized and able to prioritize multiple, competing deadlines, communicate clearly, and effectively with our internal product and tech team.\u2028</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Implement responsible web design principles to ensure that our website pages and mobile app renders across multiple devices</li>\n<li>Create exceptionally designed web content to enhance and improve user experience</li>\n<li>Optimize the application for maximum speed and scalability</li>\n<li>Maintain graphic standards and branding throughout the product’s interface</li>\n<li>Build high-quality mock-ups and design different prototypes</li>\n<li>Update job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment</li>\n<li>Proactively identify new opportunities to broaden skillset and knowledge in emerging technologies and products</li>\n<li>Lead the front-end developer team to work with other teams such as product team, graphic design team, etc.</li>\n<li>Maintain coding best practices, development environments and the software development lifecycle</li>\n<li>Collaborate with our product team including our back-end developers and graphic designer</li>\n<li>Find solutions to new daily challenges</li>\n<li>Measure and report out the effectiveness of various programs/tasks</li>\n<li>Write functional documents and specifications</li>\n<li>Increase the ease of use of our applications assist back-end developers with coding and troubleshooting is a plus</li>\n</ul>\n<p>Qualifications:</p>\n<ul>\n<li>Bachelor’s degree in a relevant field or at least three years’ experience in front-end web development</li>\n<li>Minimum 3+ years’ experience in common web languages: HTML, CSS, JavaScript, Vue, Vuex, Node.js, Weex. Web IM technics based on MQTT is preferred.</li>\n<li>Experience with SQL</li>\n<li>Experience with Git or comparable version control</li>\n<li>Expert in Adobe Creative Suite including Photoshop &amp; Illustrator</li>\n<li>Expert understanding of client-side scripting and JavaScript frameworks, including jQuery &amp; VueJS, especially Vue framework development</li>\n<li>Exemplary written and verbal communication skills</li>\n<li>Experience with back-end development a plus</li>\n<li>Experience working with dashboard/SaaS type UI and UX; Experience building UIs; Experience working around PHP-based web applications, and experience with MySQL; Wealth of knowledge in web development tools and programming languages</li>\n<li>Bilingual in Chinese (Mandarin) is required in order to work with Headquarters team efficiently</li>\n</ul>\n",
    "how_to_apply": "<p>Please email your resume to <a href=\"mailto:tingtinglin@wavely.com\">tingtinglin@wavely.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWgvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ee7ab9e609f611dac5d7117ac9fdac1b8bcf7876/thumbnail.png"
  },
  {
    "id": "e0096319-cd0f-4f71-b10b-c39c696091c3",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e0096319-cd0f-4f71-b10b-c39c696091c3",
    "created_at": "Fri Feb 21 12:03:07 UTC 2020",
    "company": "neuroloop GmbH",
    "company_url": "http://neuroloop.de/",
    "location": "Freiburg im Breisgau",
    "title": "Senior Software Developer (m/f/d)",
    "description": "<p>neuroloop® develops a platform to stimulate the vagal nerve for the treatment of chronic diseases in connection with autonomous body functions. The core of our platform is a multichannel cuff-electrode based on thin-film technology that allows us to selectively stimulate specific fibers within the nerve.</p>\n<p>Our first product, the baroloop® stimulator, is specifically designed to treat high blood pressure. Our primary focus is to provide an outstanding clinical effectiveness while minimizing risks and side effects for the patient, and a simple and safe use for the caregiver.</p>\n<p>neuroloop® is a spin-off of the University of Freiburg and the Freiburg University Hospital. Our partner and investor is Aesculap AG, a subsidiary of the medical device giant B Braun Melsungen AG.</p>\n<p>We are currently looking for the next possible entry in Freiburg i.Br. for a</p>\n<h1>Senior Software Developer (m/f/d)</h1>\n<p>You design, develop and test software for the non-implanted parts of our product that are capable of storing, transferring and analyzing data collected by the implant from patients’ home to a secure cloud system. In close cooperation with a team of experts from different disciplines you are working on a secure, state-of-the-art cloud-based system for evaluating patient data and for remote management of patients by the caregiver.</p>\n<p><strong>Your profile</strong></p>\n<ul>\n<li>You have proven, extensive, very good programming skills, and were part of a team developing software in an industrial environment and/or you significantly contributed to a known open source project.</li>\n<li>It is advantageous if you have a degree in computer science or a comparable discipline, for example an education as a qualified IT specialist for software development.</li>\n<li>Safe handling of Linux, Android and Windows.</li>\n<li>Experience in web technologies.</li>\n<li>Good written and spoken English.</li>\n<li>It is advantageous if you already have experience in the field of medical technology or comparable safety-related fields.</li>\n</ul>\n<p><strong>We offer</strong></p>\n<ul>\n<li>An exciting activity in a young company developing the next generation of medical technology active implants.</li>\n<li>A dynamic, agile and international environment in a small team.</li>\n<li>A service-oriented competitive payment and flexible working hours.</li>\n<li>A start-up environment with short distances and quick decisions, but nonetheless with a big international player in the background.</li>\n</ul>\n<p>If you have any questions, please contact Eva Schwab, phone +49 761 1543390.</p>\n<p>neuroloop GmbH, Engesserstr. 4, D-79108 Freiburg</p>\n",
    "how_to_apply": "<p>Please send your complete application documents exclusively electronically in\nPDF format (max 10 MB size) to <a href=\"mailto:jobs@neuroloop.de\">jobs@neuroloop.de</a>. Your application will be without saying treated strictly confidential and deleted after completing the application process.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUovIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--61896c8db267ef1136a907935dade753dc9eeb30/neuroloop_front_vorab.png"
  },
  {
    "id": "1dd6197b-b2be-40bf-a1f2-5e22039e0e81",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/1dd6197b-b2be-40bf-a1f2-5e22039e0e81",
    "created_at": "Wed Oct 02 07:49:33 UTC 2019",
    "company": "LINE Fukuoka",
    "company_url": "https://linefukuoka.co.jp/en/career/engineer",
    "location": "Fukuoka, Japan",
    "title": "Development Engineer (Server-side) , (English and Japanese speakers welcome)",
    "description": "<p>*<strong>Please apply to only one position at a time.</strong></p>\n<p>LINE is a diverse company with some of the best engineers from around the world, approximately 30% of our developers come from outside of Japan. We are looking for experienced engineers with an interest in customer focused development who wish to make an impact on our tens of millions of daily users!</p>\n<p><strong>Job Description:</strong></p>\n<p>We will assign the project to you after inquiring about your experience as an engineer and future career preferences.</p>\n<p><strong>【Server Development】</strong></p>\n<p>You will be operating and performing API/web application development work for server-side features of LINE’s services.</p>\n<p><strong>【Specific Responsibilities Include】</strong></p>\n<ul>\n<li>Design, develop, test, deploy, maintain and improve server-side software</li>\n<li>Contribute to architectural designs which can improve the efficiency and flexibility of our services</li>\n<li>Mentor and train team members on software design and coding standards</li>\n<li>Work closely with other teams on the development of end-user facing web applications.</li>\n<li>Support the development of high-quality code through active participation in code and design reviews</li>\n</ul>\n<p><strong>Examples of Server Development Work</strong></p>\n<ul>\n<li>Development and operation of services which support the sale and delivery of paid content such as Stickers, Emoji and Themes</li>\n<li>Service development for LINE Family Apps (e.g. “LINE Creators Market”, “LINE Fortune”, “LINE Surveys”, “LINE Part Time Jobs”, \"LINE Financial\" etc.)</li>\n</ul>\n<p><strong>【Tech Stack】</strong></p>\n<p>Java, Kotlin, Perl, JavaScript, Thrift, Spring Framework, MySQL, MongoDB, Redis, Kafka, Elasticsearch, Prometheus, Grafana, etc.</p>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Professional knowledge of at least one programming language 　</li>\n<li>3+ years of experience in software development, including coding experience for web services</li>\n<li>Basic knowledge in computer science (e.g. algorithm, data structure, asynchronous I/O, database, network)</li>\n<li>Work experience using version control systems (VCS), dependency management systems, and continuous-integration systems (CI)</li>\n<li>Motivation to learn Japanese</li>\n<li>Whilst there are many English speakers at LINE successful applicants may be asked to attend a Japanese training course for at least 3 ~ 12 months after joining. The training is paid for by us, and is an excellent chance to pick up new language skills.</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Experience in developing applications using Java 8+</li>\n<li>System architecture and design experience</li>\n<li>Basic knowledge of client-side technologies such as HTML, CSS and JavaScript</li>\n<li>Experience in using a Linux development environment</li>\n<li>Experience in the coaching, management and/or leadership of a technical team</li>\n<li>Open-source software development experience and/or participation in open source communities is also a plus</li>\n<li>Strong interest and ability to learn any new technical topic</li>\n<li>Communication ability in English and conversational level of Japanese (JLPT N2 or above)</li>\n</ul>\n<p><strong>Working Hours:</strong>\nDiscretionary and flexible according to ability and speed of work; if projects are completed on time there is no need to stay in the office for extended periods of time.</p>\n<p><strong>Salary:</strong>\nMinimum salary starting from 6 million Japanese yen per annum (salary based on experience and ability).</p>\n<p>*Other details to be discussed during the interview process.</p>\n",
    "how_to_apply": "<p>Please apply from the link below:\n<a href=\"https://linefukuoka.co.jp/en/career/list/engineer/development_engineer_server-side\">https://linefukuoka.co.jp/en/career/list/engineer/development_engineer_server-side</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHh6IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--41c325e1eb9651fcc7bf2f876f3c86da93051d32/LINE_Text_Logo_TypeA.png"
  },
  {
    "id": "99dca2ab-5151-4d67-b9d7-3c698a099e74",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/99dca2ab-5151-4d67-b9d7-3c698a099e74",
    "created_at": "Thu Oct 03 01:50:34 UTC 2019",
    "company": "LINE Fukuoka",
    "company_url": "https://linefukuoka.co.jp/en/career/",
    "location": "Fukuoka, Japan",
    "title": "Development Engineer (iOS/Android)",
    "description": "<p>*<strong>Please apply to only one position at a time.</strong></p>\n<p><strong>Both Japanese and Non-Japanese speakers welcomed;</strong> Whilst there are many English speakers at LINE successful applicants may be asked to attend a Japanese training course for at least 3 ~ 12 months after joining. The training is paid for by us, and is an excellent chance to pick up new language skills. We encourage employees to reach JLPT N2 within a few years of joining.</p>\n<p>LINE is a diverse company with some of the best engineers from around the world, approximately 30% of our developers come from outside of Japan. We are looking for experienced engineers with an interest in customer focused development who wish to make an impact on our tens of millions of daily users!</p>\n<p><strong>Job Description:</strong></p>\n<p>Projects will be assigned based on our assessment of your experience taking into account your interests and career preferences.</p>\n<p><strong>【Client Development】</strong></p>\n<p>You will be involved with the development of, and operational work for, the LINE client and LINE Family App clients.</p>\n<p><strong>【Specific Responsibilities Include】</strong></p>\n<ul>\n<li>Collaborating with the Planning and Design teams to bring ideas to life (e.g. through coding, creating unit tests, etc.)</li>\n<li>Performing app profiling and improving performance</li>\n<li>Improving and maintaining a CI environment that supports stable development Improving code quality through code reviews</li>\n<li>UI/UX improvement</li>\n</ul>\n<p><strong>Examples of Client Development Work</strong></p>\n<ul>\n<li>Development of sticker/theme/emoji features in the LINE app</li>\n<li>Development of LINE Family Apps (e.g. “LINE Creators Studio”)</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<p>Either of:</p>\n<ul>\n<li>Experienced in iOS native application development using Swift/Objective-C (3+ years).</li>\n<li>Experienced in Android native application development using Kotlin/Java (3+ years).</li>\n</ul>\n<p>And</p>\n<ul>\n<li>Professional knowledge of at least one programming language</li>\n<li>Basic knowledge in computer science (e.g. algorithm, data structure, asynchronous I/O, network)</li>\n<li>Work experience using version control systems (VCS), dependency management systems, and continuous-integration systems (CI)</li>\n<li>Communication ability in Japanese or English</li>\n<li>Motivation to learn Japanese</li>\n</ul>\n<p><strong>Preferred Skills:</strong></p>\n<ul>\n<li>Web/Native hybrid applications</li>\n<li>UI/UX design and implementation (e.g. custom views and interactions)</li>\n<li>Experience in the coaching, management and/or leadership of a technical team</li>\n<li>Open-source software development experience and/or participation in open source communities is also a plus</li>\n<li>Strong interest and ability to learn any new technical topic</li>\n</ul>\n<p><strong>Working Hours:</strong>\nDiscretionary and flexible according to ability and speed of work; if projects are completed on time there is no need to stay in the office for extended periods of time.</p>\n<p><strong>Salary:</strong></p>\n<p>Minimum salary starting from 6 million Japanese yen per annum (salary based on experience and ability).</p>\n<p>*Other details to be discussed during the interview process.</p>\n",
    "how_to_apply": "<p>Please apply from:\n<a href=\"https://linefukuoka.co.jp/en/career/list/engineer/development_engineer_client-side\">https://linefukuoka.co.jp/en/career/list/engineer/development_engineer_client-side</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdVp6IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--020995eafa0bf64111f7cd8b328336dfa65d24e4/LINE_Text_Logo_TypeA.png"
  },
  {
    "id": "6e078400-6a53-4963-8d0a-3254cf73d59d",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6e078400-6a53-4963-8d0a-3254cf73d59d",
    "created_at": "Fri Feb 21 08:13:25 UTC 2020",
    "company": "Noordhoff",
    "company_url": "https://www.noordhoff.nl/",
    "location": "Utrecht",
    "title": "Senior software engineer",
    "description": "<p>Wanted: For our locations in Utrecht we are looking for a</p>\n<p><strong>Senior software engineer</strong></p>\n<p>As a senior software engineer you have significant experience in relevant languages and frameworks. Even though you have a senior role within your team, you do support others to grow and improve.</p>\n<p>For everyone who discovers. For everyone who grows. For everyone who performs and challenges themselves. For your smallest dreams and your biggest ambitions. Learning will take you further. From your first day at school to the next step in your career. Noordhoff is there for you and everyone who learns.</p>\n<p>Our digital learning solutions helps everyone learn to their full potential. Every day over 2 million people, young and old, work and learn with the learning resources, technology, and services from Noordhoff. We believe that learning can always be improved. We also challenge ourselves to look further than today. We continue to innovate. Together with everyone who, just like us, has a heart for learning.</p>\n<p><strong>Your future (technical) environment</strong>\nOur platform consists of a mix of .NET, Node and React + Redux services that run as Web Applications or containers in Kubernetes on Azure. We are moving towards an architecture based on microservices, continuous delivery, and true ownership of the final product. You will work with the modern web technologies with experienced, multidisciplinary, agile teams.</p>\n<p>As a senior software engineer you have significant experience in relevant languages and frameworks. Even though you have a senior role within your team, you do support others to grow and improve. You do not simply deliver code but also take ownership of process and team improvements which expand the team’s capacity for delivering value to our customers. As a senior software engineer you take leadership roles within your team.</p>\n<p><strong>Learning starts with yourself</strong>\nLearning and developing takes a central place at Noordhoff. This starts with you as senior software engineer and ends with our customers, both students, and teachers. There are bi-weekly Knowledge Sharing meetings and you have plenty of room to continue to develop your skills on a holistic level.</p>\n<p><strong>And who are you?</strong></p>\n<ul>\n<li>With your knowledge and enthusiasm you are able to inspire your team and you ensure solutions that fulfil the needs of our clients.</li>\n<li>You work within your team based on the principle: \"you build it, you run it\".</li>\n<li>You have the drive to develop high-quality technological solutions.</li>\n<li>You are happy to own the entire product development cycle from architecture to development and delivery with the team.</li>\n<li>You find it fun and important to share your knowledge.</li>\n<li>You are happy to work in a dynamic and agile environment.</li>\n</ul>\n<p><strong>What experience do you have?</strong></p>\n<ul>\n<li>You'll ideally have a degree, preferably in a technical subject.</li>\n<li>Excellent software development, web technology and framework (e.g. .NET, JavaScript, Node.js, React, Vue or Angular) knowledge and skills.</li>\n<li>We are looking for a senior with more than 5 years of experience as a Software Engineer.</li>\n<li>You’ve worked in an agile environment.</li>\n</ul>\n<p><strong>What do you get from us?</strong></p>\n<ul>\n<li>A competitive salary and end-of-year bonus;</li>\n<li>Ownership of the things you build, support to grow and a clear and structured career path;</li>\n<li>Attractive and flexible employment conditions including a Personal Budget.</li>\n<li>Your working hours? You determine together with your team how, where and when you work. Of course, we support this with technical tools, such as Slack and Zoom</li>\n</ul>\n",
    "how_to_apply": "<p>Noordhoff Uitgevers is part of Infinitas Learning. Visit our website to learn more about Infinitas Learning and your career as a software engineer. You can apply by clicking on the <a href=\"https://vacature.onlinevacatures.nl:443/?vid=154069&amp;jid=2021\">applybutton</a>, you only have to leave your CV. Closing date of this vacancy 30 April 2020</p>\n<p>Would you prefer to know more about this vacancy first? Then contact one of our recruiters via Whatsapp.</p>\n<p>Jolandi Schreuder\nWhatsapp: 06-28719027</p>\n<p>Marjolein Bovens\nWhatsapp: 06-40100320</p>\n<p>Acquisition as a result of this vacancy is not appreciated.</p>\n<p><em>Keywords: Informatica, Technische Informatica, Front-end Developer, Software Developer, Software Engineer, Agile, vacature Utrecht</em></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbE4vIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6d6112c195dfd7f9253dd71a9ff5ee93898064dc/Logo%20Noordhoff%202020.jpg"
  },
  {
    "id": "20ebccd1-148a-4b35-b32a-1c340d18439f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/20ebccd1-148a-4b35-b32a-1c340d18439f",
    "created_at": "Thu Feb 20 05:54:49 UTC 2020",
    "company": "Binance",
    "company_url": "https://www.binance.com/",
    "location": "Singapore / Asia",
    "title": "Rust Developer (C/C++/Java to Rust)",
    "description": "<p>We are continuing to build up our next generation crypto-currency exchange and are looking for eager, hard-working problem solvers that can continue to evolve our 24-7, highly scalable, exchange system as new features and performance improvements are constantly being added.</p>\n<p>This role with work with our backend development team on our exchange platform that has allowed Binance to become one of the biggest crypto-currency exchanges in the world, solving difficult and unique challenges that are presented for running a platform with 10s of millions of users and 24/7 availability.</p>\n<p>We are looking for talented Software Engineers (7-10+ years of experience) to work on our backend for our world class trading platform in one of our offices in Asia.\n<strong>NOTE:</strong> this position is in one of our locations in Asia, not necessarily Singapore.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Architect scalable backend systems, services, and APIs</li>\n<li>Evolve our long term vision for maintaining and scaling our backend systems</li>\n<li>Design high reliability services that can withstand large fluctuations in traffic</li>\n<li>Monitor our backend performance, identify performance bottlenecks, and find ways to reliably resolve them</li>\n<li>Write backend code that is fast, reliable, but also highly secure</li>\n<li>Maintain and evolve our quickly-growing test suite</li>\n<li>Collaborate effectively with other staff to solve complex problems</li>\n<li>Provide mentorship and lead strong development practices inside the team</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>A solid foundation with C/C++, Java, or any compiled language</li>\n<li>Working experience with Rust would be a huge plus</li>\n<li>Ability to write robust, highly efficient, reliable code</li>\n<li>Experience writing multi-threaded applications</li>\n<li>Have deployed software to a production environment</li>\n<li>Familiarity with Linux</li>\n<li>BSc in Computer Science, Math, or similar</li>\n<li>Experience with scaling production databases: Postgres, MySQL, and/or MongoDB is a big plus</li>\n<li>Experience building systems with financial or security constraints is a big plus</li>\n</ul>\n",
    "how_to_apply": "<p>Fill out the application form at our job board: <a href=\"https://jobs.lever.co/binance/2c03bc65-3c1a-43d8-ab2c-bbf5899c9d4a/apply\">https://jobs.lever.co/binance/2c03bc65-3c1a-43d8-ab2c-bbf5899c9d4a/apply</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanQvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2cf70312a3e5bd903f0e9cc5d5f3f61e425348bb/photo_2017-09-26_17-47-30%20(2).jpg"
  },
  {
    "id": "f574edcf-64c8-4582-b4d8-719d2dc9459f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f574edcf-64c8-4582-b4d8-719d2dc9459f",
    "created_at": "Wed Feb 19 10:01:25 UTC 2020",
    "company": "GOhiring GmbH",
    "company_url": "https://www.gohiring.com/",
    "location": "Berlin | Remote",
    "title": "Senior fullstack React / Ruby developer",
    "description": "<p><strong>About us</strong></p>\n<p>We are looking for people who are up to the task of digitizing the job advertising market with us. GOhiring offers digital infrastructure for companies, HR IT-systems, job portals and agencies to enable more direct and productive ways of collaborating. That way, job postings can be published via an API and managed with transparency via digital processes. Thanks to state-of-the-art tools, we have also digitized our own working environment and set up everything for #remote work from anywhere in the world.</p>\n<p><strong>Your role</strong></p>\n<ul>\n<li>As part of our development team, you will be responsible for building smart, customer-driven front- and back-end solutions</li>\n<li>This implies solving exciting engineering challenges, starting with MVP’s and iterating from there</li>\n<li>You collaborate closely with our experienced team of backend developers, product managers, designers and testers</li>\n<li>You work on complex frontend projects using React and other JS frameworks</li>\n<li>Depending on your interests and skills, you will work on different parts of our product ecosystem</li>\n</ul>\n<p><strong>Your profile</strong></p>\n<ul>\n<li>You get excited about good quality code and engineering quests</li>\n<li>You have at least five years experience in web development including +1 year in React.js and +3 years in Ruby. More languages as a bonus.</li>\n<li>You value testing, well-documented code and intelligent software design techniques</li>\n<li>You already have good knowledge about API Design and performance optimization</li>\n<li>You are conversant in English</li>\n</ul>\n<p><strong>What to expect</strong></p>\n<p><strong>Remote culture -</strong> Work wherever you are most productive - at home, while traveling or in our office in Berlin. Benefit from processes and mindsets which are 100% oriented towards working flexible hours in the location of your choice.</p>\n<p><strong>Small, agile team -</strong> We believe that work is simply more fun in small teams. Experienced colleagues, jointly defined company targets, a direct exchange and lots of creative leeway: That is what constitutes our understanding of productivity.</p>\n<p><strong>Complex challenges -</strong> Due to our central role in the market, we are closely interlinked with all the players and are able to reach unparalleled depths when it comes to digitizing business processes. In doing so, we encounter new challenges time and time which are waiting to be solved for the benefit of all market players.</p>\n<p><strong>Sounds like an interesting challenge for you?</strong></p>\n<p>We believe in culture first, skills second: if you are truly interested in this job, you should apply - even if you do not fulfill 100% of the requirements.</p>\n<p>Simply send us your profile in addition to your Github handle. We look forward to getting to know you better!</p>\n<p><em>Diversity and equal opportunity are important to us. We are happy about the interest of all candidates and strive to provide feedback as quickly as possible.</em></p>\n<p><img src=\"https://camo.githubusercontent.com/3d7d1327dffc649ac7c9b335a3c6d636cc19afe7/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f63623963333635303533613633313565326137343333613632383435393237626661366339396263306265333763616339386239326265376430633366643231\"></p>\n",
    "how_to_apply": "<p><a href=\"https://tracking.gohiring.com/h/382686f4328977849c660e09bf15d37d0cc6037bce243d1e957b564b7574b196\">application form</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDkvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9c49e31211e76265bf63ddd1ebe1fa509d895061/gohiring_logo.png"
  },
  {
    "id": "c212d37a-677c-45b2-897d-3b1204dac93d",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c212d37a-677c-45b2-897d-3b1204dac93d",
    "created_at": "Tue Feb 18 10:52:48 UTC 2020",
    "company": "Cobiro ApS",
    "company_url": "http://www.cobiro.com",
    "location": "Copenhagen",
    "title": "Software QA Engineer",
    "description": "<p><strong>The Company</strong></p>\n<p>Digital marketing is an effective way to grow your business and, at Cobiro, we feel it should be accessible for everyone - not just for experts!</p>\n<p>We’re using AI and Machine Learning to plan your business’ success from scratch and guide you through fully-fledged marketing campaigns across Google and Facebook. Small businesses have enough to think about – digital marketing doesn’t need to be one of them.</p>\n<p>Today, Cobiro manages more than 1.7 billion keywords in over 50 languages and is run by an amazingly talented team of developers, online marketers and UX experts from all around the world (over 20 nationalities and counting!). We are now helping more than 60,000 happy businesses grow each and every day with better ads.</p>\n<p><strong>The Challenge</strong></p>\n<p>You will be joining a company that follows the Spotify Model (think autonomous squads, continuous improvement and QA guilds!), working alongside our other talented QA Engineers, as you embed yourself within one of our 4-6 person Feature Squads.</p>\n<p>At Cobiro we are leading the way in bringing the next generation of online advertising. We care about quality and so we are looking to hire a like-minded and talented Software QA Engineer to help us in creating the best possible product for our customers.</p>\n<p>You will create automated test cases and, in general, ensure the highest quality product possible. You will be in charge of the release flow, merging pull requests onto the test server and managing the rest of the release flow (testing - building - releasing) in collaboration with the developers.</p>\n<p><strong>The Tech</strong></p>\n<p><strong>Our Frontend</strong>: JavaScript/TypeScript and Angular 2+</p>\n<p><strong>Our Backend</strong>: PHP and Laravel</p>\n<p><strong>What you bring</strong>: Knowledge of one of our Frontend or Backend technologies, skills in automation testing (especially end-to-end testing), expertise in Github and JSON</p>\n<p><strong>Bonus points if you have</strong>: Skills and experience in Postman and SQL, as well as Javascript</p>\n<p><strong>The Perks</strong></p>\n<ul>\n<li>\n<p>A top-notch team of passionate and skilled colleagues who focus on creating quality solutions</p>\n</li>\n<li>\n<p>Your choice of hardware (Mac or Lenovo)</p>\n</li>\n<li>\n<p>We are committed to lifelong learning so we are always happy to support you in becoming the best you possible (in 2018 we sent our developers to Laracon in Amsterdam!)</p>\n</li>\n<li>\n<p>Flexible working hours</p>\n</li>\n<li>\n<p>Lunch, snacks and Friday pastries to keep the hunger pangs away</p>\n</li>\n<li>\n<p>Monthly massages and haircuts</p>\n</li>\n<li>\n<p>Friday bars, 8 Ball Pool Tournaments, Summer and Christmas Parties</p>\n</li>\n</ul>\n",
    "how_to_apply": "<p>Apply for the job by clicking “Apply Now”, attaching your CV and/or Linkedin account:\n<a href=\"https://cobiro.bamboohr.com/jobs/view.php?id=58\">https://cobiro.bamboohr.com/jobs/view.php?id=58</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3gvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b7e637428dbc016f64a5ee6b4ef575cb6dcf22a0/cobiro%20logo.png"
  },
  {
    "id": "bfa59a6a-e470-4b5c-a9de-ceb038866e31",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/bfa59a6a-e470-4b5c-a9de-ceb038866e31",
    "created_at": "Mon Feb 17 18:13:26 UTC 2020",
    "company": "GunTRAC LLC",
    "company_url": "https://apb360.com",
    "location": "PHOENIX, ARIZONA",
    "title": "Senior Software Development Engineer",
    "description": "<p>About the Job:</p>\n<p>GunTRAC LLC, a maturing startup, (APB360.com) is looking for a full-time Software Engineer with extensive experience working with WordPress and the full stack. Our work is fast-paced and constantly changing. Must be able to prioritize multiple projects and competing deadlines. Must be able to attack ambiguous tasks head-on and meet changing requirements on the fly.</p>\n<p>Additionally, applicants must be US Citizens and pass a rigorous background check. You will be working with law enforcement agencies coast to coast, as well as enterprise-scale firearm manufacturers. You must NOT be a prohibited possessor of a firearm as you will certainly be coming in contact with such restricted items.</p>\n<p>FLEXIBLE OFFICE HOURS, MUST BE LOCAL</p>\n<p>Required Skills:\nWordPress\nPHP 7.3\nPython (a plus) &amp; Lambda\nHTML5\nCSS3\nJS (JQuery)\nMySQL (Aurora) – Very large complex data models, functions and stored procedures\nAWS\nNGINX, Unit, PHP-FPM\nStrong Unix administration skills\nGit\nSSH\nJIRA/Atlassian\nCJIS/Fedramp requirement familiarity</p>\n<p>Experience:\n2+ yrs Backend Dev Experience.\n2+ yrs Frontend Dev Experience.\n2+ yrs AWS.\nApple Mobile Developer (a huge plus)\nManaging and Optimizing High Traffic WordPress Website(s).\nCreating custom WP plugins from scratch.\nProject management skills\ni18n a plus.\nKnow a PHP function for every letter of the alphabet.</p>\n<p>Compensation: DOE ($55-$120k)</p>\n<p>Location: 1492 W. Victory Lane, Phoenix 85027.</p>\n",
    "how_to_apply": "<p>please send your CV to <a href=\"mailto:jobs@apb360.com\">jobs@apb360.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkorIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--142ee248bc8d2c7063f92fcb31e0f79ae4750fe9/Logo-Shield-Only.png"
  },
  {
    "id": "022c2cd7-5b45-458a-93d1-f44acd261506",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/022c2cd7-5b45-458a-93d1-f44acd261506",
    "created_at": "Mon Feb 17 10:33:31 UTC 2020",
    "company": "encoway GmbH",
    "company_url": "https://ltpx.nl/orI5q1d",
    "location": "Bremen",
    "title": "C/C++ Software Developer / DevOps Engineer (w/m/d)",
    "description": "<p>**C/C++ Software Developer / DevOps Engineer (w/m/d)</p>\n<p>Dein Beitrag**</p>\n<ul>\n<li>Du konzipierst und entwickelst auf Basis von C/C++ eine neue innovative Softwareplattform.</li>\n<li>Du lebst Clean Code und arbeitest in einem professionellem modernem Entwicklungsumfeld mit agilen Prozessen, Code Reviews, Pair-Programming, Test Driven Development, Continuous Integration &amp; Delivery, Testautomatisierung u. v. m.</li>\n<li>Du spielst gerne eine aktive Rolle in der Durchführung und Verbesserung unserer Prozesse. </li>\n<li>Du machst Dir unsere agilen Prozesse (Scrum, Kanban) zu eigen und spielst gerne eine aktive Rolle bei deren Durchführung und Verbesserung.</li>\n</ul>\n<p><strong>Dein Profil</strong></p>\n<ul>\n<li>Du hast sehr gute Kenntnisse in modernem C/C++.</li>\n<li>Linux ist Deine Welt.</li>\n<li>Du bist offen für neue Technologien, Frameworks und Sprachen.</li>\n<li>Du bist neugierig auf agile Arbeitsweisen oder hast diese sogar schon kennengelernt.</li>\n<li>Im Alltag sprechen wir Deutsch. Idealerweise scheust Du Dich aber nicht davor, auch Englisch zu sprechen und zu schreiben.</li>\n</ul>\n<p><strong>Mit encoway volle Kraft voraus!</strong>\nDie Digitalisierung ist nach wie vor ein Megatrend. Mit unseren Softwarelösungen unterstützen wir Industrie-Unternehmen bei der digitalen Transformation. Neben unseren Kernkompetenzen Produktkonfiguration und Variantenmanagement, befinden sich dafür weitere Geschäftsfelder im Aufbau.</p>\n<p>Im Jahr 2000 aus einer 5-köpfigen Bremer Forschungsgruppe heraus gegründet, besteht unsere Mannschaft mittlerweile aus über 200 Mitarbeitern und wir sind weiter auf Wachstumskurs. </p>\n<p>Komm auch Du jetzt zu uns an Bord - und lass Dich nicht davon abhalten, wenn Du meinst, Dein Profil passt nicht ganz!</p>\n<p><strong>Bordcheck</strong>\nZu unserer Kultur und unseren Benefits haben wir Dir nachfolgend ein paar Eigenschaften aufgelistet, mit denen Du einen ersten Check machen kannst, ob wir zusammenpassen:</p>\n<ul>\n<li>Startklar: Du wirst bei uns nicht ins kalte Wasser geworfen.</li>\n<li>Aufgeschlossen: Wir bieten Dir die Möglichkeit mitzugestalten.</li>\n<li>Flexibel: Bei uns findest Du flexible Arbeitszeiten.</li>\n<li>State-of-the-art: Ein professionelles und modernes Arbeitsumfeld erwartet Dich.</li>\n<li>Agil: Wir arbeiten in flexiblen Strukturen und Prozessen.</li>\n<li>Wertschätzend: Regelmäßig finden gemeinsame Retrospektiven und Feedbackgespräche statt.</li>\n<li>Fördernd: Weiterentwicklung Deiner Fach- und Führungskarriere.</li>\n<li>Familienfreundlich: Wir unterstützen Dich und Deine Familie (z. B. Zuschuss zu den Kita-Gebühren).</li>\n<li>Gemeinschaftlich: Bei uns finden regelmäßig Mitarbeiter-Events statt.</li>\n<li>Sportlich: Unsere Mitarbeiter treffen sich regelmäßig in Sport-/und Freizeitgruppen zusammen.</li>\n<li>Gesund: Wir bieten verschiedene Präventionsangebote.</li>\n<li>Und sonst noch so...: Obst, Kaffee - die üblichen „Goodies“ gibt´s auch.</li>\n</ul>\n<p>Bei Fragen zu dieser Stelle wende Dich gerne an: \nLaura Middendorf\nTalentmanagement \nencoway GmbH \nBuschhöhe 2 \n28357 Bremen \nTelefon +49 (0) 421 33003-678</p>\n<p><strong>Interessiert?</strong>\nWir freuen uns auf deine Bewerbung. Bitte benutze dafür unser <strong><a href=\"https://ltpx.nl/mtQQINB\">Online Bewerbungstool</a></strong> und schick uns deine Bewerbungsunterlagen.</p>\n<p><em>Erwerb anläßlich dieser Vakanz wird nicht geschätzt.</em><img src=\"https://camo.githubusercontent.com/a0038854c83c956f6e6e84e00694b816ebcb7d4e/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313532383633\"></p>\n",
    "how_to_apply": "<p>Bitte benutze dafür unser <strong><a href=\"https://ltpx.nl/mtQQINB\">Online Bewerbungstool</a></strong> und schick uns deine Bewerbungsunterlagen.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdWQrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8b15d01b29bce7f757ac06317591c27275730bbe/encoway-logo.jpg"
  },
  {
    "id": "d25d1423-54ba-494b-a9e1-9b44055c6c8f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d25d1423-54ba-494b-a9e1-9b44055c6c8f",
    "created_at": "Thu Feb 13 22:45:33 UTC 2020",
    "company": "Southern California Public Radio",
    "company_url": "http:",
    "location": "Pasadena, CA",
    "title": "Senior Software Engineer",
    "description": "<p>Who We Are:</p>\n<p>Southern California Public Radio (SCPR) is a member-supported public media network whose mission is to strengthen the civic and cultural bonds that unite Southern California's diverse communities by providing the highest quality news and information service on air at 89.3 KPCC, online at LAist.com and through KPCC In Person. Since our founding in 1999, SCPR has been a fast growing, innovative, multi-platform public service newsroom. Every day, our staff helps audiences catch up on the latest headlines, solve the complexities of life in Southern California, and connect curious communities to one another.</p>\n<p>Position Summary:</p>\n<p>The Senior Software Engineer will serve as a key team lead on the SCPR digital product team, and work to develop a digital automation landscape, tying together content management, audio and asset management, and mobile distribution systems to existing operational infrastructures.</p>\n<p>They will manage the definition, architecture direction, development, testing, and deployment of these integrated systems, and will work in concert with station engineers at SCPR and participating external organizations to determine the best ways to integrate systems across digital and radio functions, establishing clear content management workflows around content production and distribution.</p>\n<p>Position Responsibility:</p>\n<p>Serve as the primary engineering lead for the digital product team, working with project stakeholders, and non-digital station engineers to architect and strategize integration solutions.\nDevelop deep knowledge of current digital infrastructure to understand how this integration will need to evolve over the next 5-7 years.\nUnderstand business and technology goals; present options and considerations in solution development and problem solving, being mindful of the cost/benefit prospect of developing quickly versus developing for long term sustainability.\nScale SCPR integration strategies to outside organizations.\nWork with off-site SRE team to monitor and resolve any infrastructure situations quickly and efficiently.\nOther duties as assigned.</p>\n<p>Required Education and Experience:</p>\n<p>Bachelor's degree or equivalent work experience.\n5-7 years experience to include the following:\nRuby on Rails, JavaScript, or similar web-focused programming languages (full-stack capability is ideal).\nExperienced in developing web and mobile APIs.\nExperience developing microservices using containers (Kubernetes, Docker).\nWorking understanding of AWS, including Lambda, RDS, EC2, ECS, Cloudfront, etc.\nStrong knowledge of infrastructure architecture best practices and configurations, cloud-based hosting environments such as AWS, and system issue remediation.\nFamiliarity with content and asset management systems a plus.</p>\n<p>Required Skills, Knowledge and Abilities:</p>\n<p>Quick learner and ability to effectively multitask.\nSelf-motivated with an innate curiosity around emerging technology and platforms.\nAbility to work under deadline pressure.\nSolid oral and written communication skills.\nDemonstrated ability to work in an interdisciplinary team environment.\nAbility to work independently with little supervision.\nFamiliarity with communicating technical requirements and managing technical projects to junior developers.\nFamiliarity with the unique demands and requirements of media organizations a plus.</p>\n<p>Preferred Skills and Experience:</p>\n<p>Experience with streaming media and audio management platforms desirable (Stream Machine, Triton, HTTP Live Streaming).\nExperience in working with enterprise-level, consumer-oriented media websites and mobile programs a strong plus.\nReporting To This Position: None.</p>\n<p>Physical Demands and Working Conditions:</p>\n<p>Must be able to perform the essential duties of the position with or without reasonable accommodation.</p>\n<p>Physical Demands:\nRequired to move about in an office environment and sit for extended periods of time\nFrequent use of hands for data entry/keystrokes and simple grasping\nWorking Conditions:\nModerate noise level\nOccasional exposure to prevalent weather conditions</p>\n",
    "how_to_apply": "<p>Use this link: <a href=\"https://americanpublicmedia.applicantpro.com/jobs/1315609.html\">https://americanpublicmedia.applicantpro.com/jobs/1315609.html</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGQrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--430c8744291c124dc8ee5cadcc74da412d0bda73/KPCC%20-%20Full%20Lockup%20-%20Color.png"
  },
  {
    "id": "392397d8-f615-4526-963e-e830c86ae7b3",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/392397d8-f615-4526-963e-e830c86ae7b3",
    "created_at": "Thu Feb 13 19:01:25 UTC 2020",
    "company": "InComm",
    "company_url": "http://www.incomm.com",
    "location": "Downtown Atlanta ",
    "title": "Java Software Developer",
    "description": "<p>InComm is a global leader in FinTech (Financial Technology). We were founded in an Atlanta basement and to date, we are thousands of employees around the world building systems that are redefining the consumer experience.</p>\n<p>The Sr. Software Engineer (Software Engineer III) will be working on the Closed Loop Platform Team. The Closed Loop Platform Team supports a core financial platform that contains a suite of applications. The environment consists of Webservices, web applications, high transaction volume java applications that are multi-threaded and high performing. </p>\n<p>Ensure Delivery of planned initiatives on time with quality.</p>\n<ul>\n<li>Hands on experience using Java/J2EE/Sprint Boot/Restful webservices development</li>\n<li>Hands on experience using Oracle PL/SQL stored procedures.</li>\n<li>Code review stored procedures and guide the team to follow best coding practices.</li>\n<li>Experience in building robust and scalable J2EE application.</li>\n<li>Ensure appropriate monitoring and alerting is in place prior to production deployments.</li>\n<li>Support new and continued development of existing system. Develop, build, deploy and configure\napplications</li>\n<li>Able to quickly adjust and support changing priorities per business needs.</li>\n<li>Provide unit testing to ensure quality of builds in a continuous integration environment.</li>\n<li>Participate in the full lifecycle of projects, including effective use of version control, build\nmanagement, unit testing, and issue tracking software</li>\n<li>Strong analytical skills with the ability to assess complex situations and understand key issues\nquickly</li>\n<li>Ability to adapt in a dynamic work environment and make independent decisions while keeping\nmanagement informed</li>\n</ul>\n<p>7+ Years of Java/J2EE  development experience</p>\n<p>2+ years of CI/CD tools</p>\n<p>5+ years of oracle 18c SQL ,PL/SQL, SQL tuning /optimization and  AWR</p>\n<ul>\n<li>\n<p>Bachelor’s degree in Computer Science or Computer Engineering or Electronics Engineering or\nTelecommunication Engineering or Electrical Engineering or Information Technology or Information\nSystems or other related discipline required.</p>\n</li>\n<li>\n<p>Expert knowledge of Oracle 18c database features and programming in pl/sql.</p>\n</li>\n<li>\n<p>Any other technical certifications a plus (Oracle,Java, Cloud etc)</p>\n</li>\n<li>\n<p>Good understanding of Object Oriented Programming and Design principles including abstraction,\ninheritance, polymorphism and encapsulation</p>\n</li>\n<li>\n<p>Experience with the full lifecycle of software development including use of version control tools,\nbuild management, unit testing, issue tracking software (e.g. SVN, Git, Maven, bamboo, Jenkins,\nSonar, JIRA)</p>\n</li>\n<li>\n<p>Excellent organizational skills, self-administration, attention to detail, multi-tasking, and effective\nprioritization</p>\n</li>\n<li>\n<p>Required experience with the following technologies\no Oracle PLSQL , AWR and preformace tunning.\no Writing and decoding complex oracle PLSQL packages/ procedures\no Spring/Spring-MVC or JAX-RS\no JAVA, XML\no Tomcat, JBoss\no Container based environments (Docker)\no Spring (data, boot, security, batch)\no Hibernate, Hibernate/JPA\no REST Services, SOAP Services\no API Management frameworks\no General SQL/Database experience Oracle/SQL-Server\no Jenkins, Sonar\no JIRA &amp; Confluence</p>\n</li>\n<li>\n<p>Awareness of the following technologies is a plus:\no HTML5/CSS\no JavaScript\no JSP\no Bootstrap\no Angular 2 +, Angular Material, AngularCLI\no NodeJS</p>\n</li>\n<li>\n<p>Strong analytical skills with the ability to assess complex systems and situations and troubleshoot\nissues</p>\n</li>\n<li>\n<p>Problem solving skills, critical thinking and strong decision-making skills</p>\n</li>\n<li>\n<p>Excellent verbal and written communication, and interpersonal interactions (ability to foster a\ncooperative work environment)</p>\n</li>\n</ul>\n",
    "how_to_apply": "<p>To apply, email your resume to <a href=\"mailto:mphillips@incomm.com\">mphillips@incomm.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEorIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--87bdbcaa55cffbfd865a6c69b18cd3304c445845/InComm_Logo_FullColor_RGB.png"
  },
  {
    "id": "2e67c6a6-eda0-4a6d-87af-548eaa8111d3",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/2e67c6a6-eda0-4a6d-87af-548eaa8111d3",
    "created_at": "Thu Feb 13 13:38:09 UTC 2020",
    "company": "Stylight GmbH",
    "company_url": "http:",
    "location": "Munich, Germany",
    "title": "Senior Python Engineer - Evolving Systems (d/f/m)",
    "description": "<p>We are looking for an experienced python engineer to join our team in Munich. You’re interested in further optimizing and automating our pipeline as well as delivering high quality software? Then Stylight is your place to be.</p>\n<p>Your Key Responsibilities</p>\n<ul>\n<li>Support and mentor the team in shipping quality products and code in accordance with business needs.</li>\n<li>Build, maintain, and run our scalable architecture. We take pride in building highly performant and failure resistant platforms with a small team.</li>\n<li>Own services from design, development, and testing to continuous integration, monitoring, and support.</li>\n<li>Enjoy what you do, and be ready to research and learn new technologies. Be prepared to challenge others.</li>\n<li>Explain technical topics to non-technical colleagues and advocate for your team across the company.</li>\n<li>Grow the skillset and spirit of a team of 3 - 5 engineers to foster technical excellence in the team. Bring your best practices, challenge the status quo, and set things in motion.</li>\n</ul>\n<p>Background Of Successful Applicants</p>\n<ul>\n<li>You love writing code from the bottom of your heart and have ideally 5+ years experience in designing, building and operating complex, scalable system using Python.</li>\n<li>You have been contributing to single systems and platforms over a significant amount of time to gather experience on how to keep evolving systems maintainable.</li>\n<li>You want to take responsibility and ownership for the software you produce. “You build it, you run it!” is our general philosophy.</li>\n<li>You have worked with Docker, AWS, NoSQL databases, serverless and microservices on a daily basis.</li>\n<li>You are opinionated and outspoken on engineering best practices, but can still maintain friends.</li>\n<li>You have proficient English skills and are able to communicate honestly and openly with your colleagues.</li>\n</ul>\n<p>The Business Development Tech Team</p>\n<ul>\n<li>Is responsible for automating and continuously improving the technical integration tools and systems used by our business and finance teams as well as hundreds of business partners.</li>\n<li>Codes primarily in Python (mostly for backend applications) and Javascript (for interactive UIs) and is committed to the quality and health of their codebase.</li>\n<li>Works in an agile and cross-functional environment alongside our sales and partner managers.</li>\n<li>Is excited about working in an environment where collaboration, continuous integration and delivery are as vital as morning coffee.</li>\n<li>Enjoys autonomous work as well as pair programming, code reviews and learning together.</li>\n</ul>\n<p>Why join Stylight?</p>\n<ul>\n<li>Stylight is #1 Meetup organizer in Munich, and deeply involved in the local tech community.</li>\n<li>Together with Bits &amp; Pretzels, we host daho.am, an annual developer conference with top-notch speakers and over 800 attendees.</li>\n<li>International &amp; highly motivated environment with open business culture in all departments. Our company language is English as we have more than 27 Nationalities.</li>\n<li>Hands-on work after quick ramp up &amp; openness to new solutions and improvements.</li>\n<li>Personal Development and constant growth is key. That's why at Stylight a personal development budget is given to you to use throughout the year for personal growth and regulatory Innovation Days which help to share our knowledge throughout the company.</li>\n<li>We are family-friendly and healthy minded which is why we are doing yoga together weekly, get our daily rate of fresh fruits from the counter and enjoy spending time with one another outside of working hours from BBQs to ping pong tournaments and Christmas tree decorating.</li>\n<li>We have one of the coolest office spaces in Munich (and actually in Germany) in the city-center, and just a 10-minute walk to the nearest Biergarten.</li>\n<li>Want to know more? Check out: about.stylight.com and blog.stylight.com // tech.stylight.com.</li>\n</ul>\n<p>Up for the challenge?</p>\n<p>If you want to work in a fun, exciting, challenging and dedicated environment, then don't hesitate and apply today via\nabout.stylight.com/jobs. We're looking forward to reading your complete application (cover letter, CV, references and certificates) in English or German! Your contact: Carina Meyer.</p>\n",
    "how_to_apply": "<p>Please apply via this link: <a href=\"https://stylight-jobs.personio.de/job/121687?_pc=6597#apply\">https://stylight-jobs.personio.de/job/121687?_pc=6597#apply</a></p>\n<p>or send an email to <a href=\"mailto:jobs@stylight.com\">jobs@stylight.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczUrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--85d1d4ff792e2365bcf8231011b21248b91f1148/Stylight.jpg"
  },
  {
    "id": "5f4f5319-8331-4fd7-b0b8-3f5694a9dcea",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/5f4f5319-8331-4fd7-b0b8-3f5694a9dcea",
    "created_at": "Thu Feb 13 13:34:10 UTC 2020",
    "company": "Stylight GmbH",
    "company_url": "https://www.stylight.com/",
    "location": "Munich, Germany",
    "title": "SEO Python Engineer (d/f/m)",
    "description": "<p>We are looking for a Python engineer to join our SEO team in Munich and drive organic user acquisition of Stylight’s 16 domains. As an Engineer, you will work closely with SEO, Marketing and Website teams to optimize web user acquisition, conversion, international expansion, dashboard automation and data pipelines. Are you interested in further optimizing and automating our workflows as well as delivering high-quality software? Then Stylight is your place to be.</p>\n<p>Your Key Responsibilities</p>\n<ul>\n<li>Build, maintain, and run our scalable architecture. We take pride in building highly performant and failure resistant platforms with a small team.</li>\n<li>Own services from design, development, and testing to continuous integration, monitoring, and support.</li>\n<li>Enjoy what you do, being ready to research and learn new technologies. Be prepared to challenge others.</li>\n<li>Develop applications in a TDD and DDD way with Clean Code Methods.</li>\n<li>Work cross-functionally across other product teams to develop solutions to improve page relevance/richness, internal linking, and indexation rules.</li>\n<li>Develop infrastructure and features to serve the most relevant and engaging search pages and content to Stylight users.</li>\n</ul>\n<p>What you bring along</p>\n<ul>\n<li>You love writing code from the bottom of your heart and have ideally 3+ years experience in designing, building and operating complex, scalable systems using Python.</li>\n<li>You are familiar with all domains of software engineering such as continuous delivery, test-driven engineering and running code in production.</li>\n<li>You have a proven track record of driving the user acquisition based on your analytical, problem-solving and engineering skills.</li>\n<li>You want to take responsibility and ownership of the software you produce. “You build it, you run it!” is our general philosophy.</li>\n<li>You have worked with Docker, AWS, NoSQL databases, serverless and microservices.</li>\n<li>You preferably have previous experience dealing with SEO and organic growth.</li>\n<li>You are opinionated and outspoken on engineering best practices but can still maintain friends.</li>\n<li>You have proficient English skills and are able to communicate honestly and openly with your colleagues.</li>\n</ul>\n<p>The SEO, Brand &amp; Content Marketing Team</p>\n<ul>\n<li>Is responsible for the visibility of Stylight to the outside world thru Content and SEO measures.</li>\n<li>Makes sure that our platforms are aligned with what people are looking for and follows trends and seasonal keywords.</li>\n<li>Works in an agile and cross-functional environment alongside Content, Push Marketing &amp; SEO Manager.</li>\n<li>Works in an international environment where collaboration, continuous integration and delivery are as vital as morning coffee.</li>\n<li>Enjoys autonomous work as well as pair programming, code reviews and learning together.</li>\n</ul>\n<p>Why join Stylight?</p>\n<ul>\n<li>Stylight is #1 Meetup organizer in Munich, and deeply involved in the local tech community.</li>\n<li>Together with Bits &amp; Pretzels, we host daho.am, an annual developer conference with top-notch speakers and over 800 attendees.</li>\n<li>International &amp; highly motivated environment with open business culture in all departments. Our company language is English as we have more than 27 Nationalities.</li>\n<li>Hands-on work after quick ramp up &amp; openness to new solutions and improvements.</li>\n<li>Personal Development and constant growth is key. That's why at Stylight a personal development budget is given to you to use throughout the year for personal growth and regulatory Innovation Days which help to share our knowledge throughout the company.</li>\n<li>We are family-friendly and healthy minded which is why we are doing yoga together weekly, get our daily rate of fresh fruits from the counter and enjoy spending time with one another outside of working hours from BBQs to ping pong tournaments and Christmas tree decorating.</li>\n<li>We have one of the coolest office spaces in Munich (and actually in Germany) in the city center, and just a 10-minute walk to the nearest Biergarten.</li>\n<li>Want to know more? Check out: about.stylight.com and tech.stylight.com.</li>\n</ul>\n<p>Up for the challenge?</p>\n<p>If you want to work in a fun, exciting, challenging and dedicated environment, then don't hesitate and apply today via about.stylight.com/jobs. We're looking forward to reading your complete application (cover letter, CV, references) in English or German! Your contact: Laura Grassl.</p>\n",
    "how_to_apply": "<p>Please apply via this link:</p>\n<p>or send an email to <a href=\"mailto:jobs@stylight.com\">jobs@stylight.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3grIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--140c14f1fb242b25e9be92a7ed0af068defff4ea/Stylight.jpg"
  },
  {
    "id": "e401dbd6-367a-405a-a759-5082b5ecd7f2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e401dbd6-367a-405a-a759-5082b5ecd7f2",
    "created_at": "Thu Feb 13 13:26:45 UTC 2020",
    "company": "Stylight GmbH",
    "company_url": "https://www.stylight.com/",
    "location": "Munich, Germany",
    "title": "Tech Lead (d/f/m)",
    "description": "<p>We are looking for a Tech Lead to join our team in Munich. You’re interested in further optimizing and automating the technical integration of our partner shops and delivering high quality software is your number one priority? Then Stylight is your place to be.</p>\n<p>Your Key Responsibilities</p>\n<ul>\n<li>Ensuring your team ships quality products and code in accordance with business needs.</li>\n<li>Build, maintain, and monitor our scalable architecture. We take pride in building highly performant and failure resistant platforms with a small team.</li>\n<li>Own services from design, development, and testing to continuous integration, monitoring, and support.</li>\n<li>Enjoy what you do, and be ready to research and learn new technologies.</li>\n<li>Explain technical topics to non-technical colleagues and advocate for your team across the company.</li>\n<li>Mentor, lead, and support a team of 3-5 engineers to foster technical excellence in the team. Bring your best practices, challenge the status quo, and set things in motion.</li>\n</ul>\n<p>Background Of Successful Applicants</p>\n<ul>\n<li>You bring hands-on experience in software development, ideally 5+ years and have experience in designing, building and operating complex, scalable systems.</li>\n<li>You have significant Python experience and are ready to share what you’ve learned with others.</li>\n<li>You want to take responsibility and ownership for the software you produce. “You build it, you run it!” is our general philosophy.</li>\n<li>You are opinionated and outspoken on engineering best practices, but can still maintain friends.</li>\n<li>You have solid experience with both relational and NoSQL databases.</li>\n<li>You have proficient English skills and are able to communicate honestly and openly with your colleagues.</li>\n<li>You’re excited to work in an environment where collaboration, continuous integration and delivery are as vital as morning coffee.</li>\n<li>Experience with Docker, AWS, and microservice architectures are a very nice plus.</li>\n</ul>\n<p>The Business Development Tech Team</p>\n<ul>\n<li>Is responsible for automating and continuously improving the technical integration tools and systems used by our business and finance teams as well as hundreds of business partners.</li>\n<li>Codes primarily in Python (mostly for backend applications) and Javascript (for interactive UIs) and is committed to the quality and health of their codebase.</li>\n<li>Works in an agile and cross-functional environment alongside our sales and partner managers.</li>\n<li>Enjoys autonomous work as well as pair programming, code reviews and learning together.</li>\n</ul>\n<p>Why join Stylight?</p>\n<ul>\n<li>Stylight is #1 Meetup organizer in Munich, and deeply involved in the local tech community.</li>\n<li>Together with Bits &amp; Pretzels, we host daho.am, an annual developer conference with top-notch speakers and 800 attendees.</li>\n<li>International &amp; highly motivated environment with open business culture in all departments. Our company language is English as we have more than 27 Nationalities.</li>\n<li>Hands-on work after quick ramp up &amp; openness to new solutions and improvements.</li>\n<li>Personal Development and constant growth is key. That's why at Stylight a personal development budget is given to you to use throughout the year for personal growth and regulatory Innovation Days which help to share our knowledge throughout the company.</li>\n<li>We are family-friendly and healthy minded which is why we are doing yoga together weekly, get our daily rate of fresh fruits from the counter and enjoy spending time with one another outside of working hours from BBQs to ping pong tournaments and Christmas tree decorating.</li>\n<li>We have one of the coolest office spaces in Munich (and actually in Germany) in the city-center, and just a 10-minute walk to the nearest Biergarten.</li>\n<li>Want to know more? Check out: about.stylight.com and blog.stylight.com // tech.stylight.com.</li>\n</ul>\n<p>Up for the challenge?</p>\n<p>If you want to work in a fun, exciting, challenging and dedicated environment, then don't hesitate and apply today via\nabout.stylight.com/jobs. We're looking forward to reading your complete application (Cover letter, CV, references and certificates) in English or German! Your contact: Carina Meyer.</p>\n",
    "how_to_apply": "<p>Please apply via this link:\n<a href=\"https://stylight-jobs.personio.de/job/103998?_pc=6597#apply\">https://stylight-jobs.personio.de/job/103998?_pc=6597#apply</a></p>\n<p>or send a mail to <a href=\"mailto:jobs@stylight.com\">jobs@stylight.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3ArIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--76bcca1e65fd75e1af1bcd39d488d0e438db8ffb/Stylight.jpg"
  },
  {
    "id": "e777c1df-4ec5-4a20-96a8-2555f916eeb0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e777c1df-4ec5-4a20-96a8-2555f916eeb0",
    "created_at": "Tue Feb 11 17:34:57 UTC 2020",
    "company": "Klewel, the webcasting company",
    "company_url": "http://www.klewel.com",
    "location": "Martigny, Switzerland",
    "title": "Full-Stack Web Developer",
    "description": "<p>Klewel is a company active in the world of webcasting, a multidisciplinary field at the confluence of multimedia, communication, web and events. Since 2007, our team has been committed to webcast presentations given at conferences and workshops. <strong>With 12 years of experience, our operational activities have taken us to more than 40 countries</strong>!</p>\n<p>Klewel has developed <strong>a specialized webcasting platform to highlight and index audiovisually captured presentations</strong> (conferences, keynotes, debates, training seminars, courses). Our philosophy? At the service of knowledge sharing and knowledge transfer.</p>\n<p>In order to continually improve our product, we are currently recruiting a <strong>Full-Stack Web Developer</strong>.</p>\n<p>We are looking for a person to lead the product development activities who has <strong>at least three years of experience in this role with a specialization in software architecture / back-end</strong>. You have a solid higher education in computer science (Master or Bachelor). You are curious about the latest trends and new technologies, you wish to join a company with a human scale. So the following may be your next job!</p>\n<p>You will participate in the evolution of the existing web portal and its maintenance. In order to scale up, you will shape our platform. Beyond the purely development aspects, you will also have to manage virtual machines and administer our instances on the AWS environment. <strong>You are particularly comfortable with virtualization of web services, cloud computing</strong> and you have participated in such projects as a developer / tester in the past.</p>\n<p>Does this speak to you?</p>\n<p>You have an analytical mind. You are attentive, organized and autonomous. You master the Python language or equivalent. <strong>You have experience with a web framework</strong> such as Django. You are comfortable with <strong>code management/versioning tools</strong> such as Git and you master <strong>asynchronous process management systems</strong> with tools like Celery.</p>\n<p>You appreciate having slots dedicated to self-training in order to keep abreast of new developments and continue to learn. We encourage participation in conferences specialized in web development. You like mountains. Do you recognize yourself? then <a href=\"https://podio.com/webforms/23997449/1740755\">apply</a> !!!</p>\n",
    "how_to_apply": "<p>Apply here: <a href=\"https://podio.com/webforms/23997449/1740755\">https://podio.com/webforms/23997449/1740755</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcHArIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--df114aab0279e605394373c05aca0891d25111bd/Klewel-noir.png"
  },
  {
    "id": "56f07275-3714-48d5-8267-0cdcbd1562e9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/56f07275-3714-48d5-8267-0cdcbd1562e9",
    "created_at": "Wed Feb 12 09:26:33 UTC 2020",
    "company": "CGM France",
    "company_url": "https://www.cgm.com/de/index.de.jsp",
    "location": "Nanterre",
    "title": "Lead Developer e-Santé",
    "description": "<h2><strong>En tant que Lead Developer e-Santé vous êtes acteur de la eSanté!</strong></h2>\n<p>Nous sommes des pionniers de la santé numérique et passionnés par le développement et l’implémentation de nouvelles technologies. Pour poursuivre notre croissance, nous recherchons des Collaborateurs engagés et dynamiques qui s’épanouiront au sein de nos équipes tout en poursuivant leur projet professionnel.</p>\n<h2><strong>Vous contribuerez à notre succès en:</strong></h2>\n<p>Au sein d'une équipe Scrum de taille humaine et à dimension internationale, vous êtes le team leader du pôle software qui développe notre logiciel HelloDoc, leader dans l’informatisation des cabinets médicaux.</p>\n<p>Vos missions :</p>\n<ul>\n<li>Encadrer l'équipe de développement</li>\n<li>Analyser les problèmes fonctionnels et techniques</li>\n<li>Gérer les priorités</li>\n<li>Superviser vos collègues dans la réalisation des projets, la mise en œuvre des actions correctives et des ajustements techniques</li>\n</ul>\n<h2><strong>Nous attendons de vous:</strong></h2>\n<p>De formation supérieure en informatique (Bac+5) ou école d'ingénieur, vous justifiez d'une expérience de 5 ans minimum sur un poste similaire avec une expérience confirmée dans un environnement SCRUM et dans le développement de logiciels.</p>\n<p>Vous avez un excellent relationnel ainsi qu’un leadership vous permettant d’inspirer votre équipe et de la faire progresser.</p>\n<p>Mais aussi :</p>\n<ul>\n<li>Connaissance de : C#.NET, C++, SQL, ASP.NET, Javascript, CSS, HTML</li>\n<li>Solides compétences techniques, analytiques et de développement</li>\n<li>Parfaite maîtrise des outils bureautiques classiques (Mail, Internet, Excel, Word, Visio …)</li>\n<li>Français et Anglais courant (oral et écrit)</li>\n</ul>\n<h2><strong>Nous vous offrons:</strong></h2>\n<ul>\n<li>Votre environnement de travail est agréable, moderne et dynamique</li>\n<li>Vous rejoignez un groupe international de 5000 personnes, avec de réelles opportunités de carrière en France et à l’étranger</li>\n<li>Vous participez au futur de la e-santé, en rejoignant un acteur majeur de ce secteur</li>\n</ul>\n<p>Nous sommes impatients de recevoir votre candidature ainsi que vos prétentions salariales.</p>\n<p><a href=\"https://compugroupmedical.redirect.your-jobresponse.com/lead_developer_e_sante_nanterre/263681/V819/apply\">Cliquez ici pour accéder au formulaire de candidature!</a></p>\n<p><strong>Synchronizing Healthcare</strong>\n<strong>Rejoignez-nous!</strong></p>\n<p><strong>Référence:</strong>\nreq3343</p>\n<p><strong>Lieu:</strong>\nSoulac-sur-Mer</p>\n<p><strong>Domaine:</strong>\nSoftware Development</p>\n<p><strong>Contact:</strong></p>\n<p><a href=\"mailto:career@cgm.com\">career@cgm.com</a></p>\n<p>T +33 (0) 147 162 679</p>\n<ul>\n<li>Groupe international leader dans la eSanté</li>\n<li>Plus de 717 Million d’Euros de CA en 2018</li>\n<li>Environ 5 000 employés dans le monde</li>\n<li>Une base Client unique de plus de 1 million d’Utilisateurs</li>\n<li>Nos équipes sont présentes dans 19 pays et ont des Clients dans 55 pays</li>\n<li>Plus de 30 d’expérience</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://compugroupmedical.redirect.your-jobresponse.com/lead_developer_e_sante_nanterre/263681/V819/apply\">Cliquez ici pour accéder au formulaire de candidature!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1orIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ade1522a8a04fce67218fb593a79385dcc4a72e7/Compugroup%20logo.jpeg"
  },
  {
    "id": "60d06501-244b-4e0d-9dd8-0caa71685111",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/60d06501-244b-4e0d-9dd8-0caa71685111",
    "created_at": "Mon Feb 10 19:55:03 UTC 2020",
    "company": "Kite",
    "company_url": "http://kite.com",
    "location": "San Francisco",
    "title": "Software Engineer, Developer Tools",
    "description": "<p><em>“I really love the line-of-code completions in the new kite.com.” — Guido van Rossum, creator of Python</em></p>\n<p>Programmers spend too much time doing repetitive work — copying and pasting from StackOverflow, fixing simple errors, and writing boilerplate code. We're building an AI code engine that does this work for you. Programming using Kite is faster and more fun.</p>\n<p>Kite is well-funded by top investors in Silicon Valley, including the founders of PayPal, Stripe, Palantir, and Dropbox to name a few. We are looking to expand our 15-person startup with talented individuals who are interested in joining an early stage startup. The ideal candidate is excited to help guide the direction of our product and company. They will have a significant amount of ownership of critical technical components. Our team is growing rapidly and we hope you'll grow with us too!</p>\n<p><strong>What you’ll do:</strong></p>\n<ul>\n<li>Wear many hats, work with multiple components in different parts of the stack</li>\n<li>Define, develop and perform performance/scalability benchmarks for the Kite app</li>\n<li>Utilize various profiling tools to identify performance and concurrency bottleneck, propose and implement optimizations to improve the Kite product</li>\n<li>Contribute to the development of core product features and initiatives</li>\n<li>Collaborate with the product team on improving the user experience of the Copilot, website and editor plugins</li>\n</ul>\n<p><strong>What you’ve done:</strong></p>\n<ul>\n<li>A track record of working in small teams to build new software from scratch</li>\n<li>Experience building complex software outside of frameworks or existing infrastructure</li>\n<li>Ability to learn and evaluate new technologies quickly</li>\n<li>Experience taking ownership of projects and delivering results</li>\n<li>Experience with backend and/or frontend technologies (e.g Go/Java/C++, Javascript/Nodejs/React)</li>\n<li>Worked with multiple platforms (Windows, Linux, macOS)</li>\n<li>Nice to have: Experience with Go, native client software, and/or DevOps</li>\n</ul>\n<p><strong>Who you are:</strong></p>\n<ul>\n<li>Bachelor’s Degree in Computer Science or related field</li>\n<li>Minimum of 3+ years of engineering experience</li>\n<li>Experience building reliable and scalable systems</li>\n<li>Ability to work daily from our San Francisco office (wonderful office in the bustling Financial District area)</li>\n<li>Excited to work on a small, growing team in a startup environment</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/kite\">Apply Here</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3grIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0b893cf00d6c1a5c5f93ef77a357a9492665d804/%2311182F%20-%20dark%20navy%202x%20Twitter%20Logo.png"
  },
  {
    "id": "021c7fb9-b054-478b-9df7-08aff55a80fa",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/021c7fb9-b054-478b-9df7-08aff55a80fa",
    "created_at": "Mon Feb 10 15:57:44 UTC 2020",
    "company": "Matrix42",
    "company_url": "https://www.matrix42.com/de/",
    "location": "Frankfurt am Main",
    "title": "Software Developer C# (m/w/d)",
    "description": "<p>Matrix42 ist einer der Top-Anbieter von Software für das Arbeitsplatzmanagement. Unter dem Motto „Smarter Workspace“ bietet das Unternehmen zukunftsorientierte Lösungen für moderne Arbeitsumgebungen. Mehr als 3.000 Kunden – darunter BMW, Infineon und Carl Zeiss – verwalten mit den Workspace Management Lösungen von Matrix42 über 3 Millionen Arbeitsplätze weltweit.</p>\n<p>Matrix42 ist in sieben Ländern erfolgreich aktiv – Deutschland, Österreich, Schweiz, Niederlande, Vereinigtes Königreich, Australien und Vereinigte Staaten von Amerika. Der Hauptsitz des Unternehmens befindet sich in Frankfurt am Main, Deutschland.</p>\n<p><strong>Software Developer C# (m/w/d)</strong></p>\n<h2>DEIN JOB BEI UNS</h2>\n<p>In der Abteilung Research &amp; Development (R&amp;D) arbeitest du in einem Team mit etwa 5 Mitgliedern nach SCRUM. Konkret geht es bei dieser Stelle um die Entwicklung unseres Produkts „Unified Endpoint Management Console“, das ein gemeinsames Management von klassischen PCs und Smartphones über eine einheitliche Benutzeroberfläche ermöglicht. Das Team arbeitet eng mit dem Product Owner an der Definition und Umsetzung neuer Features zusammen. Du übernimmst Verantwortung für einzelne Komponenten unserer Software und passt individuell bestehende Anwendungen an. Neben Software-Entwicklung bist du an allen Aufgaben beteiligt, die ein SCRUM Team abdeckt um ein lieferbares Produkt zu erstellen.</p>\n<h2>DAS BIST DU</h2>\n<ul>\n<li>Du hast ein erfolgreich abgeschlossenes Studium der (Wirtschafts-) Informatik oder eine vergleichbare Qualifikation und hast bereits Berufserfahrungen in der Softwareentwicklung gesammelt</li>\n<li>Sehr gute Kenntnisse in .NET und C#</li>\n<li>Gute Kenntnisse in der Web-Entwicklung (HTML, CSS, JS, AJAX, AngularJS ASP.NET MVC &amp; Web API, WCF)</li>\n<li>Gute Datenbank-Kenntnisse (MSSQL und Entity Framework)</li>\n<li>Analytisches und lösungsorientiertes Denken</li>\n<li>Spaß und Engagement bei der gemeinsamen Entwicklung und Umsetzung von neuen Ideen</li>\n<li>Ausgeprägter Teamgeist und hohe Kommunikationsfähigkeit auf Deutsch und Englisch</li>\n</ul>\n<h2>DAS GIBT'S BEI UNS</h2>\n<ul>\n<li>Flache Hierarchien, kurze und offene Entscheidungswege</li>\n<li>Moderne Technologien</li>\n<li>Wir optimieren unseren Motor kontinuierlich in Improvement Cycles</li>\n<li>Arbeite losgelöst vom Tagesgeschäft in Exploration Days an spannenden Themen die du wichtig findest</li>\n<li>Flexible Arbeitszeiten: Komm und geh wann du willst!</li>\n<li>Weiterbildung in deinem Alltag, z.B. in einer Community of Practice oder auf Konferenzen</li>\n<li>Immer auf dem neuesten Stand – jedes Team hat ein Weiterbildungsbudget</li>\n<li>Entfaltung deiner Kreativität, u.a. in der Hack Week</li>\n<li>Weitere spannende Firmenevents, wie unsere Kick-Off Woche, GetTogether, Sommerfest, Christmas Party etc.</li>\n<li>Um den Kopf frei zu bekommen, geh’ doch eine Runde Kickern, in unser Kino oder zock eine Runde auf der PS4 oder Wii U</li>\n</ul>\n<h2>Haben wir Dein Interesse geweckt?</h2>\n<p>Dann würden wir Dich gerne kennen lernen und freuen uns auf Deine aussagekräftige Onlinebewerbung unter Angabe Deiner Gehaltsvorstellung sowie Deines frühestmöglichen Eintrittstermins über das <strong>Bewerbungsformular</strong> an Thomas Gruber.</p>\n<p><a href=\"https://matrix42.redirect.your-jobresponse.com/software_developer_c_m_w_d_frankfurt_am_main/263533/V819/apply\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://matrix42.redirect.your-jobresponse.com/software_developer_c_m_w_d_frankfurt_am_main/263533/V819/apply\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajkrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b180bcaaf8e89f33a57a3b189316b8c83d41a965/matrix%2042%C2%A0ag.jpg"
  },
  {
    "id": "31dc583c-de1a-4b76-8fd3-d3f3b5ade941",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/31dc583c-de1a-4b76-8fd3-d3f3b5ade941",
    "created_at": "Mon Feb 10 12:28:16 UTC 2020",
    "company": "InnoGames GmbH",
    "company_url": "http:",
    "location": "Hamburg",
    "title": "(Senior) Java Developer",
    "description": "<p>As a <strong>(Senior) Java Developer</strong>, you will play a key role in the technical infrastructure team of our Corporate Systems department. You will be part of a passionate and experienced agile engineering team with the mission to advance the development of our next-generation marketing tools by contributing with your knowledge of software architecture.</p>\n<p><strong>Your mission:</strong></p>\n<ul>\n<li>You will be part of a diverse engineering team developing our Marketing platforms, you will work closely with our marketing department to shape and design various marketing tools and your work results will help us to use the social media budget more efficiently</li>\n<li>You will work in an agile environment with several cross-functional Kanban teams consisting of Backend-, Frontend- and Quality Assistance Engineers</li>\n<li>As part of our Corporate Systems department, you will help to maintain and further develop our high-performance culture in a cheerful and cooperative work environment, where achievements are recognized, regular knowledge sharing is encouraged, and fun is valued</li>\n</ul>\n<p><strong>Your profile:</strong></p>\n<ul>\n<li>You have gained several years of professional experience in Software Development and you prefer to influence your team results as a Full Stack Developer participating not exclusively on the backend, but also on the frontend</li>\n<li>You are driven to take on a high level of responsibility and you are able to make good decisions based on an excellent understanding of business requirements</li>\n<li>Your excellent English language skills are the foundation of your well-versed communication skills</li>\n<li>You are willing to embrace our company culture as well as our company values</li>\n<li>As an additional advantage, your presentation skills are outstanding, and you like to give talks at one of our various internal knowledge sharing events</li>\n<li>Ideally, you have graduated in Computer Sciences, Business Information Systems or you have learnt about theoretical basics based on other relevant experiences</li>\n</ul>\n<p><strong>What we offer to all employees:</strong></p>\n<ul>\n<li>You’ll work in a multicultural agile team – enabling you and your team to form and actively optimize work processes</li>\n<li>We actively support personal development, pay for any necessary textbooks as well as sending you to Developer conferences</li>\n<li>You can set up your workspace as you wish: Mac, Linux or Windows, two or more monitors, a free choice of IDE as well as other software</li>\n<li>We provide you with a mobile device (e.g. iPhone or iPad) for private use</li>\n<li>You can take creative breaks: play table tennis with your team, play on our arcade machines, work out in our gym or simply go to our roof terrace to get some fresh air</li>\n<li>We contribute to your public transport ticket and subsidize contributions to the company pension plan</li>\n<li>We offer free drinks and fresh fruit to contribute to your health and wellbeing</li>\n<li>We have regular team events (e.g. curling, cooking, paintball), barbecue together on our rooftop terrace and a company-organized after work get together every Thursday</li>\n<li>We offer trust-based working times in a modern office in the center of Hamburg</li>\n<li>Our company language is English, and we support all our employees and their partners with optional German lessons</li>\n<li>We help you relocate to Hamburg</li>\n<li>We have fun at work!</li>\n</ul>\n<p>Are you excited to start your journey with InnoGames and join our dynamic team as a <strong>(Senior) Java Developer</strong>? We look forward to receiving your application (cover letter &amp; CV) as well as your salary expectations and earliest possible start date through our <a href=\"https://www.innogames.com/career/detail/job/-senior-java-developer/?s=GitHub\">online application form</a>. <strong>Maximilian Kaeding</strong> would be happy to answer any questions you may have.</p>\n<p>InnoGames is Germany’s leading developer and publisher of mobile and online games. The company based in Hamburg is best known for Forge of Empires, Elvenar and Tribal Wars. InnoGames’ first mobile title Warlords of Aternum is a fantasy turn-based strategy game. InnoGames’ complete portfolio encompasses seven live games and several mobile titles in production.</p>\n<p>Born as a hobby, InnoGames today has a team of 400 employees from more than 30 nations who share the passion of creating unique games that players across the globe enjoy for years. In order to further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.</p>\n",
    "how_to_apply": "<p><a href=\"https://www.innogames.com/career/detail/job/-senior-java-developer/?s=GitHub\">https://www.innogames.com/career/detail/job/-senior-java-developer/?s=GitHub</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWwrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0e8f685c920447840120150fc5a0ea022ecdabb3/logo_innogames_devlop.png"
  },
  {
    "id": "29788172-8665-4b80-acb8-6f2251080f09",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/29788172-8665-4b80-acb8-6f2251080f09",
    "created_at": "Fri Feb 07 21:00:52 UTC 2020",
    "company": "Combinaut",
    "company_url": "http://www.combinaut.com",
    "location": "Chicago",
    "title": "Experienced JavaScript Front End Developer",
    "description": "<p><strong>Combinaut is seeking an experienced JavaScript Front End Developer.</strong></p>\n<p>Combinaut has an immediate need for a developer who has a minimum of  5 years’ professional experience working in JavaScript as a front end developer. We are looking for someone who will be able to work with near autonomy toward agreed goals, with the occasional need for material direction or implementation changes. Ideal candidates will have experience following established patterns and approaches within existing code bases with ease. We are looking for candidates experienced with Backbone.js, Git, and who have a strong understanding of system design. Preference will be given to candidates with Ruby on Rails experience.</p>\n<p>Our ideal candidate has a team-first mindset, collaborating with our internal and client-side stakeholders to solve problems, design new features, and deliver solid technical solutions.</p>\n<p><strong>Combinaut - What we Make</strong></p>\n<p>Combinaut creates tools for healthcare providers to help patients find care. It is important work, and we believe in what we do. We are seeking a full-time Chicago-based staff developer to join our Chicago and remote team.</p>\n<p><strong>Working With Combinaut</strong></p>\n<p>We are a very lean crew, with six developers and a handful of support positions. Our developers must work well both independently and collaboratively, each team member is responsible for building and maintaining our end-to-end software stack. We’re a self-organizing team that moves quickly together and contributes across the stack as needed (regardless of specialized knowledge or experience). Every team member is expected to be able to communicate with clarity and professionalism with internal team members as well as with clients.</p>\n<p>Combinaut believes diversity and inclusion make the workplace better and our product stronger. Every applicant for this position will be considered.</p>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:alex@combinaut.com\">alex@combinaut.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWQrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2aaf439634752d2c5c7e9fa53ca836ec879e1971/facebook-159006e81262e7ebefea7b9b1138c7f7.jpg"
  },
  {
    "id": "18e5a4c7-77ea-4e91-bbeb-55ba4b0713f6",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/18e5a4c7-77ea-4e91-bbeb-55ba4b0713f6",
    "created_at": "Fri Feb 07 18:56:45 UTC 2020",
    "company": "Bromelkamp Company",
    "company_url": "http://www.bromelkamp.com",
    "location": "Remote",
    "title": "Dynamics CRM 365 Developer",
    "description": "<p>Job Definition:\nProgramming and Product Development (90%):</p>\n<ul>\n<li>Akoya.net (Microsoft Dynamics CRM 365) integration as directed - largely C#, JavaScript, and web services work</li>\n<li>Dynamics 365 Business Central integration as directed</li>\n<li>Support our products (FundWeb.net, eGrant.net, eGrant.net Reviewer, and eGrant.net Moderator) with user-interface improvements, functional modifications, and new supplemental features</li>\n<li>Carry out other web service development-related projects as directed, such as API, software bridges, etc.</li>\n<li>Serve as second line of support for server administration and maintenance</li>\n<li>Write documentation of server administration procedures</li>\n<li>Serve as second line of support for escalated technical support issues (programming, bug fixes, advanced troubleshooting)</li>\n</ul>\n<p>Administrative (10%):</p>\n<ul>\n<li>Administrative duties (prioritization, scheduling, team meetings, quarterly staff meetings, etc.)</li>\n</ul>\n<p>Qualifications</p>\n<ul>\n<li>2-3 years’ experience in a Microsoft Dynamics Environment with an emphasis on PowerPlatform skills –PowerApps, Power Automate, and especially PowerBI</li>\n<li>Strong preference for experience in LogicApps</li>\n<li>Must have experience with C# and the Microsoft stack, web services, and Business Central accounting.</li>\n<li>An understanding of MS Windows and MS Office is required</li>\n<li>The ideal candidate will thrive in a fast-paced environment, manage multiple projects and possess excellent communication skills both oral and written</li>\n</ul>\n<p>Compensation\nBromelkamp Company is a model employer with great benefits, excellent flexibility, and a commitment to work/life balance. A total compensation (salary + benefits) package will be determined based on experience. Salary range from $81,000-$101,000. Benefits include health insurance for employee and dependents, health savings account, fifteen days accrued PTO, nine paid holidays, life, short-term and long-term disability insurance, childcare reimbursement, a bonus plan, and a retirement plan.</p>\n<p>Bromelkamp Company is based in Minneapolis, MN. Our preference is for this candidate to be in proximity to our offices; however, we welcome highly qualified candidates who desire to work remotely.</p>\n",
    "how_to_apply": "<p>Please send your resume and cover letter outlining both your relevant experience and the reasons for your interest in this position to Shanlee Bratten, Office Manager, at <a href=\"mailto:shanlee@bromelkamp.com\">shanlee@bromelkamp.com</a>. Resumes without cover letters will not be considered.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVYrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d975f4332a498daf618f463a56d8c10180a4228a/Brom.logo.large.jpg"
  },
  {
    "id": "ea0cf9bc-a836-439b-9a8b-ca3c8381f59a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ea0cf9bc-a836-439b-9a8b-ca3c8381f59a",
    "created_at": "Fri Feb 07 14:37:09 UTC 2020",
    "company": "Aareon Deutschland GmbH",
    "company_url": "http://aareon.de/karriere",
    "location": "Mainz oder Hamburg",
    "title": "SAP® Entwickler/Developer (m/w/d)",
    "description": "<p><strong>Mainz oder Hamburg</strong></p>\n<p><strong>Referenzcode: DE-182/2019</strong></p>\n<p>Sie wollen abwechslungsreiche Projekte betreuen und unsere Kunden auf ihrem innovativen Weg Richtung Digitalisierung begleiten? Dann starten Sie durch beim deutschen Marktführer für immobilienwirtschaftliche Software und gestalten die Digitalisierung einer ganzen Branche mit! Für unseren Bereich SAP® und Blue Eagle Competence Center &amp; Consulting suchen wir zum nächstmöglichen Zeitpunkt einen SAP® Entwickler/Developer (m/w/d).</p>\n<h2>Das erwartet Sie:</h2>\n<ul>\n<li>Beratung, Konzeption und Implementierung von ABAP-Entwicklungsaufträgen im Bereich der Wohnungswirtschaft</li>\n<li>Durchführung von Anforderungsanalysen und Umsetzung innovativer Lösungen bei unseren Kunden</li>\n<li>Pflege und Weiterentwicklung von bestehenden Entwicklungslösungen in einer komplexen Systemlandschaft</li>\n<li>Ausarbeitung und Entwicklung von SAP®-Schnittstellen</li>\n<li>Enge Zusammenarbeit mit dem Consulting und Support auf allen Ebenen (1st, 2nd, 3rd Level)</li>\n</ul>\n<h2>Das erwarten wir:</h2>\n<ul>\n<li>Abgeschlossenes Studium im Bereich (Wirtschafts-)Informatik, eines verwandten Studiengangs oder eine abgeschlossene IT-Ausbildung, z. B. als Fachinformatiker (m/w/d) Anwendungsentwicklung</li>\n<li>Mehrjährige Berufserfahrung in der Anwendungsentwicklung im SAP®-Umfeld</li>\n<li>Fundierte Kenntnisse in der ABAP-Entwicklung (ABAP, ABAP-OO)</li>\n<li>Kenntnisse in einem der SAP-Module RE-FX/PM/MM/FI-CO sowie Erfahrung mit Smart Forms sind von Vorteil.</li>\n<li>Hohe IT-Affinität und Spaß an innovativen Lösungen</li>\n<li>Kenntnisse im Bereich SAP®-HANA oder S4/HANA sind von Vorteil.</li>\n<li>Hohes Maß an Engagement und Lernbereitschaft sowie Freude an eigenverantwortlichem Arbeiten</li>\n<li>Fließende Deutsch und sichere Englischkenntnisse in Wort und Schrift runden Ihr Profil ab.</li>\n</ul>\n<h2>Das bieten wir Ihnen:</h2>\n<ul>\n<li>Einen Arbeitsplatz in einem modernen Unternehmen im Wachstumssegment IT-Lösungen</li>\n<li>Eine verantwortungsvolle und spannende Tätigkeit mit täglich neuen Herausforderungen</li>\n<li>Freiraum und Flexibilität bei der persönlichen Arbeitszeitgestaltung und die Möglichkeit zum mobilen Arbeiten mit modernen Betriebsmitteln</li>\n<li>Teamgeist und eine offene Kommunikation in einer dynamischen internationalen Community</li>\n<li>Attraktive Sozialleistungen (30 Tage Jahresurlaub, dienstfrei an Heiligabend, Silvester und Rosenmontag sowie vermögenswirksame Leistungen etc.)</li>\n<li>Diverse Zusatzleistungen, wie ein gelebtes Gesundheitsmanagement, umfassende individuelle Weiterbildungsmöglichkeiten sowie Fahrradleasing</li>\n</ul>\n<h2>Neugierig? Wir auch!</h2>\n<p>Bewerben Sie sich gleich online über das <strong>Bewerbungsformular</strong> oder unsere Homepage aareon.de/karriere und senden Sie Ihre aussagekräftigen Bewerbungsunterlagen, unter Angabe Ihrer Gehaltsvorstellung und Ihres nächstmöglichen Eintrittstermins, an Stephanie Hühner. Telefonisch steht sie Ihnen unter der Rufnummer +49 (0) 6131 / 301-264 gerne zur Verfügung.</p>\n<p><a href=\"https://aareon.redirect.your-jobresponse.com/sap_entwickler_developer_m_w_d_mainz/263297/V819/anwenden\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://aareon.redirect.your-jobresponse.com/sap_entwickler_developer_m_w_d_mainz/263297/V819/anwenden\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUIrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--602056cf8b25312883fb0ab5261e8e09dd41cdfd/aareon.jpg"
  },
  {
    "id": "eca087e9-3f8e-4202-9371-991630f3397d",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/eca087e9-3f8e-4202-9371-991630f3397d",
    "created_at": "Fri Feb 07 04:10:11 UTC 2020",
    "company": "Combinaut",
    "company_url": "http://www.combinaut.com",
    "location": "Chicago or Remote",
    "title": "EXPERIENCED TWILIO JS DEVELOPER",
    "description": "<p><strong>Combinaut is seeking an experienced Twilio JS Developer</strong></p>\n<p>Combinaut has an immediate need for a developer who has experience working with the Twilio Programmable Voice APIs and working with Twilio JS functions. You will be responsible for the development of a new version of our in-browser call center. We are looking for candidates who have built or who have helped to build at least one major application using these APIs. Preference will be given to candidates with Ruby on Rails experience.</p>\n<p>Our team is based in Chicago with some remote members. We're seeking a full-time Chicago-based or remote staff developer for the current position.</p>\n<p><strong>Combinaut - What we Make</strong></p>\n<p>Combinaut creates tools for healthcare providers to help patients find care. It is important work, and we believe in what we do.</p>\n<p><strong>Working With Combinaut</strong>'</p>\n<p>We are a very lean crew, with six developers and a handful of support positions. Our developers must work well both independently and collaboratively. Our developers are responsible for building and maintaining our end-to-end software stack. We’re a self-organizing team that moves quickly together and contributes across the stack as needed (regardless of specialized knowledge or experience). Every team member is expected to be able to communicate with clarity and professionalism with internal team members as well as with clients.</p>\n<p>Combinaut believes diversity and inclusion make the workplace better and our product stronger. Every applicant for this position will be considered.</p>\n",
    "how_to_apply": "<p>email your resume to <a href=\"mailto:alex@combinaut.com\">alex@combinaut.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaE4rIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ffc6f85973a54be8b77e7211a29aa1f3b55a83ef/facebook-159006e81262e7ebefea7b9b1138c7f7.jpg"
  },
  {
    "id": "9847705a-14d3-475a-9c7b-1624a5cd84f8",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/9847705a-14d3-475a-9c7b-1624a5cd84f8",
    "created_at": "Thu Feb 06 18:51:56 UTC 2020",
    "company": "Tynker",
    "company_url": "http://www.tynker.com",
    "location": "Mountain View",
    "title": "Front-End Web Developer",
    "description": "<p>We are looking for a full-stack developer who has a strong command of web development including Angular, CSS3, HTML5, Javascript, cross-browser development techniques and has a passion for building pixel-perfect, clean and elegant code. You will work with a team of developers building tools and frameworks used by millions of K-12 students to learn to code. While frameworks are great, you should have no problems building your own or hacking existing ones.</p>\n<p>Tynker is the #1 Kids Coding platform and helps millions of students learn coding. Our self-paced courses and creativity tools guide them from block coding to JavaScript, Swift and and Python. Tynker’s mission is to provide every child with solid foundations in STEM, programming and critical thinking skills to prepare them to become better architects of their future world. Join a dynamic team of developers to come up with new and stimulating ways to engage young coders to get creative with code!</p>\n<p>Primary Tasks:</p>\n<ul>\n<li>Create awesome web experiences for young coders</li>\n<li>Transform design comps made by creative leads to functional web applications</li>\n<li>Create scalable cloud backend software that handles millions of users</li>\n<li>Iterate and improve experiences periodically based on feedback</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>BS/MS degree in Computer Science</li>\n<li>5+ years of professional experience building and maintaining large sites (50+ pages)</li>\n<li>Full grasp of HTML, CSS, JavaScript, and AJAX-based JSON/XML web services</li>\n<li>Should be proficient using frameworks like Angular, React, Foundation or Bootstrap</li>\n<li>Must be comfortable with using PHP, Mongo, and other back-end technologies</li>\n<li>Ability to debug cross-browser/cross-domain issues</li>\n<li>Solid foundation creating cross-browser and responsive web experiences and understand the nuances of supporting tablet and mobile browsers</li>\n<li>Must be able to quickly adapt and learn to work within an unfamiliar codebase</li>\n<li>Must be familiar with various design and architectural patterns</li>\n<li>Demonstrated ability to be self-driven and work with minimal supervision</li>\n<li>Experience creating APIs and RESTful web services is preferred</li>\n<li>Strong object oriented fundamentals with prior experience in Java or C++ is a plus</li>\n</ul>\n",
    "how_to_apply": "<p>Email your resume and cover letter to <a href=\"mailto:jobs@tynker.com\">jobs@tynker.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3ArIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d3a83fbb4d89ef700a492ec3a4965e36fc099ea1/tynker-200x200.png"
  },
  {
    "id": "a43db6ed-c5a2-4866-9f32-16b99fb50204",
    "type": "Part Time",
    "url": "https://jobs.github.com/positions/a43db6ed-c5a2-4866-9f32-16b99fb50204",
    "created_at": "Thu Feb 06 18:19:51 UTC 2020",
    "company": "Pasion",
    "company_url": "http:",
    "location": "Remote",
    "title": "Senior Full stack Developer to take Lead on Web app",
    "description": "<ul>\n<li>Location: 100% Remote (the team is based in Uruguay, Argentina and Colombia)</li>\n<li>Start date: ASAP</li>\n<li>Hours: 20 to 30 hours a week, according to your expertise and availability.</li>\n<li>Salary: Appropriate to the level of experience. Negotiable to your expectations.</li>\n</ul>\n<h2>Our company</h2>\n<p>We are a small company—9 people—who focuses on providing online solutions for sex workers. We strive to give them platforms and tools to help them stay independent so they can reach their goals much sooner (and hopefully retire, if that’s their wish).</p>\n<p>Our web app (LAMP) is working on 2 countries serving 1.400 customers and 600.000 visitors. We are working on enlarging the team to open 4 more countries by 2020 first quarter.</p>\n<p>The company is self-funded, we have been in the market for five years now and we’ve been profitable all the way. This is the result of passion for web development and care for our customers.</p>\n<h2>Project</h2>\n<p>The project consists mainly on a custom made (PHP/JS) social network, using WordPress as the core for content management. Customers are able to create and manage accounts like they would on a site like Instagram.</p>\n<p>Plus a few other extra functionalities, not only for customers but for customer service and admins as well.</p>\n<h3>Scope</h3>\n<p>While there are a lot of front end needs, most of the work will happen on the back end and private administrative sections.</p>\n<p>The system is broken down into 18 modules, each as its own WordPress plugin.</p>\n<p>We also rely on third party plugins for things such as image optimization, load speed and performance, cronjob handling, and the likes.</p>\n<p>Our own theme handles mostly page templates and CSS.</p>\n<p>The system is highly configurable and ready to be installed on different countries with different use cases.</p>\n<p>We also have integrations with third parties for SMS notifications, and payment processing.</p>\n<h3>Developer Job Responsibilities</h3>\n<p>You will be taking the lead developer role in our company to replace our founder (me).</p>\n<p>Besides keeping and eye over everything you’ll be improving existing features as well as creating new ones from start to finish.</p>\n<p>You’ll also be helping us professionalizing things. The code is not the best, some things are rushed or patched. There isn’t any documentation explaining how the system works or which function does what. With time this may even result in re-designing and re-writing big chunks of code.</p>\n<p>Expect to be spending some time learning how things work (of course you will have guidance along the way).</p>\n<p>When the work load deserves it, we can talk about hiring junior devs to work with you.</p>\n<h3>Developer Job Duties</h3>\n<ul>\n<li>The position requires constant communication with colleagues.</li>\n<li>Expertise and hands on experience with software development is needed to be successful in this position</li>\n<li>Must be willing to learn LAMP and WordPress.</li>\n<li>Strong grasp of CSS3.</li>\n<li>Regular exposure to company management, as well as the authority and scope to apply your expertise to many interesting technical problems.</li>\n</ul>\n<h2>Your application</h2>\n<p>This is one of the most important roles in our company. If you’re ready to handle the responsibility and you’re passionate about building platforms for people to use, we’re waiting for you!</p>\n<h3>Summary or cover letter</h3>\n<p>Please lead with a couple sentences introducing yourself.</p>\n<p>Explain why you want the role, why are you applying for it?</p>\n<p>Go through each requirement and explain how you meet the requirement.</p>\n<h3>Please don’t list every technology you have ever come across, instead list the specific skills that apply to this job</h3>\n<p>The technologies you have used should be incorporated into the summary and career history as long as it’s relevant.</p>\n<h3>Github, Bitbucket and StackOverflow accounts</h3>\n<p>If you have a Github/Bitbucket/Stackoverflow account then please list it. If you contribute to open source projects, please add them. If you have an online presence that in any way supports the role you are applying for, please make sure it’s listed.</p>\n<h3>App store links or Websites you have worked on</h3>\n<p>If you have worked on mobile apps and they are any the app store, make sure you include the links to them. If you have worked on websites, include the URL’s. Don’t just include the links, add the specifics of exactly what you did on each project as described below.</p>\n<h3>Specific development work you actually did</h3>\n<p>Details matter. Let us know about the development work you actually did during each particular project or role.</p>\n<ul>\n<li>What were you responsible for?</li>\n<li>What technologies did you use and for what purpose?</li>\n<li>Where you part of a team? Did you lead the team?</li>\n<li>What did you learn most from the role?</li>\n</ul>\n<h3>Section for personal interests</h3>\n<p>Listing your interests outside of work helps to flesh you out as a real person.</p>\n<p>We are also looking for someone who will enjoy working with us and enjoy taking the platform world wide.</p>\n<p>There’s hundreds of thousands of sex workers out there that deserve the chance to manage their job (and their money!) on their own terms, and not what someone else dictates for them. Let’s help them out : )</p>\n",
    "how_to_apply": "<p>Email your cover letter and resume to <a href=\"mailto:infopasionuruguay@gmail.com\">infopasionuruguay@gmail.com</a></p>\n",
    "company_logo": null
  },
  {
    "id": "c63a0710-739e-40a1-b644-5e00b6c53898",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c63a0710-739e-40a1-b644-5e00b6c53898",
    "created_at": "Thu Feb 06 16:13:36 UTC 2020",
    "company": "Wordwall",
    "company_url": "http://wordwall.net",
    "location": "United Kingdom",
    "title": "Software developer (games and front-end) - remote working - full or part time",
    "description": "<p>Salary: £32-40k (depending on experience)</p>\n<p>Location: UK (remote working)</p>\n<p>Duration: Permanent</p>\n<p>We are looking to recruit a software developer with excellent visual design skills to join us on a full-time or a part-time basis.</p>\n<p>Wordwall.net makes it easy for teachers to create interactive games and printed worksheets for their students. It automates the process of resource design, so teachers can simply enter the content that is appropriate for their class – a list of keywords, definitions, questions or images. Wordwall produces the content in over 60 different templates; for example, gameshow quizzes, crosswords, labelled diagrams and arcade games. It seeks to disrupt the publisher-driven model of paid-for “professionally” made educational content, by putting high-quality content creation in the hands of teachers and making that teacher-made content, freely accessible through our online community.</p>\n<p>We are a small company and we all work remotely. Our user base has increased 15 percent month-on-month over the past three years, with low churn and we’re already in profit. We’ve got a product that works and we’re building for the long-term. We want people who want to stick around, grow with us and help make games-based learning accessible to all.</p>\n<p>Job requirements:</p>\n<ul>\n<li>at least 3 years experience in a front-end or games development role</li>\n<li>excellent design skills</li>\n<li>ability to implement designs using XML layouts with code-behind</li>\n<li>confidence in manipulating graphics and other media files</li>\n<li>ability to collaborate with illustrators and sound designers</li>\n<li>ability to plan and organise work, ask for help and exercise self-discipline while working remotely</li>\n</ul>\n<p>Technologies we use:\nHTML5, CSS, Javascript, Canvas API, WebAudio API, C#, ASP.NET MVC, MS-SQL</p>\n<p>While we need our team to be committed and accountable for their work, we hope this job would provide an opportunity for those who need to work more flexibly – e.g. it might be suited for those who have caring responsibilities or for whom working a 9-5 office job would be challenging.</p>\n<p>We are an equal opportunities employer.</p>\n<p>Real applicants only - no agencies.</p>\n",
    "how_to_apply": "<p>With CV and covering email explaining how you meet the job spec to <a href=\"mailto:jobs@wordwall.net\">jobs@wordwall.net</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnQ5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--80c513d68428bd5459981eb38a4681ea96066fea/Wordwall%20logo%20640pixels.jpg"
  },
  {
    "id": "d95839aa-c419-49cc-a29a-17eab6123450",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d95839aa-c419-49cc-a29a-17eab6123450",
    "created_at": "Thu Feb 06 14:42:56 UTC 2020",
    "company": "FCB Health NY",
    "company_url": "http://fcbhealthny.com/",
    "location": "NEW YORK",
    "title": "Tech Manager (Tech Lead)",
    "description": "<p>Tech Manager</p>\n<p>As a Tech Lead at FCB Health you will be tasked with leading a development team to build innovative internet and mobile based applications. You will be responsible for guiding projects through the entire development lifecycle while working very closely with partner capabilities such as experience design, integrated production, creative, strategy and client services to help manage expectations, timing, and to drive the technology approach and execution. You should have a deep understanding of multiple technologies and should be able to discuss a variety of technologies with ease. The day-to-day work will also entail client and vendor contact and the role may require some hands-on development.</p>\n<p>Job Experience:</p>\n<ul>\n<li>3+ years directly managing technical teams in the development of web sites and mobile applications</li>\n<li>Experience in recommending Internet technologies to meet business needs</li>\n<li>5+ years as a hands-on developer</li>\n<li>Ability to apply knowledge of development process to accurately scope and resources technology projects</li>\n<li>Expertise in collaborating efforts and maintaining relationships across capabilities, especially creative teams</li>\n<li>Bachelor’s in Computer Science, Information Technology, or equivalent work experience</li>\n<li>Passion for web and emerging technology and software development lifecycle, including current industry trends and their application</li>\n<li>Five to seven years of professional work experience in web and emerging platforms, ideally in management of high traffic customer-facing enterprise and product sites.</li>\n<li>Knowledge of modern development best practices</li>\n<li>2+ years agency experience</li>\n</ul>\n<p>Education</p>\n<ul>\n<li>BA or BS, preferably in computer science, engineering, or science/technology-based discipline</li>\n<li>Project management certifications a plus</li>\n</ul>\n<p>Skills</p>\n<ul>\n<li>Demonstrable expertise in complex web development, leading teams and managing client interaction.</li>\n<li>Ability to interact and present in front of an audience (including clients);</li>\n<li>Solid understanding of OOP principles and design patterns</li>\n<li>Expertise in Web development standards, practices, tools, and technologies.</li>\n<li>Direct experience with HTML, JavaScript, CSS. Experience or strong understanding of technologies such as responsive frameworks, Angular, .NET MVC, and Grunt Experience with Veeva CLM and Approved Email</li>\n<li>Ability to apply understanding of technology in architectural planning and in problem solving sessions.</li>\n<li>Preferably this individual will have expert level knowledge of at least one major OOP language and have been a developer.</li>\n<li>Ability to research and recommend technology solutions.</li>\n</ul>\n",
    "how_to_apply": "<p>Email me: <a href=\"mailto:John.Riccobono@fcb.com\">John.Riccobono@fcb.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmw5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b388df3e8431490d9a2f3deac7c7860a34cc70f9/Untitled.png"
  },
  {
    "id": "34c96fab-15a0-440a-870d-78963c5c3715",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/34c96fab-15a0-440a-870d-78963c5c3715",
    "created_at": "Tue Feb 04 16:57:43 UTC 2020",
    "company": "Dancor Solutions",
    "company_url": "https://dancorsolutions.com/",
    "location": "Columbus, OH",
    "title": "Backend PHP Developer (experience required)",
    "description": "<p><strong>Job Description:</strong></p>\n<p>Dancor Solutions is looking for a talented PHP developer / web developer / software developer with solid experience; someone who can write clean, tight code and thrives in a small team environment.</p>\n<p>This is a full-time position in which the ideal client should be able to come up with innovative ideas leading to solutions for our clients in a timely manner. They should be able to learn new skills as needed, and be able to balance several projects concurrently. The ideal candidate will possess the technical skills to handle the workload as well as the social skills to effectively communicate in an extremely fluid, team-based environment.</p>\n<p>At Dancor Solutions, we pride ourselves on working quickly and efficiently with quality as one cohesive team, and the candidate should be able to keep a calm head and a positive attitude in fast-paced situations.</p>\n<p><strong>Company Description:</strong></p>\n<p>Dancor Solutions’ technology division focuses on creating and developing unique web and SaaS applications for desktop, tablet, and mobile devices for our large existing client base of Fortune 100 companies. We are a team-oriented small company where each team member collaborates on innovative and creative projects, and has the opportunity to make a great deal of impact on final projects. Our company culture is an energetic, fun, flexible, creative, and open environment.</p>\n<p><strong>Top Reasons to Work With Us:</strong></p>\n<ul>\n<li>We’re passionate about building customized solutions that help our clients and their associates thrive</li>\n<li>Start-up environment in long-standing, fast-growing company</li>\n<li>Collaborative team environment that’s open to and encourages new ideas</li>\n<li>A casual, open work environment</li>\n<li>Work in a fun, energetic company culture</li>\n</ul>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Proficient with PHP. Multiple-language candidates preferred</li>\n<li>Proficient with Object Oriented PHP and/or MVC including Laravel</li>\n<li>Proficient with MySQL, Queries and Data Construction</li>\n<li>Proficient with MS Office Suite, including Excel, Word</li>\n<li>Proficient understanding of web markup, including HTML5, CSS3</li>\n<li>Proficient understanding of client-side scripting and JavaScript frameworks, including jQuery</li>\n<li>Basic understanding of advanced JavaScript libraries and frameworks, such as ReactJS, Gulp, Webpack</li>\n<li>Basic understanding of server-side CSS pre-processing platforms, such as LESS and SASS</li>\n<li>Solid understanding of asynchronous request handling, partial page updates, and AJAX</li>\n<li>Proficient understanding of cross-browser compatibility issues and ways to work around them</li>\n<li>Proficient understanding of code versioning tools, such as Git and SVN</li>\n</ul>\n<p><strong>You are:</strong></p>\n<ul>\n<li>A self-motivated individual that is able to work and collaborate in a small team environment with minimal supervision</li>\n<li>Someone who has a commitment to coding standards, documentation, and best practices</li>\n<li>Excited about and have the desire to learn new technologies</li>\n<li>Passionate about using open source tools and frameworks - a follower of PHP standard recommendations</li>\n<li>Able to develop new features based on client requirements</li>\n<li>Able build reusable code and libraries for future use</li>\n<li>Someone who assures that all user input is validated and sanitized</li>\n</ul>\n<p><strong>This is an on-site position and relocation assistance is not provided.</strong></p>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:careers@dancorsolutions.com\">careers@dancorsolutions.com</a></p>\n<p>This is an on-site position (Columbus, OH) and relocation assistance is not provided.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2w5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--15bfe0371630f8582f34d2497f67e82c25f1fc17/0.png"
  },
  {
    "id": "03e10635-68a6-42b9-b639-922ca69bfec5",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/03e10635-68a6-42b9-b639-922ca69bfec5",
    "created_at": "Tue Feb 04 15:36:00 UTC 2020",
    "company": "Harvey Mudd College",
    "company_url": "https://www.hmc.edu/",
    "location": "Claremont, CA",
    "title": "Business Intelligence and Reporting Analyst",
    "description": "<p>BUSINESS INTELLIGENCE AND REPORTING ANALYST</p>\n<p>POSITION SUMMARY</p>\n<p>The Business Intelligence and Reporting Analyst (Analyst) is responsible for managing the Office of College Advancement’s (OCA) databases, including data warehousing, integration, in-depth data analysis reporting, and dashboard development. Reporting directly to the Director of Advancement Services, the Analyst is responsible for the overall lifecycle management of the Advancement Data Warehouse and reporting infrastructures. The Analyst is responsible for building, implementing, and maintaining data integrations between various databases within Advancement and throughout Harvey Mudd College. Under direction of the Director, the Analyst aids in the effort to create, implement, integrate, assess, and improve—on an ongoing basis—the College’s infrastructure and strategies required to conduct successful overall advancement efforts.</p>\n<p>In the Summer of 2019, OCA completed a database conversion to Blackbaud Raiser’s Edge NXT. The Analyst will be instrumental in the next phase of the project by creating and implementing a data warehouse and associated reports/dashboards.</p>\n<p>The Analyst must be a highly collaborative, customer centric individual who has a proven track record of effective communication skills, both verbal and written, that will thrive in a fast-paced team environment. By defining realistic timelines and goals, the Analyst must be able to advance multiple projects with competing priorities and deadlines with minimal supervision.</p>\n<p>About Harvey Mudd College:\nLocated in the heart of Claremont, California, 35 miles east of Los Angeles, Harvey Mudd College is a highly selective undergraduate liberal arts college offering degrees in science, technology, engineering and mathematics.  HMC enrolls about 800 students and is a member of The Claremont Colleges, which comprises five undergraduate colleges and two graduate institutions.  According to students, professors, and alumni, what makes Harvey Mudd distinctive is its collaborative, cross-disciplinary nature.  The working environment is built on collaborative relationships between and among all members of the campus community and a deep commitment to the College’s mission to educate students “so that they may assume leadership in their fields with a clear understanding of the impact of their work on society.”</p>\n<p>SUMMARY OF ESSENTIAL DUTIES AND RESPONSIBILITIES</p>\n<p>Data Warehouse</p>\n<ul>\n<li>Lead the design and implementation of a a data warehouse, ensuring departmental data is easily accessible for reporting and analysis, while safeguarding the data’s security. Maintain the data warehouse after implementation.</li>\n<li>Gain expert level knowledge of source system tables, application business rules, and data challenges facing OCA.</li>\n<li>Support members of the Advancement Services Team and other subject-matter experts to clean, transform, aggregate, and summarize data as needed to populate the data warehouse.</li>\n<li>Develop and maintain clear documentation on OCA’s data warehouse, ensuring staff members can effectively support the data warehouse in Analyst’s absence.</li>\n<li>Monitor the OCA data warehouse to ensure nightly population processes complete successfully and identify errors.</li>\n<li>Through coordination with HMC’s IT Department (Computing and Information Services or CIS), lead the effort to develop and deploy optimal solutions that support the OCA data warehouse. Perform routine administration of system maintenance activities.</li>\n</ul>\n<p>Reporting &amp; Analysis</p>\n<ul>\n<li>Collaborate with fellow OCA team members and interpret their requests to design, program, and deliver customized reports and dashboards tailored to fit their needs, ensuring data accuracy and consistency.</li>\n<li>In collaboration with the Director, design solutions to improve workflows and streamline processes.</li>\n<li>Develop and maintain clear and complete documentation on all reports and dashboards.</li>\n<li>Engage with the Advancement Services team and key stakeholders to ensure regular data validation scripts and queries are executed.</li>\n<li>Train power-users to be able to pull ad-hoc queries and/or reports.</li>\n</ul>\n<p>Data Integrations</p>\n<ul>\n<li>Develop integrations in Dell Boomi, or when necessary other techniques, to allow for fast and consistent data flow between various OCA databases (Blackbaud Raiser’s Edge NXT, iModules, Salesforce Marketing Cloud, etc.) and, through partnership with CIS resources, other HMC databases (Workday, Identity Access Management, etc.)</li>\n<li>Develop and maintain clear and complete documentation on integrations to be shared throughout the campus, ensuring clarity between departments around data flows and system of record details.</li>\n<li>In coordination with CIS, pass data from Advancement to other College databases.</li>\n</ul>\n<p>Database Administration</p>\n<ul>\n<li>Manage security and access for all users within Blackbaud Raiser’s Edge NXT, Power BI, and other OCA databases/reporting tools.</li>\n<li>Assist end-users with issues utilizing Blackbaud Raiser’s Edge NXT, coordinating with Blackbaud Support or HMC CIS when necessary.</li>\n<li>In collaboration with the Director, aid in the creation and implementation of departmental policies and procedures to ensure compliance with the College’s policies regarding data security and privacy, document retention, and other relevant policies.</li>\n<li>Maintain strong working relationships with OCA’s various vendors, ensuring awareness of upcoming enhancements, maintenance windows, etc.\nGeneral</li>\n<li>Maintain a close working relationship with both HMC’s CIS and the IT departments throughout The Claremont Colleges and The Claremont Colleges Services (TCCS) through effective communication and collaboration on common data projects.</li>\n<li>Through in-person or virtual training, classes, conferences, or similar, keep current with the latest trends in data management and analysis technology. Partner with the Director to roll out new features/enhancements to the department.</li>\n<li>As required, participate in the assessment, evaluation, and selection of vendor products related to OCA and HMC data to support the department’s and College’s mission.</li>\n<li>Represent OCA on various data-related committees throughout HMC, including the HMC Data Governance and Standards Team (DGST).</li>\n<li>Perform other responsibilities and tasks as assigned.</li>\n</ul>\n<p>REQUIRED QUALIFICATIONS AND EXPERIENCE</p>\n<p>Education &amp; Experience:</p>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Systems, Business System Administration or related field. Or any combination of relevant education, training, and experience that provides the required knowledge, skills, and abilities of the position.</li>\n<li>Minimum five years’ experience with data analysis and reporting.</li>\n<li>Minimum three years’ experience designing, implementing, and maintaining data warehouses.</li>\n<li>Minimum three years’ experience building and maintaining data integrations and APIs.</li>\n<li>Minimum two years’ experience database administration.</li>\n</ul>\n<p>PREFERRED QUALIFICATIONS</p>\n<ul>\n<li>Advanced degree in Computer Science, Information Systems, Business System Administration or related field.</li>\n<li>Dell BOOMI Developer Certification or equivalent experience with other integration tools such as Snaplogic, Informatica, or Workato; familiarity with RESTful Web Services and APIs.</li>\n<li>Experience in higher education and/or fundraising/advancement, including an understanding of the advancement processes and terminology.</li>\n<li>Experience supporting and/or administering Blackbaud Raiser’s Edge (v.7 or NXT, NXT preferred).</li>\n<li>Familiarity with Workday, Salesforce Marketing Cloud, Import-O-Matic, and/or iModules.</li>\n<li>Experience with maintaining Windows Server 2012/2016 systems.</li>\n<li>Knowledge of Microsoft Flow and Power Apps.</li>\n</ul>\n<p>Required Knowledge, Skills and Abilities:</p>\n<ul>\n<li>Proven experience with data warehouse design and implementation, data warehousing life cycle and dimensional modeling.</li>\n<li>Advanced SQL programming experience.</li>\n<li>Extensive experience with Microsoft Power BI, Query Editor, M, Report Builder (paginated reports), etc.</li>\n<li>Advanced experience writing and troubleshooting issues with SQL queries, scripts, or stored procedures to perform ETL (Extract, Transform, and Load) processes.</li>\n<li>Excellent information technology skills with aptitude to learn and effectively utilize a variety of software tools at a “power user” level.</li>\n<li>Demonstrated experience building and maintaining APIs. Experience in data systems integrations involving multiple data sources of varying complexities.</li>\n<li>Project management experience with demonstrated ability to estimate, plan, prioritize, and deliver projects on time.</li>\n<li>Extremely high level of attention to detail and proven ability to problem solve.</li>\n<li>Ability to communicate in a clear and concise manner whether verbally, in writing, or in person.</li>\n<li>Experience communicating with a wide variety of audiences, tailoring the level of technical detail in explaining complex ideas accordingly.</li>\n</ul>\n<p>PHYSICAL REQUIREMENTS</p>\n<p>Frequent sitting for extended periods of time. Constant use of keyboard. Specific vision requirements include close vision, distance vision, and the ability to adjust focus. Occasional moderate lifting of 10-20 lbs.</p>\n<p>POSITION CHARACTERISTICS</p>\n<p>Hours: The regular office hours of this position are 8:00 a.m. to 5:00 p.m. including a one-hour meal period, Monday-Friday. Hours may vary due to the needs of the College or department. Occasional evening and weekend hours may be required.\nClassification &amp; Status: This is a full-time, regular, 12-months per year, benefits-eligible, exempt position.\nReports to: Director of Advancement Services.</p>\n<p>Application Procedures:</p>\n<p>Please visit <a href=\"http://www.hmc.edu/employment\">www.hmc.edu/employment</a> to view a complete job description for this position and obtain information about how to submit an application.   Information about HMC’s competitive benefits package is available at <a href=\"http://www.hmc.edu/hrbenefits\">www.hmc.edu/hrbenefits</a>.</p>\n<p>Deadline to apply:\nPosition will remain open until filled.</p>\n<p>This job description defines the essential job duties of the position. Harvey Mudd College expects that employees hired for this position can perform the essential functions of the job without imposing risk of substantial harm to the health or safety of themselves or others.  It may also include marginal functions, generally defined within Title I of the Americans with Disabilities Act.</p>\n<p>Regular employment at the College is for no specified period of time; conditions and status of employment (hours, pay, title, duties, etc.) are subject to change at any time. Employment is at-will and employees, and likewise the College, are free to end the employment relationship at any time, for any reason, with or without notice or cause, unless otherwise prohibited by law.</p>\n",
    "how_to_apply": "<p>Application Procedures:\nPlease visit <a href=\"http://www.hmc.edu/employment\">www.hmc.edu/employment</a> to view a complete job description for this position and obtain information about how to submit an application.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc0I5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3ed43b80686fed5481f817cec680b3d4c12109e4/HMC-BGW-RGB-150dpi-300x300.png"
  },
  {
    "id": "3cbebc3a-7787-4a4e-8773-5e598ce712b2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/3cbebc3a-7787-4a4e-8773-5e598ce712b2",
    "created_at": "Mon Feb 03 18:48:45 UTC 2020",
    "company": "NIKE",
    "company_url": "https://jobs.nike.com/",
    "location": "Beaverton, Oregon",
    "title": "Sr. Software Engineer (Back End)",
    "description": "<p>At Nike, we understand that consumer trust is the true currency of our data-driven world. As we expand our digital advantage to unlock a new era of consumer services, experiences and solutions, we will be guided by our core believe that consumers’ trust is earned, not given. We work hard to maintain this trust every day.</p>\n<p>By embedding privacy within every product and experience and by investing in high quality data, platforms, and models to create unbreakable relationships, we ensure that as we innovate, we do so with the consumer at the center. We create the future of sport together.</p>\n<p>If you're ready to innovate and lead in the Digital space, join Nike's Global Technology organization. We bring together technology and process expertise to deliver one-stop solutions that enable Nike, Inc.'s digital products and services. We are responsible for creating, developing and deploying seamless, tailored and inherently social experiences to its Digital consumers. Working with our organization will be rewarding, challenging, and most definitely not be just another job.</p>\n<p>As a Software Engineer on our Launch Engineering team, you will bring a broad experience of successfully ideating and delivering value that enables Nike to increase productivity, realize efficiencies and build profitable customer experiences. You will be responsible for building simple and intuitive APIs’ for a very large developer community within Nike. Interest and experience in the latest methodologies goes a long way here and we're looking for people who are passionate about the world of value-driven solution delivery. You'll get to work alongside truly talented teams and help them enhance their performance by promoting collaboration and innovation.</p>\n<p>What you’ll do:</p>\n<ul>\n<li>Work in a fast-paced agile environment</li>\n<li>Work in true DevOps fashion leading the entire tech stack</li>\n<li>Solve big engineering challenges to serve our worldwide athletes* at scale</li>\n<li>Build Nike’s data privacy vision for today’s data driven world</li>\n<li>Grow and keep our APIs fast, efficient, available</li>\n<li>Collaborate with other amazing engineers to power the most exciting digital experiences for athletes on the market</li>\n</ul>\n<p>WHAT YOU BRING TO NIKE</p>\n<ul>\n<li>5+ years of experience writing Restful APIs</li>\n<li>Significant experience writing software in Java and Node.js</li>\n<li>Evidence of exposure to architectural patterns of a large, high-scale web application (e.g., well-designed APIs, high volume data pipelines, efficient algorithms)</li>\n<li>Validated ability to produce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.</li>\n<li>Hands on experience in AWS</li>\n<li>Strong communication skills and great product sense</li>\n<li>Passion for sports!</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jobs.nike.com/job/00470894?utm_source=Github&amp;utm_medium=Jobslots&amp;utm_campaign=SeniorSoftwareEngineerBackEnd\">https://jobs.nike.com/job/00470894?utm_source=Github&amp;utm_medium=Jobslots&amp;utm_campaign=SeniorSoftwareEngineerBackEnd</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBclY5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4868c602a4986f0588e821ba9ac9339db0d027bf/NIKE.png"
  },
  {
    "id": "abddd671-8641-455d-a36d-03606a87918b",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/abddd671-8641-455d-a36d-03606a87918b",
    "created_at": "Mon Feb 03 18:45:43 UTC 2020",
    "company": "NIKE",
    "company_url": "https://jobs.nike.com/",
    "location": "Beaverton, Oregon",
    "title": "Senior Software Engineer (Front End)",
    "description": "<p>At Nike, we understand that consumer trust is the true currency of our data-driven world. As we expand our digital advantage to unlock a new era of consumer services, experiences and solutions, we will be guided by our core believe that consumers’ trust is earned, not given. We work hard to maintain this trust every day.</p>\n<p>By embedding privacy within every product and experience and by investing in high quality data, platforms, and models to create unbreakable relationships, we ensure that as we innovate, we do so with the consumer at the center. We create the future of sport together.</p>\n<p>If you're ready to innovate and lead in the Digital space, join Nike's Global Technology organization. We bring together technology and process expertise to deliver one-stop solutions that enable Nike, Inc.'s digital products and services. We are responsible for creating, developing and deploying seamless, tailored and inherently social experiences to its Digital consumers. Working with our organization will be rewarding, challenging, and most definitely not be just another job.</p>\n<p>As a Software Engineer on our Launch Engineering team, you will bring a broad experience of successfully ideating and delivering value that enables Nike to increase productivity, realize efficiencies and build profitable customer experiences. You will be responsible for building simple and intuitive User Interfaces for a variety of internal privacy tools within Nike. Interest and experience in the latest methodologies goes a long way here and we're looking for people who are passionate about the world of value-driven solution delivery. You'll get to work alongside truly talented teams and help them enhance their performance by promoting collaboration and innovation.</p>\n<p>What you’ll do:</p>\n<ul>\n<li>Work in a fast-paced agile environment</li>\n<li>Work in true DevOps fashion owning the entire tech stack</li>\n<li>Build Nike’s data privacy vision for today’s data driven world</li>\n<li>Design, implement, and maintain a variety of user interfaces for Nike’s privacy tools</li>\n<li>Participate in code and design reviews</li>\n<li>Collaborate with other amazing engineers to power the most exciting digital experiences for athletes on the market</li>\n</ul>\n<p>What You Bring to Nike:</p>\n<ul>\n<li>5+ years of experience as a highly productive developer with front-end technologies</li>\n<li>Excellent knowledge of Javascript (ES6), CSS, HTML</li>\n<li>Full-stack front-end developer with experience in React/Redux, Express, Node.js</li>\n<li>Knowledgeable with version control systems (Git) and issue tracking tools (JIRA)</li>\n<li>Experience with TDD, which may include Mocha, Chai, Sinon, etc.</li>\n<li>Experience with CD/CI and related tools (Jenkins etc.)</li>\n<li>Hands on experience in AWS</li>\n<li>Strong communication skills and great product sense</li>\n<li>Passion for sports!</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jobs.nike.com/job/00470890?utm_source=Github&amp;utm_medium=Jobslots&amp;utm_campaign=SeniorSoftwareEngineerFrontEnd\">https://jobs.nike.com/job/00470890?utm_source=Github&amp;utm_medium=Jobslots&amp;utm_campaign=SeniorSoftwareEngineerFrontEnd</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBck45IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1520744b9f7c63e505eb8cd723324734fedad0de/NIKE.png"
  },
  {
    "id": "6b185ea4-8d2d-4946-b6c6-a2ee866f617b",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6b185ea4-8d2d-4946-b6c6-a2ee866f617b",
    "created_at": "Sat Feb 01 04:29:09 UTC 2020",
    "company": "KinaTrax",
    "company_url": "http://www.kinatrax.com",
    "location": "Remote",
    "title": "Full Stack Web Developer",
    "description": "<p><strong>Job Description</strong></p>\n<p>The Full Stack Web Developer (FSD) will be responsible for designing and developing a web-based biomechanics analysis platform tailored specifically for the company’s markerless motion capture and video data. The aim of this project is to develop a web-based platform, accessed through the company’s website, to aid front office personnel, coaching staff, and players in the analysis, visualization, and reporting of KinaTrax’s data. Additionally, the FSD will support future web development initiatives of the company.</p>\n<p><strong>Essential Job Responsibilities</strong></p>\n<p>The FSD performs the major functions listed below. The position may require additional duties/responsibilities that may not be outlined below, and specific functions are subject to change.</p>\n<ul>\n<li>Designing and developing a web-based biomechanical analysis platform tailored specifically for use with the company’s markerless motion capture and video data.</li>\n<li>Developing front end website architectures.</li>\n<li>Designing user interactions on web pages.</li>\n<li>Developing back end website applications.</li>\n<li>Creating servers and databases for functionality.</li>\n<li>Ensuring cross-platform optimization for mobile devices.</li>\n<li>Ensuring responsiveness of applications.</li>\n<li>Working alongside biomechanists and data scientists for core functionality.</li>\n<li>Working alongside graphic designers for web design features.</li>\n<li>Designing and developing APIs.</li>\n<li>Troubleshooting, debugging, and upgrading software.</li>\n<li>Designing and developing security and data protection measures.</li>\n<li>Seeing through a project from conception to finished product.</li>\n<li>Meeting both technical and consumer needs.</li>\n<li>Writing technical documentation.</li>\n<li>Staying abreast of developments in web technology.</li>\n<li>Supporting the company’s future web development initiatives.</li>\n<li>Designing and developing unit tests.</li>\n<li>Participating in code reviews.</li>\n</ul>\n<p><strong>Qualifications &amp; Requirements</strong></p>\n<p>The following qualifications are the minimum requirements necessary to successfully perform this role. However, any equivalent combination of experience, education and training, which provides the necessary knowledge, skills and abilities, would be acceptable, subject to any legal and/or regulatory requirements.</p>\n<ul>\n<li>Degree in Computer Engineering, Computer Science or equivalent disciplines.</li>\n<li>Proficiency with fundamental front-end languages such as HTML, CSS and JavaScript.</li>\n<li>Proficiency with AngularJS and familiarity with other JavaScript frameworks such as React.</li>\n<li>Proficiency with ASP.NET Core and familiarity with other server-side languages such as Python, Ruby, Java, and PHP.</li>\n<li>Proficiency with MySQL and familiarity with other database technologies such as MSSQL, Oracle and MongoDB.</li>\n<li>Proficiency with Microsoft Visual Studio.</li>\n<li>Proficiency with web servers, such as IIS and Apache, and UI/UX design.</li>\n<li>Experience in software engineering practices, including but not limited to software design and implementation, unit testing, code reviews, continuous integration, source control, and coding standards compliance.</li>\n<li>Experience with Git is preferred.</li>\n<li>Experience interfacing with both internal team members and external customers as part of a solution-based service process.</li>\n<li>Experience troubleshooting and responding to customer concerns.</li>\n<li>Proven record of being reliable and accountable for all aspects of their job.</li>\n<li>Excellent analytical, interpersonal and communication skills with the ability to communicate complex technical issues in an easy to understand manner.</li>\n<li>Ability to work in a fast-paced, self-directed, entrepreneurial environment.</li>\n<li>Resourceful, with the ability to work independently.</li>\n<li>Strong time management skills.</li>\n<li>Ability to adapt to changing circumstances.</li>\n<li>Decision-making, problem resolution and creative thinking skills.</li>\n<li>Attention to detail.</li>\n<li>Ability to multi-task activities with shifting priorities. Able to work productively in a pressurized environment.</li>\n<li>Ethical and trustworthy.</li>\n</ul>\n<p><strong>Working Conditions</strong></p>\n<ul>\n<li>Occasional travel to meet with clients.</li>\n<li>Extended periods of computer usage.</li>\n</ul>\n<p><strong>Relocation</strong></p>\n<ul>\n<li>None required. Remote work.</li>\n</ul>\n<p><strong>Company Description</strong></p>\n<p>KinaTrax develops a markerless motion capture system that analyzes the motions of a baseball pitcher and hitter in-game. The system is installed in more than 24 ballparks throughout the country, and is utilized by multiple professional baseball teams for the purposes of assessing and enhancing player performance and preventing injuries. The company was founded in 2015 and is headquartered in Boca Raton, Florida.</p>\n<p><strong>Additional Information</strong></p>\n<ul>\n<li>Type: Full-time</li>\n<li>Compensation: $80,000 - $120,000</li>\n<li>Benefits: Health Insurance, Retirement plan</li>\n<li>Experience: Senior level</li>\n<li>Functions: Full Stack Web Development</li>\n<li>Industries: Biomechanics, Baseball</li>\n</ul>\n",
    "how_to_apply": "<p>Apply at:\n<a href=\"https://www.kinatrax.com/kinatrax-jobs/full-stack-web-developer/\">https://www.kinatrax.com/kinatrax-jobs/full-stack-web-developer/</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEo5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--679dd3ed1b7182d1a5c9a33a9cb16bec5dac5d9a/KINATRAX.png"
  },
  {
    "id": "07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011",
    "created_at": "Tue Nov 20 12:09:59 UTC 2018",
    "company": "Mindhive",
    "company_url": "http://www.mindhive.org",
    "location": "Brisbane CBD Australia",
    "title": "Senior Front End and Backend Developers",
    "description": "<p><strong>MINDHIVE FRONTEND AND BACKEND DEVELOPER ROLES</strong></p>\n<p>An exciting opportunity exists to work at Mindhive [www.mindhive.org] - the world’s first crowdsourced consultancy. We're looking for an experienced backend developer as part of our core team to take on some of our most demanding challenges to build and create a platform that will improve productivity and in turn change the way Mindhive clients and contributors solve challenges. You will be working closely with the engineering lead and developers in an agile environment with a high degree of freedom.</p>\n<p><strong>Mindhive</strong></p>\n<p>Mindhive sets out to do things differently – we’re taking a unique approach to creating the future of problem solving. The Company's core product is Mindhive - a cloud-based platform where organisational users (who pay) bring challenges to be solved by a growing community of high-quality individual users (non-paying) with a broad range of professional backgrounds and experiences. The model enables organisational users to gather, share and evaluate ideas efficiently and effectively, and gain access to diverse approaches to solving difficult problems. The existing model requires curation and input by administrators and does not take full advantage of the rich data available.</p>\n<p>Since completing a successful capital raising in 2017, the Company has hired a world-class development team [and has partnered with a leading digital design company Joseph Mark] which has given it the capability to develop a more technically complex platform ecosystem-style product (‘Mindhive 2.0’). Mindhive 2.0 will be a revolutionary approach that is ambitious in scale but grounded in historical experience (from the current platform) and growing market appetite for crowdsourcing and artificial intelligence</p>\n<p><strong>SENIOR BACKEND DEVELOPER ROLE</strong></p>\n<p>As a backend developer, you will help design, implement, deploy &amp; support Mindhive’s platform which includes (and not limited to):</p>\n<p>Cloud services\nDatabase\nIntegrations (in-house &amp; third party)\nTests (unit &amp; integration)</p>\n<p><strong>What you’ll do</strong></p>\n<p>Primary responsibility: Implement services (backend API endpoints) for mobile first web apps\nAdditional key responsibilities include:</p>\n<p>Develop cloud-based API services\nDevelop in-house &amp; 3rdparty integration interfaces\nDevelop database models\nImplement automated tests\nDevelop CI/CD scripts\nDevelop performance and monitoring interfaces\nAnalyse business and technical requirements</p>\n<p><strong>What you’ll bring</strong></p>\n<p>Detailed understanding of cloud architecture(s)\nDetailed knowledge of Python &amp; Node.JS\nDetailed knowledge of Django\nDetailed knowledge of Docker\nExperience working with\nPostgres and NoSQL database(s)\nExperience with authentication protocols &amp; certificates\nBonus: detailed knowledge of machine learning &amp; AI</p>\n<p><strong>How do I level up?</strong></p>\n<p>Roles within reach for the employee - Development Team Lead</p>\n<p><strong>Bespoke Requirements / Additional Responsibilities</strong></p>\n<p>Develop and maintain software specifications and architecture documents\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology</p>\n<p><strong>SENIOR FRONTEND DEVELOPER ROLE OVERVIEW</strong></p>\n<p>As a frontend developer, you will help design, implement, deploy &amp; support Mindhive’s platform which includes (and not limited to):</p>\n<p>Web application\nMobile application\nIntegrations (in-house &amp; third party)\nTests (unit &amp; integration)</p>\n<p><strong>What you’ll do</strong></p>\n<p>Primary responsibility: Implement UX/UI for mobile first web and mobile apps</p>\n<p><strong>Additional key responsibilities include:</strong></p>\n<p>Utilise any and all relevant frameworks, libraries and techniques:</p>\n<p>JavaScript (Vue.js and React Native)\nHTML5, CSS3 and SCSS for design implementations\nLinux Command Line (for bonus points)\nDemonstrate use of modern development practices such as use of Object-Oriented Design, Web Services (REST), Version Control (utilizing Git), Build processes and packaging (Webpack, etc), Automated Testing and Responsive Website Development\nCut up and implement designs\nInform the product team of relevant possibilities and solutions\nDevelop integration with cloud-based API services (in-house &amp; third party)\nReview and inform database models are in alignment with frontend view models &amp; components\nImplement components unit tests and automated tests as required\nDevelop web/site/mobile app performance and monitoring interfaces\nAnalyse business and technical requirements\nMinimise bugs in released code</p>\n<p><strong>What you’ll bring</strong></p>\n<p>Experience with current industry design tools (e.g. Figma)</p>\n<p>Understanding, and preferably experience in, agile project methodology\nYou have experience with version control and project management systems\nCan work and communicate effectively within multidisciplinary teams\nKnowledge of Accessibility and Security Principles\nUndergraduate degree in IT or relevant programming experience\nImpeccable attention to detail\nInnovative thinking and problem solving\nCourteous, supportive and honest\nMotivated self-starter, with the ability to manage your own time and adhere to time and budget restrictions\nEnthusiasm for the work\nMindhive does and your important role in delivery\nCreative thinking &amp; abstract, technical problem solving\nProactivity\nCollaboration</p>\n<p><strong>How do I level up?</strong></p>\n<p>Roles within reach for the employee - Development Team Lead</p>\n<p><strong>Bespoke Requirements / Additional Responsibilities</strong></p>\n<p>Develop and maintain software specifications and architecture documents:\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology</p>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:career@mindhive.it\">career@mindhive.it</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5a6c8dd1ece5763c8a6aeb215ff3189fd8ed3bd7/c540fe15-d18d-48bd-95de-cf0a85125293"
  },
  {
    "id": "cd535970-ec11-11e8-89ae-2e904411ec0e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e",
    "created_at": "Mon Nov 19 15:44:44 UTC 2018",
    "company": "Aon Cyber Solutions",
    "company_url": "http://www.strozfriedberg.com/careers",
    "location": "NY or LA",
    "title": "Cybersecurity Firm Seeks Senior Developer",
    "description": "<p>Aon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.</p>\n<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n<p>Position Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.</p>\n<p>The responsibilities of this position include but are not limited to the following:</p>\n<ul>\n<li>Design and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.</li>\n<li>Serve as a senior developer on multiple product teams.</li>\n<li>Create user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.</li>\n<li>Translate high-level requirements into working prototypes to generate user feedback and discussion.</li>\n<li>Adapt and apply cutting edge computer science to highly technical domains.</li>\n<li>Participate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.</li>\n<li>Mentor other developers.</li>\n<li>Contribute to a positive, collaborative culture for innovation.</li>\n</ul>\n<p>Requirements</p>\n<ul>\n<li>5+ years of software engineer experience.</li>\n<li>Proficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.</li>\n<li>Strong knowledge of HTTP and REST web services implementation.</li>\n<li>Test driven development and unit testing frameworks.</li>\n<li>Modern DevOps experience.</li>\n<li>Standard software engineering tools (git, Jenkins, JIRA).</li>\n<li>The proven ability to see things as they should be, and to realize that vision.</li>\n<li>Comfort with agile development and remote team environments.</li>\n<li>Excellence in verbal and written communication.</li>\n</ul>\n<p>Desired Skills</p>\n<ul>\n<li>TypeScript</li>\n<li>Python 3 and web frameworks such as Django or Flask.</li>\n<li>SQL &amp; relational database modeling.</li>\n<li>Experience in deployment to AWS, especially serverless technologies.</li>\n<li>Strong knowledge of JWT and various web security models.</li>\n<li>D3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).</li>\n<li>ElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.</li>\n<li>Java 8 and other JVM-based languages.</li>\n<li>Performance monitoring and optimization.</li>\n<li>Mobile development using Native or Cross-platform (Xamarin, Ionic, React Native).</li>\n</ul>\n<p>Education Required</p>\n<ul>\n<li>BS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.</li>\n</ul>\n",
    "how_to_apply": "<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n",
    "company_logo": null
  },
  {
    "id": "312b993e-ec09-11e8-9f79-994c27d575a7",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/312b993e-ec09-11e8-9f79-994c27d575a7",
    "created_at": "Mon Nov 19 14:42:19 UTC 2018",
    "company": "Signify",
    "company_url": null,
    "location": "Eindhoven",
    "title": "Mobile Application Tester",
    "description": "<p><strong>We are…</strong>\nSignify, the new company name of Philips Lighting, is the undisputed leader in the lighting industry. Our purpose is to unlock the extraordinary potential of light for brighter lives and a better world.</p>\n<p>You will join the leader in the lighting industry and learn through disruptive challenges. You will be part of a global team, where performance is powered through diversity. Help us shape the future of light in the Internet of Things and work with us on our commitment to achieve a more sustainable future.</p>\n<p>Join us and #findyourmeaning at Signify.</p>\n<p>Since its launch in 2012, Philips Hue is changing the way people interact and experience lighting.</p>\n<p>We have become the world’s leading connected home lighting system that works with all major smarthome platforms (Amazon Alexa, Apple HomeKit, Google, Nest, Smartthings). Philips Hue has encouraged other companies to develop devices, apps and systems that inter-operate with our system.\nThrough a vibrant developer program there are more than 600 third-party apps for Philips Hue. The Hue ecosystem is growing rapidly through both new lights, luminaires, sensors, and switches as well as exciting partnerships like Google and Apple. New features are added through agile development processes.</p>\n<p>As a Mobile App tester in the Hue mobile Application Team, you will be challenged to release the Hue Mobile Apps on time with highest quality, further contributing to the success of one of the most successful internet connected propositions in the market. Being member of an agile team, you will seek for continuous improvement and accelerate the development of the product whilst focusing on operational excellence by using or implementing new tools and processes.</p>\n<p>You will be based at the High-Tech Campus Eindhoven, the smartest square km in Europe, joining a team of passionate software craftsmen working on the world’s leading connected lighting system. Surrounded by usability experts, product owners, software architects and test engineers, you’ll take up the challenge to build high quality and exciting innovations providing the best lighting experience for our customers.</p>\n<p><strong>Together we can…</strong></p>\n<ul>\n<li>Develop test scenarios for new features based on user story requirements Support developers with implementation of test scenarios into the test automation framework Support test architect with introduction of test strategies for new features</li>\n<li>Maintain and improve test scenarios for existing features</li>\n<li>Support the development of new features by verifying the user stories in an exploratory way</li>\n<li>Execute manually test scenarios</li>\n<li>Create problem reports and change requests</li>\n<li>Support developers with root cause analyses of bugs</li>\n<li>Verify and validate problem reports, team up with developers</li>\n<li>Validate and release sprint deliverables towards system test group and beta testing</li>\n<li>Report status to product owner and test architect</li>\n<li>Review deliverables of requirements and test cases of peers</li>\n<li>Adhere with processes (including tools, build process) and contribution in process improvements in both own and related project teams</li>\n<li>collaborate with all roles in the development team</li>\n<li>Follow up technical developments in own field and share proactively with others in the team</li>\n</ul>\n<p><strong>You are…</strong>\nA software test engineer developer with good communication skills and quality mindset that is continuously seeking to improve together with the team, the product and daily processes and has passion for Mobile Application Development engineering and innovations in that area. Next to that, you have:</p>\n<ul>\n<li>At least three years’ experience in testing mobile apps</li>\n<li>Good analytical skills with attention for detail</li>\n<li>Able to understand complex technical systems</li>\n<li>Familiar with testing methodologies in agile environment including exploratory testing.</li>\n<li>Experience with writing detailed test scenarios based on available specifications</li>\n<li>Owner of an ISTQB or TMAP certificate or having similar level of test knowledge by experience</li>\n<li>Knowledge of platform specific IDE’s (Apple Xcode, Android Studio) is a plus</li>\n<li>Knowledge of platform specific UI test automation frameworks (Espresso, EarlGrey) is a plus</li>\n<li>Basic knowledge of platform specific languages (Swift, Kotlin) is a plus</li>\n<li>Knowledge of behavior driven testing based on Gherkin terminology is a plus</li>\n<li>Experience in an IoT or systems environment is a plus</li>\n</ul>\n<p><strong>Our offer…</strong>\nWhen joining Signify, you will be part of a global leader with a start-up spirit. We welcome you to a challenging, innovative environment with great opportunities for you to explore. Our benefits are very competitive and designed around your preferences:</p>\n<ul>\n<li>Extensive set of tools to drive your career including personal development budget and coaching</li>\n<li>Healthy work-life balance</li>\n<li>25 Days of leave and the possibility to purchase up to 20 extra days off annually</li>\n<li>A bonus based on both Signify results and personal performance</li>\n<li>Solid company pension scheme and attractive collective health insurance package</li>\n<li>Opportunity to buy Signify shares and products with discount</li>\n</ul>\n<p><strong>Interested?</strong>\nPlease apply online via this link: <a href=\"https://philips.redirect.your-jobresponse.com/m/236879/V819/apply\">Click here to apply!</a></p>\n<p>Agency calls not appreciated</p>\n",
    "how_to_apply": "<p><a href=\"https://philips.redirect.your-jobresponse.com/m/236879/V819/apply\">Click here to apply!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDVYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d2bbd3e2e0303af4f19e5d133e2701e4ebffa6cb/ceee070f-98a0-4980-aed6-ed76ddacc987"
  },
  {
    "id": "748e1a92-ec06-11e8-8005-27e34614d13f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/748e1a92-ec06-11e8-8005-27e34614d13f",
    "created_at": "Mon Nov 19 14:38:03 UTC 2018",
    "company": "Signify",
    "company_url": "http://www.philips.com",
    "location": "Eindhoven",
    "title": "Mobile Software Engineer (C++) - Philips HUE",
    "description": "<h2><strong>We are…</strong></h2>\n<p>Signify, the new company name of Philips Lighting, is the undisputed leader in the lighting industry. Our purpose is to unlock the extraordinary potential of light for brighter lives and a better world.</p>\n<p>You will join the leader in the lighting industry and learn through disruptive challenges. You will be part of a global team, where performance is powered through diversity. Help us shape the future of light in the Internet of Things and work with us on our commitment to achieve a more sustainable future.</p>\n<p>Join us and #findyourmeaning at Signify.</p>\n<p>Since its launch in 2012, Philips Hue is changing the way people interact and experience lighting.</p>\n<p>We have become the world’s leading connected home lighting system that works with all major smarthome platforms (Amazon Alexa, Apple HomeKit, Google, Nest, Smartthings). Philips Hue has encouraged other companies to develop devices, apps and systems that inter-operate with our system.</p>\n<p>Through a vibrant developer program there are more than 600 third-party apps for Philips Hue. The Hue ecosystem is growing rapidly through both new lights, luminaires, sensors, and switches as well as exciting partnerships like Google and Apple. New features are added through agile development processes.</p>\n<p>You will be based at the High-Tech Campus Eindhoven, the smartest square km in Europe, joining a team of passionate software craftsmen working on the world’s leading connected lighting system. Surrounded by usability experts, product owners, software architects and test engineers, you’ll take up the challenge to build high quality and exciting innovations providing the best lighting experience for our customers.</p>\n<h2><strong>Together we can…</strong></h2>\n<p>As a Mobile Software Engineer in the Hue Mobile App Team, you will ensure to deliver on time high-quality deliverables for the Hue SDK or parts of the hue Application. Being member of an agile team, you will seek for continuous improvement and accelerate the development of the product whilst focusing on operational excellence by using or implementing new tools and processes.</p>\n<h2>Next to that, you:</h2>\n<ul>\n<li>Develop new features and partial design for the Hue SDK from end to end through implementation, testing, launch, and further iteration in an agile environment</li>\n<li>Provide input for effort estimations, maintaining personal schedule and reporting on progress using agile scrum practices</li>\n<li>Effective contribution in reviewing deliverables of software components of peers</li>\n<li>Adherence with processes (including tools, build process) and contribution in process improvements in both own team and related teams</li>\n<li>Effective collaboration with all roles in the development team</li>\n<li>Keep abreast of technical developments in own field and proactive knowledge sharing with others</li>\n<li>Working alongside an excellent, cross-functional team, build technical solutions that enable continuous delivery and provide exciting new functionality with the highest quality</li>\n</ul>\n<h2><strong>You are…</strong></h2>\n<p>A highly driven developer with a passion for C++ development in a Mobile Application environment, who:</p>\n<ul>\n<li>Has at least three years of experience and excellent coding skills in C++11</li>\n<li>Has demonstrable object oriented design skills and knowledge of design patterns.</li>\n<li>Has experience with multi-threaded programming</li>\n<li>Has deep knowledge of IDE development tools (XCode, Android Studio, CLion) and CI/CD; static and dynamic analysis tools is a plus</li>\n<li>Experience with TDD (test patterns, dependency injection, test doubles).</li>\n</ul>\n<h2><strong>Our offer…</strong></h2>\n<p>When joining Signify, you will be part of a global leader with a start-up spirit. We welcome you to a challenging, innovative environment with great opportunities for you to explore. Our benefits are very competitive and designed around your preferences:</p>\n<ul>\n<li>Extensive set of tools to drive your career including personal development budget and coaching</li>\n<li>Healthy work-life balance</li>\n<li>25 Days of leave and the possibility to purchase up to 20 extra days off annually</li>\n<li>A bonus based on both Signify results and personal performance</li>\n<li>Solid company pension scheme and attractive collective health insurance package</li>\n<li>Opportunity to buy Signify shares and products with discount</li>\n</ul>\n<h2>Interested?</h2>\n<p>Please apply via this link: <a href=\"https://philips.redirect.your-jobresponse.com/mobile_software_engineer_c_philips_hue_eindhoven/236867/V819/apply\">Click here to apply!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://philips.redirect.your-jobresponse.com/mobile_software_engineer_c_philips_hue_eindhoven/236867/V819/apply\">Click here to apply!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHRYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0306d5657b88d4eb5c7e2a9ef5903da5ddf4677b/c58b8833-ef89-4e03-8901-0f05949a66ea"
  },
  {
    "id": "011d0efa-ec02-11e8-9627-49b976c98ef2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/011d0efa-ec02-11e8-9627-49b976c98ef2",
    "created_at": "Mon Nov 19 13:50:36 UTC 2018",
    "company": "Signify",
    "company_url": "http://www.philips.com",
    "location": "Eindhoven",
    "title": "Mobil Application Developer iOS",
    "description": "<h2>We are…</h2>\n<p>Signify, the new company name of Philips Lighting, is the undisputed leader in the lighting industry. Our purpose is to unlock the extraordinary potential of light for brighter lives and a better world.</p>\n<p>You will join the leader in the lighting industry and learn through disruptive challenges. You will be part of a global team, where performance is powered through diversity. Help us shape the future of light in the Internet of Things and work with us on our commitment to achieve a more sustainable future.</p>\n<p>Join us and #findyourmeaning at Signify.</p>\n<p>Since the launch of in 2012, Philips Hue is changing the way people interact and experience lighting.\nWe have become the world’s leading connected home lighting system that works with all major smarthome platforms (Amazon Alexa, Apple HomeKit, Google, Nest, Smarthings). Philips Hue has encouraged other companies to develop devices, apps and systems that interoperate with our system. Through a vibrant developer program there are more than 700 third-party apps for Philips Hue.</p>\n<p>As a mobile app developer in the Philips Hue mobile app development team, you will work on world-class mobile app technology and push the boundaries of what’s possible with connected lighting products.</p>\n<p>You will be based at the High Tech Campus Eindhoven, the smartest square km in Europe, joining a team of passionate software craftsmen working on the world’s leading connected lighting system. Surrounded by usability experts, product owners, software architects and test engineers, you’ll take up the challenge to build high quality and exciting innovations providing the best lighting experience for our customers.</p>\n<h2>Together we can…</h2>\n<ul>\n<li>Develop new features for Hue from end to end through prototyping, validation, implementation, launch, and further iteration in an agile environment</li>\n<li>Develop and implement key parts of the Hue iOS application</li>\n<li>Work alongside an excellent, cross-functional team, you will build technical solutions that enables continuous delivery and provides exciting new functionality with the highest quality</li>\n<li>Keep abreast of technical developments in own field and proactive knowledge sharing with others</li>\n<li>Challenge yourself to do better every day and have fun while doing so</li>\n</ul>\n<h2>You are…</h2>\n<p>A highly driven developer with a passion for mobile apps, who:</p>\n<ul>\n<li>Has at least 3 years of experience and excellent coding skills in Objective-C and Swift.</li>\n<li>Has a deep knowledge of the iOS SDK and IDE development tools</li>\n<li>Can show off published apps in the Apple AppStore</li>\n<li>Has solid understanding of the agile development process and experience with TDD is a plus</li>\n<li>Cross platform development and test automation experience is a plus</li>\n</ul>\n<h2>Our offer …</h2>\n<p>When joining Philips Hue, you will be part of a global leader with a start-up spirit. We welcome you to a challenging, innovative environment with great opportunities for you to explore. Our benefits are very competitive and designed around your preferences:</p>\n<ul>\n<li>Extensive set of tools to drive your career including personal development budget and coaching</li>\n<li>Healthy work-life balance</li>\n<li>25 Days of leave and the possibility to purchase up to 20 extra days off annually</li>\n<li>A bonus based on both Signify results and personal performance</li>\n<li>Solid company pension scheme and attractive collective health insurance package</li>\n<li>Opportunity to buy Signify shares and products with discount</li>\n</ul>\n<h2><strong>Interested?</strong></h2>\n<p>Please apply via this link: <a href=\"https://philips.redirect.your-jobresponse.com/mobil_application_developer_ios_eindhoven/236861/V819/apply\">Click here to apply!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://philips.redirect.your-jobresponse.com/mobil_application_developer_ios_eindhoven/236861/V819/apply\">Click here to apply!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGRYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--df388b637d19b0f1760a9ae2ae2c43f1f56be1db/7c96c6e8-b036-4808-a0c2-6ee7b8007013"
  },
  {
    "id": "fda26124-e9e7-11e8-9f44-4d0452dab2f9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/fda26124-e9e7-11e8-9f44-4d0452dab2f9",
    "created_at": "Fri Nov 16 21:43:59 UTC 2018",
    "company": "The Franklin Report",
    "company_url": "http://www.franklinreport.com",
    "location": "New York, NY",
    "title": "Software Developer",
    "description": "<p>We’re a hybrid company: a legacy media property with deep authority in our market, looking to create a disruptive piece of software in the job search space. We’re looking for hungry, smart developer to help us build it. You’d be collaborating with an existing team (one US based project lead, a small crew in India) to create the underlying database structure and business logic, and help polish the user interface.</p>\n<p>Extensive work experience is not required. However, proficiency in the .NET platform is a must. Expertise in some but not all of the following languages is crucial:\nMVC.Net\nSQL Server\nC#\nJavascript</p>\n<p>Preference will be given to candidates who can do at least some time in our Manhattan office. However, we are open to remote arrangements for the right fit (US only). The position will start as a part time arrangement, with room to grow into full-time.</p>\n",
    "how_to_apply": "<p>email your resume to <a href=\"mailto:fred@franklinerport.com\">fred@franklinerport.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--56f0ca505d4d7e7584c9c058903dd52c3275e3a0/e4139e25-14a3-48b4-9ab2-caa5f0a61165"
  },
  {
    "id": "b0248344-89e5-11e8-87e5-7d6aa5fe3ed0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/b0248344-89e5-11e8-87e5-7d6aa5fe3ed0",
    "created_at": "Fri Nov 16 16:34:22 UTC 2018",
    "company": "SunteckTTS",
    "company_url": null,
    "location": "Jacksonville, FL (Or Remote)",
    "title": "Sr PHP Developer (Full-stack)",
    "description": "<p>Requirements:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Nice to Haves:</p>\n\n\n\n\n\n\n\n\n<p>About the Role: </p>\n<p>You will be responsible for contributing to the technical design, development, and implementation of the SunteckTTS application ecosystem. The role involves more than just writing production code; in a typical week, you could be: brainstorming technical architecture options, providing feedback to improve our development processes, reviewing PRs from other team members, fixing a bug you randomly came across, or improving unit test coverage.</p>\n<p>We’re looking for an outstanding Senior Developer with a desire to participate in a growing team with the skills, experience, and understanding to join a small, but strong development team. In order to meet the many challenges and high volume work of the SunteckTTS users, it is important for the Senior Developer to have excellent communication.</p>\n<p>About SunteckTTS and the Team:</p>\n<p>SunteckTTS is an industry-leading, full-service, transportation logistics provider that operates through a network of sales, operations, and capacity specialists. We are a billion dollar company with over 200 independently owned and operated agent offices across the U.S. and Canada.\nWe focus on providing asset and non-asset surface transportation to a wide range of end-use markets, including food, lumber, paper, printing, textiles, electronics, machinery, government, and more. The Application Development Group is in the midst of an ambitious program to create best in breed software products and improve existing systems for our user base. Our team of Business Analysts and Developers share a culture of self-ownership and open communication to provide\nmaximum business value. We strive to ensure team-based component ownership, development, and quality assurance. We are a tight knit group that relies on ability and flexibility to ensure we balance our strides towards improved process and need to meet the priorities of a heavily used\nenterprise system. The Application Development Group focuses on a culture of open communication, learning, and transparency.</p>\n<p>SunteckTTS is an Equal Opportunity Employer and does not discriminate against qualified applicants with regard to race, color, religion, age, sex, national origin, handicap, sexual orientation or veteran status.</p>\n",
    "how_to_apply": "<p>Email your resume to:\n<a href=\"mailto:anthony.vargas@suntecktts.com\">anthony.vargas@suntecktts.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzlYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0538ec284289af7dbfceb09ccf27499bfa17aed3/823b3a50-63ca-4309-85b4-9ab437ebd949"
  },
  {
    "id": "deaa4312-e9b1-11e8-9902-330976f7a8e1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/deaa4312-e9b1-11e8-9902-330976f7a8e1",
    "created_at": "Fri Nov 16 15:18:43 UTC 2018",
    "company": "doubleSlash Net-Business GmbH",
    "company_url": "http://www.doubleslash.de",
    "location": "München",
    "title": "Software Developer - Microsoft Azure (m/w)",
    "description": "<p>// KOLLEGEN GESUCHT \n<strong>Software Developer - Microsoft Azure (m/w)</strong> \n// in München \n// ab sofort </p>\n<p>doubleSlash steht seit 1999 für innovative Softwarelösungen und Best Practices zur Digitalisierung von Geschäftsprozessen in Vertrieb, Marketing und Service. Mit einfach nutzbaren, smarten Technologien vernetzen wir Menschen und Maschinen und ermöglichen so neue Geschäftsmodelle.</p>\n<p>Werde Teil unseres neuen Teams am etablierten Standort München und nutze die damit verbundenen Gestaltungsmöglichkeiten. Gemeinsam mit deinen Teamkollegen setzt du innovative Projekte im Bereich Internet der Dinge (loT), Connected Services und Predictive Maintenance um. Deine Begeisterung für loT kannst du dabei nicht nur mit deinen Teamkollegen teilen, sondern auch unser gut ausgebautes Firmennetzwerk zum Know-how-Transfer nutzen.</p>\n<p><strong>Deine Tätigkeiten</strong></p>\n<ul>\n<li>Mitarbeit und technische Teilprojektleitung in agilen loT-Software-Projekten</li>\n<li>Entwicklung von cloud- und webbasierten Kundenanwendungen entlang der kompletten Lieferkette (Anforderungsanalyse, Konzeption, Umsetzung und Betrieb)</li>\n<li>Weiterentwicklung und Optimierung von Software-Architekturen</li>\n<li>Umsetzung von qualitätssichernden Maßnahmen</li>\n<li>Einsatz von modernen Technologien, Methoden und Prozessen: Clean Code, VSTS, .NET, Microsoft Azure, Serum</li>\n</ul>\n<p><strong>Dein Profil</strong></p>\n<ul>\n<li>Erfolgreich absolviertes Studium im Bereich Informatik oder eine vergleichbare Ausbildung</li>\n<li>Praxiserfahrung in Serum Projekten und im genannten Technologieumfeld</li>\n<li>Begeisterung für Cloud und loT</li>\n<li>Zuverlässiger Teamplayer mit hohem Qualitätsverständnis und selbständiger Arbeitsweise</li>\n</ul>\n<p><strong>Das bieten wir Dir</strong></p>\n<ul>\n<li>Gute Work-Life-Balance</li>\n<li>Flexible Arbeitszeiten</li>\n<li>Drei attraktive Standorte\n</li>\n<li>Teamspirit</li>\n<li>Team-/Firmenevents</li>\n<li>Sportevents\n</li>\n<li>Attraktive Benefits, wie z.B. Essenszulagen, JobRad, ...</li>\n<li>Betriebliche Krankenzusatzversicherung\n</li>\n<li>Talentförderung</li>\n<li>Vielfältige Weiterbildungsmöglichkeiten</li>\n<li>Betriebliches Innovationsmanagement</li>\n</ul>\n<p>Wir freuen uns auf Deine Bewerbung über diesen Link <a href=\"https://doubleslash.redirect.your-jobresponse.com/software_developer_microsoft_azure_m_w_muenchen/236641/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a> oder an: <a href=\"mailto:karriere@doubleSlash.de\">karriere@doubleSlash.de</a></p>\n<p>Leonie Hlawatsch \nHuman Resources Manager \n+49 7541 70078-728 </p>\n<p>Mehr Jobs und Infos auf: doubleSlash.de</p>\n",
    "how_to_apply": "<p><a href=\"https://doubleslash.redirect.your-jobresponse.com/software_developer_microsoft_azure_m_w_muenchen/236641/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3hYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1d4aa0fef5069ce7fb04b332f2f5afbd98be5866/8b34a919-5ab9-45b9-99ff-69d3a82ec0d7"
  },
  {
    "id": "b99f4c2c-e94b-11e8-8abf-17c73d6427e2",
    "type": "Contract",
    "url": "https://jobs.github.com/positions/b99f4c2c-e94b-11e8-8abf-17c73d6427e2",
    "created_at": "Fri Nov 16 03:01:16 UTC 2018",
    "company": "Ikayzo",
    "company_url": "http://ikayzo.com",
    "location": "Vancouver (remote)",
    "title": "Senior Software Engineer - Ruby on Rails / React ",
    "description": "<p><strong>Remote position for Vancouver, BC residents</strong></p>\n<p><a href=\"http://ikayzo.com\">Ikayzo</a>, a boutique software development firm based in Honolulu, is looking for experienced Ruby on Rails developers with strong React skills capable of taking complex projects from ideation to release. In this role he / she will be responsible for building high quality, secure and scalable web applications in the finance / fintech space. Our customers include industry leading software firms, renewable energy companies and financial institutions.</p>\n<p>Please provide your GitHub profile or another work example reference in your resume.</p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>A solid grounding in OO software architecture / design patterns</li>\n<li>A pragmatic approach focused on delivering on-time while maintaining quality</li>\n<li>Experience designing and implementing successful non-trivial enterprise Ruby on Rails projects (5+ years)</li>\n<li>Experience with ReactJS (Reflux or Redux)</li>\n<li>Experience with agile development methodologies</li>\n<li>Comfort with Git Feature Branch Workflow and the ability to incorporate PR feedback quickly</li>\n<li>Firm grasp of data modeling</li>\n<li>A passion for software development</li>\n</ul>\n<p><em>Note: Specialized finance domain knowledge is not required but successful applicants must be able to quickly understand complex business rules and calculations.</em></p>\n<p>We are not accepting applications from recruiters for this position.</p>\n",
    "how_to_apply": "<p>Send resumes to <a href=\"mailto:career@ikayzo.com\">career@ikayzo.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fe74b61172b5e2551482923d6459b31814afbde1/a4dc87ba-891e-4dc3-a3e8-30201cbdbacc"
  },
  {
    "id": "28dec9da-e90d-11e8-8317-fd99c2c2fb01",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/28dec9da-e90d-11e8-8317-fd99c2c2fb01",
    "created_at": "Thu Nov 15 19:33:10 UTC 2018",
    "company": "Acadian Asset Management",
    "company_url": "https://www.acadian-asset.com/",
    "location": "Boston, MA",
    "title": "Senior Quantitative Developer, Multi-Asset Class Strategies ",
    "description": "<p>Position Overview:\nWe are looking for a senior quantitative developer to join our Multi-Asset Class Strategies (MACS) team, who will own all aspects of quantitative model development for the team – including design, implementation, visualization and maintenance. MACS is a new and growing business at Acadian and focuses on all major global asset classes including: Equities, Fixed Income, Currencies, Commodities and Options/Volatility. As a member of the investment team, this person will closely collaborate with PMs and quantitative researchers and will have opportunities to contribute to research and investment decisions.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Responsible for all aspects of quantitative model development for the MACS Team</li>\n<li>Work with PMs and researchers to design and implement sophisticated quantitative multi-asset models</li>\n<li>Design and implement state of the art model visualization capabilities</li>\n<li>Maintain all aspects of the models including daily production jobs</li>\n<li>Build systems to gather, cleanse and integrate data from various sources</li>\n<li>Apply advanced algorithms from the field of quantitative finance and computational science to assist in the research of macroeconomic and financial variables</li>\n<li>Contribute to the MACS research agenda and investment decisions</li>\n</ul>\n<p>Qualifications:</p>\n<ul>\n<li>Minimum 7+ years of experience as a quantitative developer for an investment firm</li>\n<li>Master’s degree with an outstanding academic record in a technical field such as mathematics, science or engineering; PhD degree preferred</li>\n<li>Hands on development experience with Python (Pandas, Numpy) for modeling/analytical work and SQL for data access and architecture; JavaScript experience for visualization a plus</li>\n<li>Very strong mathematical skills; experience with Bayesian estimation and optimization is a plus</li>\n<li>Proficiency in multi-asset class data series and operating data delivery platforms</li>\n<li>Superior software, database design and programming skills to move quickly from concept to solution</li>\n<li>World-class analytic skills and the ability to clearly articulate approach, process and results in verbal, graphical and written form</li>\n<li>Creativity, enthusiasm, collegiality and the ability to excel in a self-starting environment</li>\n<li>Drive and humility to deliver on high value projects and roll up your sleeves attitude</li>\n</ul>\n<p>It is the policy of Acadian Asset Management LLC to provide equal employment opportunity to all qualified persons without regard to race, creed, color, sex, age, national origin, marital status, veteran status, citizenship status, disability, or sexual orientation.</p>\n",
    "how_to_apply": "<p><a href=\"https://www.acadian-asset.com/careers\">https://www.acadian-asset.com/careers</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkJXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--581ce0319cf361a6680906a74565427148d2f9e2/1e0bbfdc-4638-486b-975a-0906de4dfa19"
  }
]